[
{"title": "Beto 2020 off to a rocky start", "body": ["Democratic presidential hopeful Beto O'Rourke vows to run a 'respectful' campaign; Mike Emanuel reports from Washington.", "\n**Want FOX News Halftime Report in your inbox every day? Sign up ", ".**", " “A more disciplined candidate might not have been so sloppy, with months to prepare and adoring crowds waiting. Yet there was ", ", wobbling on policy, offending women with a joke about child care, frustrating local Democrats with his high-handedness and picking bewildering fights with the media. … O’Rourke’s liabilities began showing soon after he arrived in Iowa, the first-in-the-nation caucus state. On Friday, the second day of his campaign, the former Texas congressman was forced to apologize for what he called ‘really hateful’ writings from his youth… Hours later, O’Rourke was apologizing for ham-handedly joking about his wife, ", ", raising their children ‘sometimes with my help.’ … Yet he was still confronting his previous comments as recently as Sunday — after drawing criticism for remarks printed on the cover of Vanity Fair in which O’Rourke said before entering the race that he was ‘just born to be in it.’ … It was not a clean start to O’Rourke’s 2020 run. Though he benefited from nonstop media coverage, a blockbuster initial fundraising figure, and his own political acuity … O’Rourke’s opening act also laid bare disorder in his nascent campaign.”", " ", " “Beto O’Rourke reported raising more than $6.1 million during the first 24 hours of his presidential campaign, a record-setting haul that narrowly tops the amount announced by Sen. ", " and dwarfs everyone else in the 2020 field. O’Rourke was a fundraising juggernaut during his U.S. Senate race in Texas last year, but there were significant questions about whether that would translate to a national campaign… The answer appears to be yes. O’Rourke’s campaign said he raised $6,136,763 from donations that came from all 50 states, D.C., and every U.S. territory. ‘In just 24 hours, Americans across this country came together to prove that it is possible to run a true grassroots campaign for president — a campaign by all of us for all of us that answers not to the PACs, corporations, and special interests but to the people,’ O’Rourke said in a statement.”", " “The first time Beto O’Rourke praised ", ", it could have been dismissed as an act of diplomacy. ‘I don’t see why not,’ the newly minted presidential candidate said Friday when asked outside a campaign stop in Washington, Iowa, whether he thought Biden should run for president. ‘I think he’s done an extraordinary job for this country as senator and as vice president. … I think very highly of him.’ Then it happened again, when an Iowan in Independence told O’Rourke, who is 46, that he wanted ‘to see some young people run for president’ and would prefer that Biden — who has 30 years on O’Rourke — stay out. O’Rourke could have let the comment hang in the air, but he came immediately to Biden’s defense. And Biden was still on his mind several hours later.”", " “The Republican National Committee on Sunday tweeted out a ‘special message’ from ‘noted Irishman Robert Francis O’Rourke,’ by sending his mugshot with a leprechaun hat that was widely criticized as insensitive. O’Rourke has previously admitted to a 1998 arrest when he was 26 for drunken driving and said nothing else will come out that could be used against him during the 2020 presidential campaign. O’Rourke told supporters Sunday that there’s ‘nothing’ he hasn’t already revealed about his past that could come back to hurt his run for office. The Washington Examiner reported that several high-profile Republicans came out against the tweet. An aide for Sen. ", ", R-Ky., tweeted, ‘If you think you’re funny or clever by stereotyping and making fun of any race or nationality to score political points, you’re an idiot, and you should probably not tweet.’”", "\n“I have thought it not superfluous to give the outlines of this important portion of history; both because it teaches more than one lesson, and because, as a supplement to the outlines of the Achaean constitution, it emphatically illustrates the tendency of federal bodies rather to anarchy among the members, than to tyranny in the head.” – ", " “‘French fries’ might not be on the menu if not for ancient farmers, and not because we can now grow plenty of potatoes, but because it would be harder to enunciate the ", "sounds needed to order them. The ability to make labiodental sounds—which are sounds that require you to put your lower lip on your upper teeth, such as ", "and ", " sounds—may not have fully developed until agriculture introduced softer foods to the human diet, changing our jaws, according to an intriguing and controversial study published [on March 14] in ", ". Orthodontists know that overbite … are common among people all over the world. But the study’s authors assert that such jaw structures were rarer in the Paleolithic Period, when hunter-gatherer’s rough diets demanded more force from teeth that met edge to edge. Agriculture softened our ancestors’ diets with processed gruels, stews and yogurts, and this fare led to gradually shrinking lower jaws to produce today’s overcrowded mouths.”", " Email us at ", " with your tips, comments or questions.", "41.6 percent", " 53.8 percent", "-12.2 points", " down 1.4 points ", "\n[", ".]", " “New York Sen. ", "made official what already was well-known Sunday, formally joining the crowded Democratic field of candidates for president in 2020. ‘I’m running for president,’ she tweeted. ‘Let’s prove that brave wins.’ Gillibrand, 52, made the announcement on Twitter with a two-and-a-half- minute campaign video titled ‘The Brave.’ She discusses ‘The Star-Spangled Banner’ and urges Americans in ‘the home of the brave’ to support her and her policies. Gillibrand talks about universal health care, family leave, an end to gun violence, the Green New Deal and campaign finance changes. The video concludes with the senator saying that each generation must answer the anthem's question, whether the brave will win. … Gillibrand, one of six women in the Democratic field, launched an exploratory campaign in January. Recent polling of the field shows her garnering 1 percent or less of the vote – an important number because claiming 1 percent or more would qualify her for primary debates.”", " “With a record number of female candidates running for president, some male Democratic contenders are signaling that a woman will be on their 2020 ticket — just not at the top. Two male candidates, Senator ", " of New Jersey and Beto O’Rourke, the former Texas congressman, suggested this weekend that they would pick a woman as their vice president if they won the nomination. ‘It would be very difficult not to select a woman, with so many extraordinary women who are running right now,’ Mr. O’Rourke told reporters in Iowa on Saturday night. … Announcing the demographic profile of a potential vice-presidential pick is highly unusual, especially more than 10 months before the first round of voting takes place in Iowa. The comments reflect a desire by male candidates to show that they are not taking female voters for granted, particularly as so many women mount bids of their own for the nomination. … Issues of race and gender have already emerged as a central theme of the Democratic primary race…”", " “After watching ", " transform the judiciary over the past four years, liberals are demanding a bold response. And Democrats are listening. Sens. ", ", ", " and Kirsten Gillibrand told POLITICO they would not rule out expanding the Supreme Court if elected president, showcasing a new level of interest in the Democratic field on an issue that has until recently remained on the fringes of debate. The surprising openness from White House hopefuls along with other prominent Senate Democrats to making sweeping changes — from adding seats to the high court to imposing term limits on judges and more — comes as the party is eager to chip away at the GOP’s growing advantage in the courts. … Expanding the Supreme Court would amount to a historic power play by the next Democratic president and Congress, requiring an intense legislative fight and the abandonment of many judicial and congressional norms.”", " “Maryland Gov. ", " acknowledges that many Republicans nationwide who have heard about his potential presidential ambitions probably view him as a centrist with little hope of finding support in ", "’s GOP. But amid growing tensions between Trump and Republican lawmakers over foreign policy and the president’s treatment of global alliances, Hogan is signaling that if he decides to wage an insurgent campaign for the GOP nomination, he would pitch himself as far more in tune with the party’s long-held values and worldview than Trump. ‘I come from the ", "school of politics,’ Hogan said last week in a wide-ranging interview at the state capitol, shaking his head in disapproval when asked whether he shares Trump’s nationalism. He said groups such as the North Atlantic Treaty Organization, a frequent target of Trump’s ire, are ‘critically important.’ He expressed alarm about the way the president is ‘not standing by or standing up for some of our allies,’ and he poked fun at Trump’s competence.”", " “Amid signs that special counsel ", "'s investigation into Russian election interference may be near its conclusion, a new USA TODAY/Suffolk University Poll finds that trust in Mueller has eroded and half of Americans agree with President Donald Trump's contention that he has been the victim of a ‘witch hunt.’ Support for the House of Representatives to seriously consider impeaching the president has dropped since last October by 10 percentage points, to 28 percent. Despite that, the survey shows a nation that remains skeptical of Trump's honesty and deeply divided by his leadership. A 52 percent majority say they have little or no trust in the president's denials that his 2016 campaign colluded with Moscow in the election that put him in the Oval Office. That number does reflect an improvement from previous polls. One year ago, 57 percent had little or no trust in his denials; in December, 59 percent did. Twenty-eight percent say they have a lot of trust in former FBI director Mueller's investigation to be fair and accurate. That's the lowest level to date and down 5 points since December.”", " “President Trump on Saturday backed bipartisan calls in Congress for FBI Special Counsel Robert Mueller’s report into Russian interference in the 2016 election to be made public. ‘Play along with the game!’ the president told Republicans. ‘On the recent non-binding vote (420-0) in Congress about releasing the Mueller Report, I told leadership to let all Republicans vote for transparency,’ he tweeted. ‘Makes us all look good and doesn’t matter.’ The House voted on Thursday in support of a nonbinding resolution to encourage Attorney General ", " to release the report, amid continuing concerns in some quarters that it won't be made public. Four Republican lawmakers voted present. Since the measure is nonbinding, Mueller, Barr and Trump cannot be forced to release more information to Congress and the public than the Justice Department and federal law require.”", " - ", "- ", " - ", " - ", "- ", "\n“I try to just avoid ruling things out when there’s others who are in control. The Lord will get me to the right place.” –", "Email us at ", " and please make sure to include your name and hometown.", " “After leading police on a chase across Campus Parkway in Indiana this weekend, a runaway cow crossed over three lanes of traffic before stopping at a Chick-fil-A. With traffic halted for a short while, one driver was able to capture video of the bovine on the loose. In the video … you can see the cow cross over the highway and head down a hill toward the restaurant. A police car pulls up behind the cow shortly after it crosses. … The Noblesville Police Department had some fun with the incident, posting on Facebook that they ‘ran with the bulls’ while chasing a wild bovine all over.”", "\n“You bring criminals to justice; you rain destruction on combatants. This is a fundamental distinction that can no longer be avoided.” –"]},
{"title": "Fox News Poll: Biden, Sanders top Democratic preference", "body": ["So many Democrats are running for president the race feels like a March Madness bracket. If it were, the No. 1 seeds would be former Vice President Joe Biden and Vermont Sen. Bernie Sanders.", "Either would be favored to beat President Donald Trump in the 2020 finals, according to the latest Fox News Poll.", "Democratic primary voters were read a list of 20 announced and potential candidates for the 2020 nomination. Biden is the top choice at 31 percent, followed by Sanders at 23 percent.", "California Sen. Kamala Harris (8 percent) and former Texas Rep. Beto O’Rourke (8 percent) make up a second tier. They are followed by New Jersey Sen. Cory Booker (4 percent), Massachusetts Sen. Elizabeth Warren (4 percent), and New York Sen. Kirsten Gillibrand (2 percent).", "The other candidates are the political equivalent of a 16th seed -- they receive less than two percent.", "Eleven percent are unsure of their picks.", "Men, women, whites, non-whites, college graduates, and non-graduate Democratic primary voters all put Biden first and Sanders second. Sanders has the edge among those under age 45, while Biden is first for those 45 and over.", "Democratic primary voters are more likely to support a candidate they think can beat Trump (51 percent) than the candidate they like the most (36 percent).", "While Biden is technically undeclared, he slipped up and said he is entering the 2020 race. An official April announcement is expected.", "Two-thirds of Democratic primary voters want Biden to run, and he is the top choice among those who prioritize beating Trump, followed by Harris, Sanders, and O’Rourke.", "Among those who say it is more important to vote for the candidate they like than the one who could win, Sanders is the first choice, followed by Biden.", "“Democratic primary voters would welcome Biden into the field, should he run,” says Democratic pollster Chris Anderson, who conducts the Fox News Poll with Republican Daron Shaw. “They prioritize beating Trump, and as of now Biden fares best of the more widely known Democratic candidates against Trump.”", "The poll also asks Democratic primary voters about policies. Majorities are “very” likely to back a candidate who supports Medicare for all (67 percent) and a 70 percent tax rate on income over $10 million (53 percent). Less than 4 in 10 are very likely to vote for a candidate who supports passing the Green New Deal (37 percent), paying reparations to descendants of slaves (31 percent), and abolishing Immigration and Customs Enforcement or ICE (25 percent).", "The hypothetical head-to-heads among registered voters show support for Trump stays between 40-42 percent against each Democrat tested. He tops both Harris (39-41 percent) and Warren by 2 points (40-42 percent).", "Sanders has a 3-point edge over the president (44-41 percent), but Biden performs best, topping Trump by 7 points (47-40 percent).", "The head-to-head matchups between Trump and Sanders, Harris, and Warren are within the poll’s margin of sampling error. Biden’s lead is just outside it.", "“There is ambivalence at this early stage of the nomination process,” says Shaw. “Democrats want Trump out any way possible, but they also have a set of public policy preferences that would have been considered way outside of the mainstream even 10 years ago.  This has major implications for all candidates and especially for Biden.  Democrats like him, they want him to run, and are likely to be impressed Biden currently runs well against Trump, but do they think winning the White House depends on him?  If not, the rationale for his candidacy is unclear.”", "Finally, 41 percent of Democratic primary voters would rather Trump be voted out of office in 2020 than impeached. That matches the 41 percent who prefer he be impeached and removed before the election.", "Now that would be a real bracket-buster.", "The Fox News poll is based on landline and cellphone interviews with 1,002 randomly chosen registered voters nationwide, including 403 Democratic primary voters, and was conducted under the joint direction of Beacon Research (D) (formerly named Anderson Robbins Research) and Shaw & Company Research (R) from March 17-20, 2019. The poll has a margin of sampling error of plus or minus three percentage points for all registered voters and plus or minus five percentage points for Democratic primary voters."]},
{"title": "DHS Secretary Nielsen: Midterms will be ‘most secure election in the modern era,’ but US will respond if attacked", "body": ["Homeland Security Secretary Nielsen will oversee the nationwide 'situation room' on election night that tracks cyber threats to voter databases, as well as online efforts to influence voters' decisions. Catherine Herridge has the exclusive report for 'Special Report.'", "DHS Secretary Kirstjen Nielsen said Friday she believes the midterm elections will be the “most secure election in the modern era” but told Fox News in an exclusive interview that “everything is on the table” if others try to meddle with the vote.", "In New York City for a cyber security event at the Council on Foreign Relations, Nielsen said the government is in a “tremendously different place” than in 2016, when the Russians attempted to interfere in the presidential election.", "\"I do think it's safe to stay this will be the most secure election in the modern era,” Nielsen said. “We are in a tremendously different place than we were in 2016 in terms of partnerships with state and locals and everything they have done to secure their infrastructure.\"", "Pressed on whether a cyber response is being readied by the United States if attacked, Nielsen said, \"Everything is on the table. I think the president has made it very clear if we are attacked we will defend ourselves so every element of power that we have available to us will be considered in terms of our response.\"", "Nielsen, along with FBI Director Chris Wray and Director of National Intelligence Dan Coats, gave Trump an election security briefing on Thursday. She said the president’s \"basic message was elections are the heart of our democracy. It's extraordinarily important that Americans have confidence in them.\"", "Nielsen will oversee a virtual, nationwide \"situation room\" on election night that tracks cyber threats to voter databases, as well as online efforts using propaganda and disinformation to influence voters' perceptions and decision making.", "The National Cybersecurity and Communications Integration Center (NCCIC) and the Department of Homeland Security have implemented monitoring for the midterms that covers about 90 percent of registered voters. Known as Albert sensors, the program flags cyber intruders. More than half of all states have completed vulnerability assessments, DHS says.", "The intelligence community recently warned that Russia, China and Iran leverage social media to amplify issues that divide voters.  Last cycle, a Russian troll factory masqueraded online as U.S. citizens, officials said, and earlier this year, Beijing sponsored pro-China ads to sway American farmers.", "\"We continue to see extraordinarily aggressive actions by multiple countries to influence the way Americans think,” she said.", "Nielsen warned that foreign governments and hackers may not breach voting systems but they may still exploit election night \"to sow confusion, discord and mistrust by placing stories in social media or state sponsored media that something was wrong.”", "But, she said, “I think all Americans should wait and not jump to conclusions. We will do the assessment.\""]},
{"title": "Republicans taking no-mercy approach to even longshot 2020 Democrats", "body": ["Former DNC deputy press secretary says it is too early to know who will emerge as the winner, but Julian Castro will add a great voice to the debate.", "Even lesser-known prospective Democratic 2020 presidential hopefuls are already facing a withering barrage of criticism from the Republican establishment, foreshadowing a historically fierce and competitive campaign season as higher-profile potential nominees like former ", " and ", " wait in the wings.", "Former Housing and Urban Development (HUD) Secretary ", " and Hawaii Rep. ", " -- widely considered longshot candidates with relatively little name recognition -- have also come under fire from the left in the days after they formally declared they would run, as Democrats hope to find a candidate who can realistically unseat President Trump.", "“Julián Castro has made history by becoming one of the biggest lightweights to ever run for president,\" Republican National Committee (RNC) spokesman Michael Ahrens said in a statement shortly after ", " surrounded by reporters in his hometown San Antonio, Texas on Saturday. \"He was a weak mayor who couldn’t even handle being HUD secretary. This is obviously just another desperate attempt to become someone else’s running mate.”", "Castro, 44, was the mayor of San Antonio for five years before serving in the Obama administration for less than three. But the RNC, as part of a comprehensive response to Castro's candidacy, has issued rapid-response documents pointing to contemporaneous reporting that has characterized Castro's government service as wholly unremarkable.", "San Antonio's mayorship was a part-time position paying only $3,000 a year and roughly equivalent to a city councilmember role when Castro held the job, and the city's executive leadership was almost entirely conducted by a separate official who acted as city manager -- an inconvenient fact for Castro that was noted not only by the GOP this week, but also by left-leaning Vox.com in 2016.", "Dylan Matthews, writing for Vox in 2016, ", " because he \"simply is not qualified to be one heartbeat away from the presidency.\"", "\n      Former San Antonio Mayor and Housing and Urban Development Secretary Julian Castro, front left, waves as he arrives with his family to an event where he announced his decision to seek the 2020 Democratic presidential nomination, Saturday, Jan. 12, 2019, in San Antonio. (AP Photo/Eric Gay)\n      ", "\"Picking Castro would look like Clinton selecting a Dan Quayle–like lightweight, who lacks the requisite policy knowledge and experience to assume the presidency should something happen to her,\" Matthews argued.", "Also in 2016, ", " in an unflattering profile that Castro didn't want to lead the Department of Homeland Security because he was worried about the political ramifications of a terrorist attack on his watch. Citing several sources, Politico reported that once at HUD, Castro would \"freeze up\" whenever \"detailed policy questions about housing and mortgage financing came up,\" and seemed \"not interested enough in HUD policy to want to engage deeply.\"", "In his speech Saturday, Castro, a Stanford University and Harvard Law School graduate, emphasized his goals of universal health care and fighting climate change more than his credentials. \"I’m running for President because it’s time for new leadership and to make sure opportunities I had are available to every American,\" he said.", "But, separate from the GOP-led attacks, Castro's limited name recognition posed a readily identifiable and immediate challenge to his bid.", "“People here in San Antonio know him obviously -- but, if you get out of Texas, and you ask an ordinary citizen on the street, and you say, Julian Castro, they’ll probably say, who?” Johnny Arredondo, a member of the Republican Club of Bexar County, told Fox News this weekend.", "Washington Free Beacon reporter Alex Griswold wrote on Twitter Monday that it \"only took about a day\" for everyone to move on from Julian Castro, amid reports that New York Democratic Sen. Kirsten Gillibrand might announce the formation of a presidential exploratory committee on Tuesday.", "The 37-year-old Gabbard, meanwhile, has also come under political attacks more typically endured by frontrunners mid-campaign cycle. Gabbard announced her presidential bid in an interview Friday.", "Republicans -- and many Democrats -- quickly focused on Gabbard's support for Syrian President Bashar al-Assad, whose government lawmakers have accused of war crimes and even genocide during that country's brutal civil war. Gabbard met with Assad secretly in 2017 without first informing top Democrats, and has dismissed Assad's opponents as \"terrorists.\"", "Democratic Rep. Tulsi Gabbard barely finished announcing she is running for president in 2020 when the spotlight quickly shifted to anti-gay comments and actions from her past.", "Gabbard has also made headlines for referring to President Trump as \"Saudi Arabia's b----,\" after the president argued for the importance of a strong U.S-Saudi relationship amid calls for him to take a tougher stance on the kingdom in response to the killing of writer Jamal Khashoggi.", "“", " has an even bigger problem than her lack of experience – it’s that she has no base of support,\" an RNC spokesman said. \"Liberals think she’s too conservative, conservatives think she’s too liberal, and just about everyone thinks her coziness with Bashar al-Assad is disturbing.”", "Gabbard, an Iraq War veteran, is known for being politically unpredictable, something she has publicly said she takes pride in. She famously resigned as Democratic National Committee (DNC) vice chair in 2006 to endorse Vermont Independent Sen. Bernie Sanders' presidential bid. (Sanders, another potential 2020 contender, ", "by accusations that he failed to clamp down on sexual misconduct allegations against some of his staffers during that campaign.)", "But some of Gabbard's most fiery remarks against same-sex marriage in years past, as well as her active campaign to promote “traditional marriage” legislation, have drawn intense scrutiny from the left.", "In years past, she several times referred to LGBTQ  activists as “homosexual extremists,” a view that echoes that of her father, Mike Gabbard, whom ", " described as having long been “Hawaii’s leading opponent of the gay-rights movement, an energetic and often brusque activist who stood ever ready to denounce what he called ‘the radical homosexual agenda.’”", "\"So, she’ll co-sponsor bills supporting LGBTQ rights, but still personally thinks we’re icky,\" ", ", the editor-at-large for the liberal media watchdog group Media Matters for America, on Twitter. \"In any case, it’s really weird to see self-described leftists line up to support her instead of more progressive candidates. That’s all.\"", "Gabbard, who has apologized for her previous comments, was a visible force against same-sex marriage, and in 2004 spearheaded a fight in the state against a same-sex union measure. “To try to act as if there is a difference between ‘civil unions’ and same-sex marriage is dishonest, cowardly and extremely disrespectful to the people of Hawaii,” she said at the time. “As Democrats, we should be representing the views of the people, not a small number of homosexual extremists.”", "\n      Former Vice President of the U.S. Joe Biden speaks during a political rally in Newark, New Jersey, U.S., October 12, 2017. REUTERS/Eduardo Munoz - RC1D37E63DA0\n      ", "Gabbard then also blasted Massachusetts’ passage of same-sex marriage legislation, making it the first in the nation to recognize gay marriage. Speaking on behalf of the Alliance for Traditional Marriage and Values, a group headed by her father, she said the Massachusetts marriage law would cause a ripple effect across the country.", "“It is highly likely that federal judges will soon be tearing apart our U.S. Constitution in order to force same-sex marriage down the throats of the people of Hawaii and America,” Gabbard said. “The only way to protect traditional marriage in Hawaii and throughout our country, the only way to stop activist federal judges from rewriting our constitution, is by the passage of the Federal Marriage Amendment.”", "Another lesser-known declared presidential candidate, ", ", has largely escaped the harshest criticism from both parties, in part because of his status as a dark horse among dark horses. On ABC's \"This Week\" on Sunday, Delaney -- who has called for universal health care and reversing Trump's tax cuts -- ", ", rather than immediately achieving progressive political goals.", "Former Maryland Rep. John Delaney discusses his vision for his 2020 campaign.", "The first 100 days of a presidency, Delaney said, are more about proving \"to the American people that we can actually start solving problems and getting things done,\" rather than passing sweeping new progressive legislation.", "But campaigning in Cedar Rapids, Iowa, on Saturday, Delaney drew a crowd of only about 50, ", ", and he faced explicit questioning about his electability.", "Should Delaney's profile rise, however, he can likely expect to face the no-holds-barred approach that GOP leaders have taken against virtually every other known White House contender -- including the more prominent ones, like Massachusetts Sen. Elizabeth Warren.", "\"If Elizabeth Warren, often referred to by me as Pocahontas, did this commercial from Bighorn or Wounded Knee instead of her kitchen, with her husband dressed in full Indian garb, it would have been a smash!\" Trump wrote on Twitter Sunday evening, referring to his frequent criticism of Warren for previously claiming Native American ancestry during her academic career based on scant evidence.", "Warren, seeking to blunt that line of attack, took a DNA test late last year that showed she may have had a distant Native American ancestor -- ", ", including the Cherokee Nation, who charged that it was inappropriate and even racist to use a DNA test to assert tribal heritage.", "Trump then took a shot at Warren's decision to livestream herself drinking a beer in her kitchen on New Year's Eve, in a move reminiscent of similar Instagram broadcasts by younger Democratic firebrands like New York Democratic Rep. Alexandria Ocasio-Cortez and former Texas Senate candidate Beto O'Rourke. At one point in the livestream, Warren turned to her husband and thanked him for his presence.", "\"Best line in the Elizabeth Warren beer catastrophe is, to her husband, “Thank you for being here. I’m glad you’re here.,'\" Trump wrote. \"It’s their house, he’s supposed to be there!\""]},
{"title": "Julian Castro, former Obama official, forms 2020 presidential exploratory committee", "body": ["\n          Democrat Julian Castro announced he's formed an exploratory committee for a potential 2020 presidential campaign. \n          ", "Julian Castro, former President Barack Obama’s housing chief, has launched a ", " exploratory committee.", "“Americans are ready to climb out of this darkness. We’re ready to keep our promises. And we’re not going to wait. We’re going to work,” Castro, 44, said in a video. “That’s why I’m exploring a candidacy for president of the United States in 2020.”", "An exploratory committee usually is a formality before a candidate launches a presidential campaign. It legally allows potential candidates to begin raising money.", "The former San Antonio mayor said his official decision will be announced on Jan. 12. In the meantime, he encouraged voters to ", " to receive email updates.", "The early jump gives Castro an advantage as bigger name Democrats have continued to be floated as potential 2020 candidates, including Sens. Elizabeth Warren of Massachusetts, Bernie Sanders of Vermont and Cory Booker of New Jersey. Former Vice President Joe Biden and outgoing Rep. Beto O’Rourke, who excited donors in ", " against Texas Sen. Ted Cruz this year, have also been rumored to be considering presidential bids.", "\"I'm also very mindful, especially now for the Latino community, that there's a particular meaning to my candidacy.\"", "Castro would be among the youngest candidates in the field and the most prominent Latino. He told The Associated Press he plans to consult leaders in his party but hasn’t spoken to Obama yet.", "For Castro, running for president would fulfill a destiny that Democrats have projected since he was elected San Antonio mayor at 34, followed by his star-making turn as the keynote speaker at the Democratic National Convention in 2012.", "He is the grandson of a Mexican immigrant and son of a Latina activist. His twin brother, Joaquin Castro, is a Democratic congressman from Texas. The brothers were raised by a single mother who taught them to “make your future happen,” the former mayor said in his video.", "Castro told The Associated Press the Latino community has been treated “like a piñata” under President Trump.", "\"I'm also very mindful, especially now for the Latino community, that there's a particular meaning to my candidacy,\" Castro said. \"We can't go through the 2020 cycle with nobody on that stage because of what's happened over the last couple of years.\"", "Republican National Committee spokesman Michael Ahrens said there is no \"bigger lightweight in the 2020 field than Julian Castro\" in a statement provided to Fox News.", "\"His mayoral job was largely ceremonial, he was in totally over his head at HUD, and no, he doesn't even know Spanish,\" Ahrens said.", "So far, the only declared 2020 Democratic candidate is ", ". Sanders, who ran in 2016, ", " “probably run” if he believes he's the best choice to defeat Trump."]},
{"title": "Warren’s lonesome tribe of one", "body": ["On 'The Ingraham Angle,' Cherokee Nation citizen says Warren relies on false stereotypes to prop up false claims.", "**Want FOX News Halftime Report in your inbox every day? Sign up ", ".**", "Midterms are to presidential elections as Thanksgiving is to Christmas – smaller, less intense, less expensive – but you’d still better not get caught with your reindeer trampling on our cornucopia.", "\nBut this week, Sen. ", " crashed her whole dang sleigh into her party’s decorative gourds. ", "\nWhile Warren is technically running for re-election, she’s in no danger. The multi-media rollout of her initial claim that she was in fact a descendant of Native Americans, a woman of whom it would be racist to mock as “", ",” was all about 2020.", "\nWarren has for years now been feeding off of the attention given to her by ", ", who claims she is his preferred opponent for 2020. Warren, a lousy campaigner who has developed some skills since arriving on the national scene as ", "’s designated pitchfork populist, at least figured out how to make the most of the Trump attacks.", "\nBut on the issue of her past claims of Native heritage, Trump had her in a pickle. If she was found to have claimed such status without Native blood she would not only be a faker, but also a rich white woman exploiting the hardships of a tragic history of America’s tribal people.", "\nWarren decided that she would flip the script and had a DNA test conducted, which showed that at best she had a full-blooded Native ancestor five generations ago, and at worst barely any native blood at all. Ill-conceived and poorly executed, Warren’s genetic jump out quickly turned into a disaster as it was revealed that not only was she ", " Native than the average American white person, but that Native tribes, particularly the Cherokee to which she claimed association, condemned her conduct as obtuse and damaging.", "\nThat’s all interesting stuff when it comes to the Democrats in 2020. It’s particularly good news for her number one foe, at least initially, Sen. ", ", I-Vt. But who cares? We have a major mamajama midterm in just three weeks!", "\nDemocrats need very much to get the national conversation back to one of two subjects: Health insurance or Donald Trump.", "\nTrump is certainly helping, arguing as he is with a sex worker to whom he is said to have made cash payments. Whenever the president is in a fight with someone over the size of his male organ, we would not typically call it an “on message” day for a party in a midterm cycle.", "\nBut rather than keeping all eyes trained on the latest indignities of the president’s personal life, Warren’s fumbling wasted two crucial days of midterm campaigning discussing her own situation.", "\nYou might do what former Housing and Urban Development Secretary ", " did and stump for other candidates, grind out a campaign biography and do some ", ".", "\nYou might do what Sen. ", ", D-Calif., did and use your current seat for a little political theater while also making key endorsements in early battleground states.", "\nYou might do what former Vice President ", " has done and actually highlight your desire to wait until after the midterms – a selfless sounding posture that also produces self-interested results.", "\nBut what you must never, ever do is be seen as putting your own campaign ahead of the interests of your fellows. For Warren, ", ", ", " and some others they will not follow the old rules and will accordingly pay a price with the party activists so crucial in early primary states.", "\nYou can count on it.  ", "“Felony is a term of loose signification, even in the common law of England; and of various import in the statute law of that kingdom.” – ", "  ", "“Assateague and Chincoteague’s most famous residents know how to stay safe in extreme weather conditions. After all, the wild ponies have comfortably roamed the islands along the mid-Atlantic coast for centuries. While legend says they arrived at the barrier islands of Virginia and Maryland after surviving a shipwreck, it’s more likely that their origin can be traced to horses owned by 17th-century settlers. However they arrived, these feral herds have thrived over the years, no matter the obstacle, and have become a permanent fixture of the region’s character. … But the Ash Wednesday Storm of 1962 was a different story. The Level 5 nor’easter was fierce and unrelenting in its three-day barrage. Poultry farms flooded, houses disappeared underwater, and coffins floated. For thousands of American children paying attention to the news, one question about the crisis rose above the rest: Was ", " all right? Misty of Chincoteague, a 16-year-old palomino mare, was the best-known member of the herd of wild ponies. … While Misty made it through the storm, not all the ponies came out so lucky. Of the 300 living on both islands, 55 died on Assateague and 90 on Chincoteague.”", " Email us at ", " with", "\nyour tips, comments or questions.", " 42.6 percent", " 52.6 percent", "-10 points", "up 1 point ", "[", "]", "42 percent", "49.8 percent", "Democrats plus 7.8 points", "Democratic advantage up 0.2 points ", "[", "]", " “ Sen. ", " apologized Tuesday for misidentifying victims of domestic violence, sexual abuse and rape who were listed in a recent North Dakota newspaper ad aimed at her opponent. The Democrat, who is facing a tough race for re-election, said in a statement that she had recently learned that several of the women named in the ad either hadn't authorized it or are not survivors of abuse. ‘I deeply regret this mistake and we are in the process of issuing a retraction, personally apologizing to each of the people impacted by this and taking the necessary steps to ensure this never happens again,’ Heitkamp's statement said. The ad that ran Sunday in several North Dakota newspapers was an open letter to Kevin Cramer, her Republican opponent, criticizing comments he made on Brett Kavanaugh's confirmation to the Supreme Court. It was signed by more than 125 people, though some just listed their initials.”", " ", " “Texas Republican Sen. ", "appears well-positioned for re-election over his Democratic challenger Rep. ", ", topping him 52% to 45% among likely voters, a new CNN poll conducted by SSRS finds. Just 9% of likely Texas voters say there's a chance they could change their mind about the Senate contest before Election Day, although O'Rourke's voters are more apt to be locked in to their choice (92% say their minds are made up) than are Cruz's backers (87% say they've made a final decision). The two candidates are set to debate Tuesday night, and O'Rourke will participate in a CNN town hall later this week. O'Rourke's challenge has drawn tens of millions in donations, forcing Republicans to play defense in one of the few Republican Senate seats in play this election cycle. President Donald Trump even plans to host a rally for his former rival's benefit.”", " ", " “Rep. Beto O'Rourke announced Monday that he will not share any of his $38.1 million war chest, even though Democratic bosses want the cash for more competitive states. The Texas Democrat told reporters after a campaign rally that he will not spare any expense in his own race and plans to leave all the money he has raised out on the field ahead of Election Day. He said if people who contributed to him want to do so for another campaign, they should do that. O'Rourke raised an eye-watering $38.1 million from July to September. ‘No,’ O'Rourke told a reporter when asked if he would commit to sharing funds with Senate Democratic candidates who are in closer races. ‘I'm focused on Texas. Most of our contributions have come from Texas. All of them have come from people. Not a dime from PACs.’”", " ", " “Yes, Beto is the coolest-looking man to come out of Texas since ", ". He has an Ivy League degree and cares about the underserved and the undocumented. He doesn’t wear cowboy boots to prove his Texas bona fides. To many urban Texans, that means that Beto is not so different from a lot of thoughtful, educated, big-city folks who live here. Non-Texans, in contrast, are still stunned to discover that even people who don’t live in Austin know about Tuscan blends and ", ". A win for Beto, then, is a win for the new Texas. A loss means that even though all of our major cities are blue, the old, [insert pejorative here] Texas still prevails.”", " “Republican ", " accused Democrat ", " of saying ‘it was OK to commit treason’ in a fiery Arizona Senate debate on Monday, in response to Sinema once telling a radio host she didn’t care if someone wanted to join the Taliban. McSally was referring to a 2003 interview on a local Arizona radio station, where Sinema told the host she didn’t object to individuals going abroad and fighting for the Islamic fundamentalist group. … On Monday night, McSally demanded an apology from Sinema for the comments and accused her of saying ‘it was OK for Americans to join the Taliban to fight against us.’ … But Sinema has been dogged by a number of controversial past comments being released to the media. Last week it emerged that in a 2011 speech she implied that her home state produced ‘crazy’ as she advised liberal activists on how to ‘stop your state becoming Arizona.’”", " ", " “Minnesota’s Eighth District is one of a handful of Democratic-held House seats where Republicans have a realistic shot to win in the midterms in three weeks. The incumbent, ", ", is retiring, and he won by only one percentage point in 2016 in a district President Trump carried by 15. When we polled this district in September, we found the Democratic candidate, ", ", up by one point. Now, we have the Republican, ", ", up by 15. The underlying numbers have changed a lot, too. Last time, voters disapproved of Mr. Trump by one point. Now they approve by 18. Last time, Democrats outnumbered Republicans by two percentage points; now Republicans outnumber Democrats by 10. Is the shift real? Probably not entirely. But there’s probably more truth to it than a lot of Democrats criticizing the poll want to admit. It’s a case that highlights the challenge of polling in general, and the particular challenges of polling in some states.”", " ", " “The congressional race between GOP Rep. ", " and Democratic Salt Lake County Mayor ", " could not be tighter: It is now tied, according to a new poll. Each has 46 percent support — with 8 percent undecided — in a survey by the University of Utah’s Hinckley Institute of Politics in partnership with The Salt Lake Tribune. In the last Tribune-Hinckley poll in June, Love led 45 percent to 39 percent, with 16 percent either undecided or favoring others (even though no other candidates are in the race). Love has attracted few of those previously undecided voters, said ", ", director of the Hinckley Institute. ‘But she has not lost a lot of her base support’ among Republicans, he said. Meanwhile, McAdams has built support mostly among Democrats and unaffiliated voters, who make up the second biggest voting bloc behind Republicans. Love is winning Republicans by a 74-15 percent margin, the poll shows. McAdams is carrying nearly all Democratic votes, with a 95-3 percent margin and is leading among unaffiliated voters by a wide 66-26 percent margin.”", " ", " “Republican ", " has overtaken Democrat ", " in the race for West Virginia’s 3rd Congressional District, according to the second Monmouth University Poll of this contest.  Ojeda’s personal appeal and the presence of a popular Democratic U.S. Senator at the top of the ticket have kept him in a race where all the underlying fundamentals – especially President Donald Trump’s popularity – favor Miller.  The question is whether that is enough to keep this race competitive as the district starts reverting to its GOP norms. Miller currently holds a 48% to 45% lead over Ojeda among likely voters using Monmouth’s standard midterm turnout model. … While there has been a significant increase in Miller’s vote share, her current lead is within the poll’s margin of error for all three likely voter models.”", " ", " “Three weeks before midterm elections, Democratic candidates across the country are shattering fundraising records, reports show. At least 60 Democratic House candidates raised more than $1 million in the three-month period that ended Sept. 30, according to the Democratic Congressional Campaign Committee. Only three Democratic House candidates reached that milestone in the third quarter of 2014, Federal Election Commission data show. ", ", a spokesman for the National Republican Congressional Committee, said ‘there’s no doubt the Democratic base is energized and raising large sums of money.’ … Federal candidates were due to file their latest FEC reports before midnight Monday, covering July, August and September. Early filings and reports from party officials pointed to record Democratic hauls powered by small donors. Some of the most striking reports: Texas Senate hopeful Beto O’Rourke, who raised $38 million, and California House candidate ", ", who brought in $4.4 million.”", " ", " “Prominent Nevada brothel owner and Assembly candidate ", "has died, his campaign manager tweeted on Tuesday, just days after his 72nd birthday. Nye County spokesman ", " said Nye County Commission Chair John Koenig announced the death at a commission meeting on Tuesday morning. The circumstances were under investigation, but Pahrump Valley Fire and Rescue was on scene in Crystal, where one of Hof’s brothels is located, Knightly said. Knightly said Hof had gone to sleep and did not wake up.”", " “President Trump has topped $100 million in fundraising for his 2020 reelection bid — an enormous haul for a president barely two years into his first term, according to new Federal Election Commission filings. Trump pulled in $18.1 million last quarter through his campaign committee and two joint fundraising committees with the Republican National Committee, for a total of at least $106 million since January 2017, according to federal filings made public Monday evening. Together, all three committees ended September with $46.7 million in cash on hand, filings show. No other president dating back to at least ", " had raised any money at this point for his own campaign committee, according to the Campaign Finance Institute, a nonpartisan research group. Unlike his predecessors, Trump began fundraising for his reelection shortly after his 2016 win. Trump continues to be buoyed by an avid small-donor base. FEC filings show 56 percent of the total raised by his committees from July through September came from donations of $200 or less.”", " “President Trump’s campaign more than doubled its spending over the past three months as the president worked to rev up the Republican base ahead of next month’s midterm elections through a series of rallies and online appeals. The increased spending — much of which was done through an opaque new corporate entity set up by the campaign — was reflected in filings that the campaign’s committees were set to submit on Monday evening to the Federal Election Commission. The filings showed that the campaign spent a total of $7.7 million from the beginning of July and to end of September — more than twice the $3.6 million spent in the preceding three months — according to a preview of the filings provided to The New York Times. The campaign and two joint committees it formed with the Republican National Committee raised a total of more than $18 million in the last quarter, a slight increase over the preceding quarter.”", " - ", "- ", " - ", "- ", "\n“An intentional surprise which we should expect and you always expect it. That’s why you build redundancy in your campaign.” –", "\n“Hey Chris! Is it possible for you to address the VA 5th district between R ", " and D ", ". I live in Campbell County, which is quite conservative but unfortunately, the 5th district also includes Charlottesville, which is hardly conservative. Any insight you can provide would be great! Thanks!” –", "\n[", "]", " Email us at ", " and please make sure to include your name and hometown.", " “A U.S. Customs and Border Protection beagle named ", "detected a roasted pig head in checked luggage at Hartsfield-Jackson International Airport. Hardy, a six-year-old rescue beagle, alerted his handler to a bag belonging to a traveler from Ecuador. Inside was the pig head, which weighed nearly 2 pounds. ", ", director for the Port of Atlanta for Customs and Border Protection, issued a statement saying the seizure demonstrates ‘the tremendous expertise of our four-legged K-9 partners in protecting the United States.’ The agency seized the pig head and destroyed it, saying pork and pork products from other continents are prohibited from entering the United States to prevent the introduction of diseases like classical swine fever, foot and mouth disease and swine vesicular disease. Travelers are supposed to declare fruit, vegetable and food products to Customs and present them for inspection.”", "“This campaign is sinking to somewhere between zany and totally insane. Is there a bottom?” – ", " "]}