[
{"title": "Fox News Poll: Biden, Sanders top Democratic preference", "body": ["So many Democrats are running for president the race feels like a March Madness bracket. If it were, the No. 1 seeds would be former Vice President Joe Biden and Vermont Sen. Bernie Sanders.", "Either would be favored to beat President Donald Trump in the 2020 finals, according to the latest Fox News Poll.", "Democratic primary voters were read a list of 20 announced and potential candidates for the 2020 nomination. Biden is the top choice at 31 percent, followed by Sanders at 23 percent.", "California Sen. Kamala Harris (8 percent) and former Texas Rep. Beto O’Rourke (8 percent) make up a second tier. They are followed by New Jersey Sen. Cory Booker (4 percent), Massachusetts Sen. Elizabeth Warren (4 percent), and New York Sen. Kirsten Gillibrand (2 percent).", "The other candidates are the political equivalent of a 16th seed -- they receive less than two percent.", "Eleven percent are unsure of their picks.", "Men, women, whites, non-whites, college graduates, and non-graduate Democratic primary voters all put Biden first and Sanders second. Sanders has the edge among those under age 45, while Biden is first for those 45 and over.", "Democratic primary voters are more likely to support a candidate they think can beat Trump (51 percent) than the candidate they like the most (36 percent).", "While Biden is technically undeclared, he slipped up and said he is entering the 2020 race. An official April announcement is expected.", "Two-thirds of Democratic primary voters want Biden to run, and he is the top choice among those who prioritize beating Trump, followed by Harris, Sanders, and O’Rourke.", "Among those who say it is more important to vote for the candidate they like than the one who could win, Sanders is the first choice, followed by Biden.", "“Democratic primary voters would welcome Biden into the field, should he run,” says Democratic pollster Chris Anderson, who conducts the Fox News Poll with Republican Daron Shaw. “They prioritize beating Trump, and as of now Biden fares best of the more widely known Democratic candidates against Trump.”", "The poll also asks Democratic primary voters about policies. Majorities are “very” likely to back a candidate who supports Medicare for all (67 percent) and a 70 percent tax rate on income over $10 million (53 percent). Less than 4 in 10 are very likely to vote for a candidate who supports passing the Green New Deal (37 percent), paying reparations to descendants of slaves (31 percent), and abolishing Immigration and Customs Enforcement or ICE (25 percent).", "The hypothetical head-to-heads among registered voters show support for Trump stays between 40-42 percent against each Democrat tested. He tops both Harris (39-41 percent) and Warren by 2 points (40-42 percent).", "Sanders has a 3-point edge over the president (44-41 percent), but Biden performs best, topping Trump by 7 points (47-40 percent).", "The head-to-head matchups between Trump and Sanders, Harris, and Warren are within the poll’s margin of sampling error. Biden’s lead is just outside it.", "“There is ambivalence at this early stage of the nomination process,” says Shaw. “Democrats want Trump out any way possible, but they also have a set of public policy preferences that would have been considered way outside of the mainstream even 10 years ago.  This has major implications for all candidates and especially for Biden.  Democrats like him, they want him to run, and are likely to be impressed Biden currently runs well against Trump, but do they think winning the White House depends on him?  If not, the rationale for his candidacy is unclear.”", "Finally, 41 percent of Democratic primary voters would rather Trump be voted out of office in 2020 than impeached. That matches the 41 percent who prefer he be impeached and removed before the election.", "Now that would be a real bracket-buster.", "The Fox News poll is based on landline and cellphone interviews with 1,002 randomly chosen registered voters nationwide, including 403 Democratic primary voters, and was conducted under the joint direction of Beacon Research (D) (formerly named Anderson Robbins Research) and Shaw & Company Research (R) from March 17-20, 2019. The poll has a margin of sampling error of plus or minus three percentage points for all registered voters and plus or minus five percentage points for Democratic primary voters."]},
{"title": "Buttigieg surges to third place in new NH poll", "body": ["A new public opinion survey in the state that holds the first primary in the race for the White House indicates that ", " is now in third place among the multitude of contenders for the Democratic presidential nomination.", "The 37-year old South Bend, Ind., mayor has the support of 10.7 ", " released Wednesday.", "Former Vice President Joe Biden – expected by many political observers to formally announce a White House bid in the coming weeks – topped the poll. Nearly 23 percent said if the primary were held today, they’d vote for Biden. Independent Sen. Bernie Sanders of Vermont – who’s running a second straight time for the Democratic nomination – was second at 15.6 percent.", "Sanders won the 2016 Democratic primary in the Granite State by 22 percentage points over eventual nominee Hillary Clinton.", "Buttigieg, an Afghanistan War veteran who would be the nation’s first openly gay president, was next in line.", "“The emerging dark horse in this race may be Pete Buttigieg, who has gone from a virtual unknown to vault to 11 percent support,” said Neil Levesque, the executive director of the New Hampshire Institute of Politics at Saint Anselm College. “His emergence as a factor is driven by a 33-point increase in name recognition, almost all of it favorable.”", "of neighboring Massachusetts was in fourth place, at 8.7 percent, followed by Sen. Kamala Harris of California at 6.8 percent and former Rep. Beto O’Rourke of Texas at 6.4 percent.", "Sen. Cory Booker of New Jersey grabbed the support of 4.4 percent of those questioned, followed by Sen. Amy Klobuchar at 2.2 percent. Everyone else registered at 1 percent or less.", "The poll was conducted April 3-8, during the height of media coverage of the controversy over allegations that Biden had inappropriately touched women.", "The survey indicated that the former vice president’s favorability among likely Democratic primary voters in New Hampshire dropped 10 percentage points, to a still strong 70 percent.", "Biden’s well-publicized, affectionate brand of physical politics was thrust into the spotlight nearly two weeks ago, thanks to allegations from 2014 Nevada Democratic lieutenant governor nominee Lucy Flores. She said in an essay published in New York magazine that Biden made her feel \"uneasy, gross and confused\" at a campaign rally when she said he kissed her on the back of the head. Her claims quickly went viral and became a top cable news story for a  week.", "Speaking with reporters last Friday, the former vice president stressed: “I’m sorry I didn’t understand more. I’m not sorry for any of my intentions. I’m not sorry for anything I’ve ever done. I’ve never been disrespectful intentionally to a man or a woman.”", "Biden acknowledged that \"it is incumbent on me and everybody else to make sure that if you embrace someone, if you touch someone, it’s with their consent, regardless of your intentions.\"", "The Saint Anselm College poll was conducted by live operators, with 698 registered voters in New Hampshire questioned. The margin of error was plus or minus 5.4 percentage points."]},
{"title": "Senate nears threshold to block Trump", "body": ["Former White House political director Matt Schlapp says the Senate has a chance at getting enough Republican senators on board to pass the House resolution.", "\n**Want FOX News Halftime Report in your inbox every day? Sign up ", ".**", " “North Carolina Sen. ", "plans to break with President Donald Trump over his national emergency declaration, which would allow him to go around Congress to secure funds for a southern border wall. Tillis, a Republican, wrote an ", " in The Washington Post explaining his decision to vote for a resolution of disapproval, rebuking Trump. The Democratic-led U.S House is expected to pass the resolution Tuesday evening, a move that would require the Senate to consider the resolution within three weeks. … ‘As a conservative, I cannot endorse a precedent that I know future left-wing presidents will exploit to advance radical policies that will erode economic and individual freedoms,’ Tills wrote. Tillis, who is up for re-election in 2020, is the third Republican to publicly pronounce his or her intention to vote for the resolution of disapproval. Sen. ", "of Maine and Sen. ", "of Alaska have also indicated they are likely to support the resolution.”", " ", " “Few Republican Senators have released definitive statements on the resolution, but many have made statements on the emergency. … At least six Republican senators, ", " (R-Tenn.), Susan Collins (R-Maine),", " (R-Utah), Lisa Murkowski (R-Alaska), ", "(R-Ky.) and Thom Tillis (R-N.C.), have expressed opposition to the national emergency since it was declared. All six support more border security but saw the move as executive overreach and potentially unconstitutional. … Republicans are also concerned the national emergency could spawn numerous court battles, which it already has, and a lengthy judicial review. …  At least eleven GOP senators, including [", "]", " and ", "(R-Fla.), early proponents of the national emergency, have expressed support for the declaration, which they described as a necessary use of executive power and which some saw as a fulfillment of Trump’s campaign promise to build a wall.”", " “Wisconsin Gov. ", " on Monday ordered the state’s National Guard troops to withdraw from the border with Mexico, drawing the ire of a Republican congressman from Illinois who serves as a pilot in the Wisconsin detachment. Former Republican Gov. ", "ordered troops to Arizona in June to assist with administrative duties along the border. Evers, a Democrat, issued an executive order Monday withdrawing them. Evers announced the order late Monday afternoon. … ", ", a Republican congressman from Illinois, tweeted on Monday that he is a member of the Wisconsin National Guard and criticized Evers for his decision. In a series of tweets, he said he was sent to the border as a member of the Wisconsin National Guard and his crew caught a man crossing the border with 70 pounds of methamphetamine. ‘Wonder the damage that would do in Milwaukee...’ he tweeted.”", "\n“The power of making treaties is an important one, especially as it relates to war, peace, and commerce; and it should not be delegated but in such a mode, and with such precautions, as will afford the highest security that it will be exercised by men the best qualified for the purpose, and in the manner most conducive to the public good.” – ", " “Scholars have long known that ", " was cruel to his wife, ", ". In their early letters, the novelist addressed her affectionally … but that tone changed dramatically some two decades into their marriage once he met and began an affair with then-18-year-old actress ", ". … Catherine's side of the breakup tale has remained mostly obscured from history until now. Her rarely heard perspective comes back with vengeance thanks to a trove of 98 previously unseen letters that show Charles … was actually gas lighting his wife as they separated. The missives were unearthed by University of York professor ", ", who specializes in 19th-century fiction. He first became aware of their existence when he noticed them listed in an auction catalogue from 2014. … The letters were written by Dickens family friend and neighbor", "to a fellow journalist, and they include details about the couple’s separation, which Catherine shared with Cook in 1879, the year she died.”", "Email us at ", " with your tips, comments or questions.", " 41.8 percent", "54.4 percent", "-12.6 points", " no change  ", "\n[", ".]", " “Republican ", "announced on Tuesday that he will not run in the new election for North Carolina’s 9th Congressional District, citing his compromised health. A new election was called last week after Harris’ campaign was the subject of fraud allegations that tainted the midterm election. The state board of elections declined to certify the race between Harris and Democrat ", " in 2018, instead voting last week to order a new election. ‘Given my health situation, the need to regain full strength, and the timing of this surgery the last week of March, I have decided not to file in the new election for Congressional District 9,’ Harris said in a statement. ‘It is my hope that in the upcoming primary, a solid conservative leader will emerge to articulate the critical issues that face our nation.’ Harris said he will support ", ", a Union County commissioner, in the Republican primary for the district.”", " ", " “What may be the most high-profile special election of 2019 is likely to attract national attention as a harbinger of things to come in a competitive state next year. … In a nationalized political environment, the outcome would contribute to the narrative about North Carolina heading into 2020, when GOP Sen. ", " is up for his first re-election. Inside Elections rates the Senate race Tilts Republican. The demographically shifting state is also a must-win for Trump, who carried it by less than 4 points in 2016. Republicans fear a divisive and messy 9th District primary in a high-profile special election could jeopardize the seat and complicate their efforts in other federal races next year. … Democrats have the advantage of time and money. McCready has been consistently fundraising — raising more than $500,000 by the end of 2018 — well before the new election was called for.”", " “[Political scientist ", "] reached out to the 60 activists twice recently… Each time, [he] heard back from roughly 35 of the activists. Of those, only nine said they had committed to a candidate… That level of indecision doesn’t seem all that unusual given the size of the field. Most modern presidential nomination contests have an obvious front-runner, but when they don’t (as was the case with the Democratic field in 1988), activists may take their time choosing a candidate. Several … suggested that they may wait until the summer or fall of 2019 [or wait until they] meet with the candidates before making up their minds. … Overall, in February, there were five candidates — [", "], [", "], ", ", ", " and ", " — who were being considered or had been committed to by more than 35 percent of these activists. It is notable to see Brown’s and Klobuchar’s names included in this group, since at the beginning of February, each had received little national media attention and neither had gained much traction in the polls.”", " “Demographically and economically, Iowa isn’t actually that representative… Enter two candidates … who both see the state as crucial… Amy Klobuchar and Kamala Harris need the same thing, but they need it for opposite reasons. … For Klobuchar, Iowa is her neighbor to the south… A win in the Iowa caucuses could validate her pitch that the 2020 election is calling out for someone who can link the years her grandfather spent working in a mine to the ‘grit’ to stand in a snowstorm for her own campaign announcement two weeks ago, and connect a purported hard-nosed pragmatism to years of big wins in her home state. … But the state is key for [Harris] too: She wants a top finish here next February that would solidify her as a front-runner and give her the momentum going into a four-week blitz around the country…”", " “A decision by former Vice President ", " on running for the White House could still be more than a month away, but that’s not stopping members of his team from taking the initial steps to build a campaign structure. ‘They’re collecting resumes but making no commitments,’ a source close to Biden’s inner circle told Fox News on Tuesday. ‘They’re thinking about where people fit’ into a possible presidential campaign. The source asked to remain anonymous to speak more freely. … ‘We know we’ll lose people,’ the source acknowledged, with regard to the time Biden is taking to reach a decision. But those concerns don’t appear to weigh too heavily on the former vice president when it comes to his timetable.”", " “Sen. ", " (I-Vt.) at times Monday sounded like he was already running against President Trump in a general election, rather than the crowded field of Democrats he must first do battle with in the 2020 primary. During a televised town hall on CNN, Sanders criticized Trump for abandoning working Americans, promised to campaign in ‘Trump Country,’ and even gave a nod to a county in Pennsylvania that voted for Trump after backing ", " twice. … Sanders also attempted to reach out to voters of color, speaking at length about racial disparities, including the wealth gap between black and white Americans. Sanders said he believes he can defeat Trump in Florida, Pennsylvania, Wisconsin, and Michigan, four swing states that were key to the president’s victory in 2016.”", " ", " “Sen. Bernie Sanders is preparing to release his tax returns, sources with knowledge of his plans told National Journal. The display of personal financial transparency goes well beyond what the Vermont independent did during his 2016 presidential bid, when he failed to produce a comprehensive look at prior returns. One source familiar with the campaign’s internal discussions suggested that 10 years of filings would be released. The Sanders campaign did not respond to detailed questions about his plan by press time. Sanders brought in roughly $1.75 million in book royalties across 2016 and 2017, on top of his $174,000 Senate salary. But he still ranks among the least wealthy senators, according to the most recent public data.”", " ", " “Presumptive Democratic presidential candidate", "compared the Green New Deal to NASA's race for the Moon in the 1960s, telling Fox News' ‘Special Report’ Monday night that ‘global climate change ... is the greatest threat to humanity we have.’ … Gillibrand and [", "] then had a lively exchange over Massachusetts Sen. Elizabeth Warren's vow to not hold any ‘big-money fundraisers’ during her campaign. Wallace asked Gillibrand if she saw any contradiction between Warren's promise and Gillibrand's plans to hold a March fundraiser at the home of Pfizer executive ", ". … ‘Of course, I’m going to ask Americans all across this country to support my campaign,’ Gillibrand said.”", " “Voters head to the polls Tuesday to pick a new mayor to take on the challenges weighing down the nation’s third-largest city: Billions of dollars in unmet pension obligations, endemic corruption and persistent gun violence. A record 14 candidates are on the ballot. Most of the candidates announced they were running after two-term Mayor ", "announced in September that he wouldn’t seek a third term. The field includes eight people of color and ten who have never held elected office. … Under Chicago’s election rules, if no candidate wins more than 50 percent of the vote, the top two vote-getters will face off in an April 2 runoff. No candidate is polling at more than 14 percent, according to a survey published Sunday by 270 Strategies.”", " - ", " - ", "- ", " - ", "\n“I can remember college, you take a test and people gather around to talk about the test. I was never part of that gathering because there was not a damn thing I could do about what I'd written, so I didn't do that. I took the test; that's all I could do. Don't look back.” –", "Email us at ", " and please make sure to include your name and hometown.", " “A Florida man stole more than $30,000 in rare coins and cashed them in for a fraction of their value at change machines at area grocery stores, investigators said. Palm Beach Sheriff’s Office investigators said ", ", 40, stole the rare presidential coins, valued at $1,000 each, and other items worth a total of $350,000, the Palm Beach Post reports. Investigators said Mele sold some of the coins to a pawn shop for $4,000, then exchanged the majority of them through CoinStar change machines at grocery stores, which would only give face value for them, a fraction of their worth. Mele was arrested and charged with grand theft and unrelated drug charges.”", "\n“Great leaders are willing to retire unloved and unpopular as the price for great exertion.” – "]},
{"title": "Roy Moore's sexual assault allegations cloud Alabama special Senate election", "body": ["\n          Doug Jones defeated Roy Moore in the Alabama special Senate election earlier this month, becoming the first Democrat to win a Senate seat in the state in more than 20 years.\n          ", "Before Roy Moore’s sexual assault allegations came to light, the Republican senate candidate was already a polarizing figure.", "Moore has argued that Muslims ", " in Congress; he ", " that former President Barack Obama wasn’t born in the U.S.; and he said in ", " that “homosexual conduct” should be illegal.", "Then, slightly a month before the special election, ", " a bombshell report of allegations that Moore had inappropriate sexual conduct with teenage girls while he was in his 30s. One woman alleged that Moore had her touch him in private areas when she was just 14.", "After the initial report, additional women came forward with allegations of sexual misconduct.", "Moore staunchly denied the accusations, but even still, many leading Republicans ", ". However, others – including President Trump and Steve Bannon – stood by Moore.", "The former judge ", " earlier this month to Democrat Doug Jones, but he thus far has refused to concede.", "After a judge rejected a ", " from Moore that alleged “voter fraud” had given Jones his victory, the Democrat was ", " as the winner of the state’s Senate race on Dec. 28.", "Read on for a look at the special Senate election held earlier in December to replace Jeff Sessions.", "A former U.S. attorney during the Clinton administration, Jones beat out seven other Democrats to secure the party’s nomination. And he eventually became the first Democrat elected to the U.S. Senate in Alabama since 1992.", "\n      Senate candidate Doug Jones chats with constituents before a forum in Decatur, Ala.\n      ", "Jones, 63, is perhaps best known for successfully prosecuting two members of the Ku Klux Klan accused of bombing a Birmingham church in 1963 that killed four young girls.", "“I may have the honor of serving Alabama as your senator, but the most important thing I have done is prosecuting those klansmen who killed 4 little girls at 16th St Baptist Church,” Jones said in a November tweet.", "Because of his resume, Steven Taylor, a political science professor at Alabama’s Troy University, said Jones is considered to be a “quality candidate” in the political science world. He's “someone who is credible and, therefore, competitive,” Taylor told Fox News.", "“We’ve not seen a lot of quality Democratic candidates for Senate because Sen. [Richard] Shelby and Sen. Sessions, they were so strongly ensconced in their positions that the Democratic nominee was most often a more fringe candidate and not taken very seriously,” Taylor said. “Jones doesn’t fall in that category – he has a background as a prosecutor, he has linkage to Civil Rights prosecution for the bombers in Birmingham. This makes him a more serious and significant candidate.”", "Openly critical of Trump, Jones promised to fight for pro-abortion policies, tackling student loan debt and raising the minimum wage.", "Even prior to the allegations of Moore groping a teenage girl, Democrats ", " about Jones’ chances of winning in a historically red state. And after the allegations, some polls – such as ", " conducted days before the election – had Jones in the lead.", "While Jones initially stayed away from the accusations against Moore, the Democratic candidate came out swinging during a speech the week before the election.", "“I damn sure believe that I have done my part to ensure that men who hurt little girls should go to jail and not the United States Senate,” Jones said.", "Jones was endorsed by prominent Democrats, including former Vice President Joe Biden and Rep. John Lewis, D-Ga. In addition, Sen. Cory Booker, D-N.J., campaigned for Jones, as did former Massachusetts Gov. Deval Patrick.", "Jones also received a surprising financial backing from a Senate Republican – Jeff Flake. The Arizona senator tweeted a photo of a check made out to Jones with the subject line saying, “Country over Party.”", "And Trump, although he endorsed Moore, tweeted his congratulations to Jones.", "“Congratulations to Doug Jones on a hard fought victory. The write-in votes played a very big factor, but a win is a win,” Trump said. “The people of Alabama are great, and the Republicans will have another shot at this seat in a very short period of time. It never ends!”", "Prior to the election, Alabama House Minority Leader Anthony Daniels, D, encouraged Jones to “stay the course” and not get bogged down with the allegations against Moore.", "“Getting involved in the allegations, that doesn’t bring jobs to Alabama. That doesn’t bring opportunity or economic prosperity to our state. That doesn’t help education or health care. It doesn’t help our infrastructure,” Daniels told Fox News. “Why would he focus on that?”", "Daniels also praised Jones for being “a fighter for his entire career.” He said Jones would bring “unity and civility” to the Senate and would work with lawmakers across the aisle to better Alabama.", "Called the “Ayatollah of Alabama” by critics who believe he too closely marries his political and judicial responsibilities with his religious beliefs, ", " emerged as the leader of the Republicans vying for the open Senate seat. In a special primary election earlier this year, Moore defeated incumbent Sen. Luther Strange who was tapped to fill the position when then-Sen. Jeff Sessions became the U.S. attorney general.", "\n      Judge Roy Moore speaks to supporters after beating Sen. Luther Strange in the Alabama Senate special election.\n      ", "In the primary, Moore, 70, garnered the support of conservative darlings, such as former Alaska Gov. Sarah Palin and “Duck Dynasty” star Phil Robertson. Trump initially backed Strange but would eventually throw his weight behind Moore. Trump’s former adviser, Steve Bannon, also campaigned for Moore.", "Moore’s political past is mired in controversy, which he used to his advantage during the primary election. He was twice removed from Alabama’s Supreme Court. The first time, he was dismissed when he refused to move a boulder-sized Ten Commandments monument from the statehouse; he was permanently suspended in 2016 after he instructed probate judges to deny marriage licenses to same-sex couples.", "The Supreme Court incidents worked in his favor given that Alabamians are generally very conservative and religious, Taylor said. And his refusal to bend to the federal government is in line with a “tradition” set in the state by the former longtime pro-segregationist Gov. George Wallace, he said.", "“He’s very outspoken in a variety of ways,” Taylor said of Moore. “He’s a little more reflective of those more populist candidates we’ve seen of late, including the president.”", "Prior to the election, Taylor thought it possible that voters in the deep red state of Alabama could look the other way.", "“In some ways, that Roy Moore has a very strong religious element to his politics is not substantially out of the mainstream for the state,” Taylor said.", "\"He's very outspoken in a variety of ways.\"", "After Moore’s primary victory, Trump called him a “really great guy who ran a fantastic race.” Many Trump supporters turned out to campaign for Moore during the primary, despite the president’s backing of a different candidate.", "Moore’s judicial past took a backseat, however, when the Washington Post reported that four women accused Moore of engaging in inappropriate sexual behavior with them while they were teenagers and he was in his 30s.", "Leigh Corfman, now 58, alleged that Moore first approached her in a courtroom in 1979 when she was 14 years old. Eventually, Moore took her to his house, took off her shirt and pants, touched her private parts and guided her hand to his underwear, she said. The two did not have sexual intercourse, and he took her home when she asked, Corfman said.", "After the Washington Post's initial report, several more women accused Moore of being sexually inappropriate.", "Moore vehemently denied the accusations, calling them “baseless” and “the very definition of fake news.”", "“It seems that in the political arena, to say that something is not true is simply not good enough. So let me be clear. I have never provided alcohol to minors, and I have never engaged in sexual misconduct,” Moore said in a statement provided to Fox News.", "He also told Fox News’ Sean Hannity that he “generally” didn’t date women who were teenagers when he was in his 30s and would not date someone without her mother’s permission. Moore admitted it’s possible that he did go on dates with one of the accusers in the Washington Post report who said she was 17 when Moore kissed her.", "That line of defense was not “as strident or strong as one might expect,” Taylor said.", "Despite numerous Republican leaders backing away from Moore, Trump tweeted on Dec. 12 – Election Day – that Moore “will always vote for us.”", "“The people of Alabama will do the right thing,” Trump tweeted while encouraging his followers to vote for Moore.", "But following Moore’s loss, the president noted that he originally endorsed Strange because he knew that Moore “will not be able to win the General Election.”", "“I was right! Roy worked hard but the deck was stacked against him,” Trump said.", "And on Dec. 23, Trump again said on Twitter that he “said [Moore] would lose in Alabama” and touted his initial support of Strange.", "A week before the election, the Republican National Committee ", ", just three weeks after it pulled its financial support for the beleaguered candidate.", "But despite his loss, Moore didn’t give up. He filed an election complaint on Dec. 27, that said alleged “voter fraud” was so prevalent, it “improperly altered the outcome of this election.” The complaint calls for a “thorough investigation” and is meant to block the certification of Jones until a probe is completed, Moore’s campaign said.", "A ", " to challenge the election.", "According to the election results from earlier in December, Moore lost to Jones by a margin of 21,000 votes.", "If Moore had won, Senate Majority Leader Mitch McConnell, R-Ky., ", " “immediately have an issue with the ", ".”"]},
{"title": "Republicans taking no-mercy approach to even longshot 2020 Democrats", "body": ["Former DNC deputy press secretary says it is too early to know who will emerge as the winner, but Julian Castro will add a great voice to the debate.", "Even lesser-known prospective Democratic 2020 presidential hopefuls are already facing a withering barrage of criticism from the Republican establishment, foreshadowing a historically fierce and competitive campaign season as higher-profile potential nominees like former ", " and ", " wait in the wings.", "Former Housing and Urban Development (HUD) Secretary ", " and Hawaii Rep. ", " -- widely considered longshot candidates with relatively little name recognition -- have also come under fire from the left in the days after they formally declared they would run, as Democrats hope to find a candidate who can realistically unseat President Trump.", "“Julián Castro has made history by becoming one of the biggest lightweights to ever run for president,\" Republican National Committee (RNC) spokesman Michael Ahrens said in a statement shortly after ", " surrounded by reporters in his hometown San Antonio, Texas on Saturday. \"He was a weak mayor who couldn’t even handle being HUD secretary. This is obviously just another desperate attempt to become someone else’s running mate.”", "Castro, 44, was the mayor of San Antonio for five years before serving in the Obama administration for less than three. But the RNC, as part of a comprehensive response to Castro's candidacy, has issued rapid-response documents pointing to contemporaneous reporting that has characterized Castro's government service as wholly unremarkable.", "San Antonio's mayorship was a part-time position paying only $3,000 a year and roughly equivalent to a city councilmember role when Castro held the job, and the city's executive leadership was almost entirely conducted by a separate official who acted as city manager -- an inconvenient fact for Castro that was noted not only by the GOP this week, but also by left-leaning Vox.com in 2016.", "Dylan Matthews, writing for Vox in 2016, ", " because he \"simply is not qualified to be one heartbeat away from the presidency.\"", "\n      Former San Antonio Mayor and Housing and Urban Development Secretary Julian Castro, front left, waves as he arrives with his family to an event where he announced his decision to seek the 2020 Democratic presidential nomination, Saturday, Jan. 12, 2019, in San Antonio. (AP Photo/Eric Gay)\n      ", "\"Picking Castro would look like Clinton selecting a Dan Quayle–like lightweight, who lacks the requisite policy knowledge and experience to assume the presidency should something happen to her,\" Matthews argued.", "Also in 2016, ", " in an unflattering profile that Castro didn't want to lead the Department of Homeland Security because he was worried about the political ramifications of a terrorist attack on his watch. Citing several sources, Politico reported that once at HUD, Castro would \"freeze up\" whenever \"detailed policy questions about housing and mortgage financing came up,\" and seemed \"not interested enough in HUD policy to want to engage deeply.\"", "In his speech Saturday, Castro, a Stanford University and Harvard Law School graduate, emphasized his goals of universal health care and fighting climate change more than his credentials. \"I’m running for President because it’s time for new leadership and to make sure opportunities I had are available to every American,\" he said.", "But, separate from the GOP-led attacks, Castro's limited name recognition posed a readily identifiable and immediate challenge to his bid.", "“People here in San Antonio know him obviously -- but, if you get out of Texas, and you ask an ordinary citizen on the street, and you say, Julian Castro, they’ll probably say, who?” Johnny Arredondo, a member of the Republican Club of Bexar County, told Fox News this weekend.", "Washington Free Beacon reporter Alex Griswold wrote on Twitter Monday that it \"only took about a day\" for everyone to move on from Julian Castro, amid reports that New York Democratic Sen. Kirsten Gillibrand might announce the formation of a presidential exploratory committee on Tuesday.", "The 37-year-old Gabbard, meanwhile, has also come under political attacks more typically endured by frontrunners mid-campaign cycle. Gabbard announced her presidential bid in an interview Friday.", "Republicans -- and many Democrats -- quickly focused on Gabbard's support for Syrian President Bashar al-Assad, whose government lawmakers have accused of war crimes and even genocide during that country's brutal civil war. Gabbard met with Assad secretly in 2017 without first informing top Democrats, and has dismissed Assad's opponents as \"terrorists.\"", "Democratic Rep. Tulsi Gabbard barely finished announcing she is running for president in 2020 when the spotlight quickly shifted to anti-gay comments and actions from her past.", "Gabbard has also made headlines for referring to President Trump as \"Saudi Arabia's b----,\" after the president argued for the importance of a strong U.S-Saudi relationship amid calls for him to take a tougher stance on the kingdom in response to the killing of writer Jamal Khashoggi.", "“", " has an even bigger problem than her lack of experience – it’s that she has no base of support,\" an RNC spokesman said. \"Liberals think she’s too conservative, conservatives think she’s too liberal, and just about everyone thinks her coziness with Bashar al-Assad is disturbing.”", "Gabbard, an Iraq War veteran, is known for being politically unpredictable, something she has publicly said she takes pride in. She famously resigned as Democratic National Committee (DNC) vice chair in 2006 to endorse Vermont Independent Sen. Bernie Sanders' presidential bid. (Sanders, another potential 2020 contender, ", "by accusations that he failed to clamp down on sexual misconduct allegations against some of his staffers during that campaign.)", "But some of Gabbard's most fiery remarks against same-sex marriage in years past, as well as her active campaign to promote “traditional marriage” legislation, have drawn intense scrutiny from the left.", "In years past, she several times referred to LGBTQ  activists as “homosexual extremists,” a view that echoes that of her father, Mike Gabbard, whom ", " described as having long been “Hawaii’s leading opponent of the gay-rights movement, an energetic and often brusque activist who stood ever ready to denounce what he called ‘the radical homosexual agenda.’”", "\"So, she’ll co-sponsor bills supporting LGBTQ rights, but still personally thinks we’re icky,\" ", ", the editor-at-large for the liberal media watchdog group Media Matters for America, on Twitter. \"In any case, it’s really weird to see self-described leftists line up to support her instead of more progressive candidates. That’s all.\"", "Gabbard, who has apologized for her previous comments, was a visible force against same-sex marriage, and in 2004 spearheaded a fight in the state against a same-sex union measure. “To try to act as if there is a difference between ‘civil unions’ and same-sex marriage is dishonest, cowardly and extremely disrespectful to the people of Hawaii,” she said at the time. “As Democrats, we should be representing the views of the people, not a small number of homosexual extremists.”", "\n      Former Vice President of the U.S. Joe Biden speaks during a political rally in Newark, New Jersey, U.S., October 12, 2017. REUTERS/Eduardo Munoz - RC1D37E63DA0\n      ", "Gabbard then also blasted Massachusetts’ passage of same-sex marriage legislation, making it the first in the nation to recognize gay marriage. Speaking on behalf of the Alliance for Traditional Marriage and Values, a group headed by her father, she said the Massachusetts marriage law would cause a ripple effect across the country.", "“It is highly likely that federal judges will soon be tearing apart our U.S. Constitution in order to force same-sex marriage down the throats of the people of Hawaii and America,” Gabbard said. “The only way to protect traditional marriage in Hawaii and throughout our country, the only way to stop activist federal judges from rewriting our constitution, is by the passage of the Federal Marriage Amendment.”", "Another lesser-known declared presidential candidate, ", ", has largely escaped the harshest criticism from both parties, in part because of his status as a dark horse among dark horses. On ABC's \"This Week\" on Sunday, Delaney -- who has called for universal health care and reversing Trump's tax cuts -- ", ", rather than immediately achieving progressive political goals.", "Former Maryland Rep. John Delaney discusses his vision for his 2020 campaign.", "The first 100 days of a presidency, Delaney said, are more about proving \"to the American people that we can actually start solving problems and getting things done,\" rather than passing sweeping new progressive legislation.", "But campaigning in Cedar Rapids, Iowa, on Saturday, Delaney drew a crowd of only about 50, ", ", and he faced explicit questioning about his electability.", "Should Delaney's profile rise, however, he can likely expect to face the no-holds-barred approach that GOP leaders have taken against virtually every other known White House contender -- including the more prominent ones, like Massachusetts Sen. Elizabeth Warren.", "\"If Elizabeth Warren, often referred to by me as Pocahontas, did this commercial from Bighorn or Wounded Knee instead of her kitchen, with her husband dressed in full Indian garb, it would have been a smash!\" Trump wrote on Twitter Sunday evening, referring to his frequent criticism of Warren for previously claiming Native American ancestry during her academic career based on scant evidence.", "Warren, seeking to blunt that line of attack, took a DNA test late last year that showed she may have had a distant Native American ancestor -- ", ", including the Cherokee Nation, who charged that it was inappropriate and even racist to use a DNA test to assert tribal heritage.", "Trump then took a shot at Warren's decision to livestream herself drinking a beer in her kitchen on New Year's Eve, in a move reminiscent of similar Instagram broadcasts by younger Democratic firebrands like New York Democratic Rep. Alexandria Ocasio-Cortez and former Texas Senate candidate Beto O'Rourke. At one point in the livestream, Warren turned to her husband and thanked him for his presence.", "\"Best line in the Elizabeth Warren beer catastrophe is, to her husband, “Thank you for being here. I’m glad you’re here.,'\" Trump wrote. \"It’s their house, he’s supposed to be there!\""]},
{"title": "Republican Ron DeSantis defeats Andrew Gillum in Florida gubernatorial race", "body": ["Democratic candidate Andrew Gillum pledges to fight for what he believes in following his defeat by Republican Ron DeSantis in Florida.", "Republican Ron DeSantis will defeat Democrat Andrew Gillum in the battle to be Florida’s next governor, Fox News projects.", "DeSantis, 40, an Iraq War veteran, decorated military lawyer and former Florida congressman, defeated the Tallahassee mayor by a razor thin margin Tuesday night, with the two candidates neck and neck in the heated contest for the majority of the evening.", "Gillum fell short in his bid to become Florida's first African-American governor. He conceded to DeSantis, who has been an outspoken supporter of President Trump, saying he still \"believes in the long run, good always wins over evil.\"", "\"I still believe that,\" Gillum said in his concession speech.", "\"We could not be prouder of the way that we ran this race. We couldn't be prouder. We could not be more thankful for the support that was shown by each and every one of you. All the way along this path,\" Gillum said. \"We let our voices be heard. We didn't shrink from the challenges. We didn't shrink from power. We spoke truth to power. And just because we didn't always come out victorious we didn't retreat. We stood up we stood strong we spoke out because we recognize that we had power.\"", "Gillum said he called Desantis and congratulated him, but told supporters that \"in spite of our congratulating him on his victory this evening nothing that we believe in is compromised.\"", "DeSantis’ victory keeps the crucial swing state of Florida in Republican hands for the 2020 presidential election.", "His victory comes after a heated campaign to succeed Republican Gov. Rick Scott, who is term-limited. Scott is running against incumbent Democratic Sen. Bill Nelson in one of the nation’s most closely watched Senate races. Fox News' Decision Desk still has projected that race as too close to call.", "DeSantis, who attended Yale University and Harvard Law School, resigned his seat in the U.S. House of Representatives in September to focus solely on his gubernatorial bid. He enjoyed support from President Trump throughout his campaign. The president endorsed DeSantis in June.", "DeSantis argued throughout the campaign that Florida’s relationship with the president – whether he or she agrees with his policies or not— is important for the state.", "“You need to be able to work with the president,” DeSantis said last month, saying he would be “better positioned to advance Florida’s priorities” due to his “productive relationship with the administration.”", "The DeSantis-Gillum campaign was among the most closely watched in the country this midterm election season. Though Gillum had a  slight edge in the polls leading up to Election Day, and support from high-profile Democrats like former President Barack Obama, Florida has not elected a Democratic governor since 1994.", "Racial divisions were highlighted throughout the campaign. The day after Gillum won the Democratic primary, DeSantis said Florida voters shouldn’t “monkey this up” by electing Gillum. The former GOP congressman spent weeks explaining the remark, maintaining it had nothing to do with race, but rather his belief that Gillum would hurt Florida’s economy.", "In turn, Gillum was assailed over alleged ties to a radical far-left group associated with anti-Semitism and Palestinian terrorism. Additionally, his campaign cut ties with a volunteer during the final weeks of the race, after the volunteer was caught on video calling Florida a “cracker” state and saying the campaign was taking advantage of “white guilt.”", "Gillum’s campaign also battled headaches over an FBI probe into possible corruption in Tallahassee during his administration. Gillum has long denied wrongdoing, and said the FBI even told him he was not a focus of the investigation. But Republicans, including Trump, made an effort to tie Gillum and his record to the federal investigation.", "“In Florida there is a choice between a Harvard/Yale educated man named @RonDeSantisFL who has been a great Congressman and will be a great Governor - and a Dem who is a thief and who is Mayor of poorly run Tallahassee said to be one of the most corrupt cities in the Country!” Trump tweeted last week.", "Gillum responded that Trump was “howling because he’s weak,” and tweeted that Trump was lying about him. “But as my grandmother told me -- never wrestle with a pig. You both get dirty, but the pig likes it. So ignore him and vote, Florida!”", "The dispute further elevated Gillum’s national profile, while also drawing attention back to the FBI investigation. According to local reports, the FBI has been investigating potential corruption related to land deals. Last year, the FBI issued subpoenas for documents from the city related to developers.", "Separate from the FBI investigation, Gillum was criticized for a 2016 interaction with an undercover FBI agent. The agent was posing as a businessman interested in investing in Tallahassee, according to local reports.", "Gillum’s past actions were scrutinized by the Florida Commission on Ethics. That ethics probe recently revealed that he’d accepted tickets to the Broadway musical “Hamilton” from the undercover FBI agent in 2016.", "Gillum claimed he thought the ticket came from his younger brother, and acknowledged that he “should have asked more questions.”"]},
{"title": "Dem candidate Klobuchar attempts to ease staff controversy, promises to 'do better'", "body": ["Democratic presidential candidate Sen. ", " spent the weekend attempting to diffuse the controversy surrounding multiple reports that she has mistreated her staff on Capitol Hill.", "The Minnesota lawmaker, who announced her candidacy on Feb. 10, said in a statement to the Star Tribune newspaper that she promises to “do better” following reports in multiple news sources that, in the past, she insulted her staff, made them run personal errands and has even thrown objects in anger.", "“I’m incredibly proud of the work our staff has done and I would not be here without amazing staff,” ", ". “I know I can be tough, I know I can push people too hard, and I also know I can do better — and I will.”", "Klobuchar, who had the highest staff turnover rate of any senator between 2001 and 2016, has previously admitted to being a tough boss, but said it’s because she has high expectations of herself as well.", "\"Am I a tough boss, sometimes? Yes. Have I pushed people too hard? Yes,” ", ". “But I have kept expectations for myself very high. Undertaking a presidential campaign, that’s a pretty good way to judge people in how they manage something.”", "Some former staffers described Klobuchar as “habitually demeaning and prone to bursts of cruelty,” although others said that working for Klobuchar was challenging, but rewarding.", "“The best way I can describe it is sort of like Navy SEALs training. It’s not intended to be fun. It’s hard. But what you get from it is you become very, very good at what you do,” said Zach Rodvold, who worked on Klobuchar’s staff during her first Senate run in 2006.", "On Saturday night, Klobuchar once again addressed the controversy – albeit in a more comical way – when speaking to a crowd gathered at the annual Gridiron Club dinner.", ": “When Jerry [Seib, executive Washington editor of the Wall Street Journal and Gridiron Club president] called about tonight he asked, 'Do you need a microphone or do you just prefer to yell at everyone?' I said, 'microphone.'\"", "The Minnesota Democrat is one of a slew of Democratic candidates – and one of six senators -- to announce a bid for president or the formation of an exploratory committee. Klobuchar’s announcement in February came a day after Sen. Elizabeth Warren, D-Mass., officially launched her presidential campaign.", "Klobuchar, 58, is hoping to belay her success in her home state – she easily won a third term last year and has enjoyed broad support from voters in urban, suburban and rural areas, including in dozens of counties Trump won in 2016 – and her reputation as a straight-shooting pragmatist who gets legislation passed onto the national stage.", "Klobuchar's focus in recent months has included prescription drug prices, a new farm bill and election security. She supported the \"Green New Deal,\" a Democratic plan proposed this past week to combat climate change and create thousands of jobs in renewable energy.", "However, her legislative record has drawn criticism from both the GOP and some fellow Democrats. Some Republicans said Klobuchar has been able to get things done by pushing smaller issues. Some progressives said she'd lacked the kind of fire and bold ideas needed to bring significant change and excite voters.", "While Klobuchar has positioned herself as the only Democratic candidate able to win back other Midwestern states such as Michigan and Wisconsin, which were reliably Democratic in presidential races for decades until Trump's victory over Hillary Clinton, that could change as more candidates enter the fold.", "Sen. Sherrod Brown of Ohio has been visiting early-voting states and is rumored to be considering a run and Pete Buttigieg, the mayor of South Bend, Indiana, established an exploratory committee last month. There is also widespread speculation that former Vice President Joe Biden could enter the field."]},
{"title": "Brown, Klobuchar and Kasich weigh in on possibility of challenging Trump in 2020", "body": ["\n          Ohio Gov. John Kasich, Minnesota Sen. Amy Klobuchar and Ohio Sen. Sherrod Brown.\n          ", "Two big name Democratic senators -- and a Republican household name -- weighed in on Sunday about the possibility of challenging President Trump in the 2020 general election.", "While neither Sens. Sherrod Brown, D-Ohio, nor Amy Klobuchar, D-Minn., said they would be running for the White House in 2020, both Democratic lawmakers also didn’t rule out the possibility when asked Sunday during appearances on ABC’s “This Week.”", "“I haven't done any of those things to prepare,” said Brown, who recently won re-election for his seat representing Ohio in the Senate. “But we're seriously thinking about it with family and friends and allies.”", "Klobuchar, who made national headlines for her tough questioning of Supreme Court Justice Brett Kavanaugh during his controversial confirmation hearing, was even less open about the speculation that she would challenge Trump in two years.", "“People are talking to me about this I think, in part, because I have worked really hard to go not just where it's comfortable but where it's uncomfortable,\" she said.", "Klobuchar was just re-elected by a large margin to her third term representing Minnesota in the Senate and that – paired with her national prominence -- has many people speculating that she could become a presidential favorite among Democrats.", "“She’s viable, she is a centrist, and I’m sure that folks that matter look at that possibility and can certainly envision that in a general election against Trump she would look fantastic,” Lou Frillman, a Minneapolis businessman and prominent Democratic donor, ", ".", "It’s not just big-dollar donors who are pushing for Klobuchar to run for president, but also former Democratic Party heavyweights.", "“She got that engine that Humphrey had,” former Vice President Walter Mondale told the Minnesota newspaper, in reference to another Minnesota politician who ran nationally, Hubert Humphrey, who also served as vice president. “They never get tired — they just go and go and go.”", "For her part, however, Klobuchar said she was not ready to make any decisions about a 2020 presidential run just yet.", "“I have no announcement for you on your show,” she said on Sunday.", "While no candidates have officially said they are running for the presidency yet, speculation is that the Democratic field looking to take on Trump in the general election will be deep. Former Vice President Joe Biden is seen as the presumptive frontrunner, but everyone from 2016’s surprise challenger, Vermont Sen. Bernie Sanders, to current Democratic cause célèbre, Texas Rep. Beto O’Rourke, are being discussed.", "On the Republican-side, the incumbent Trump might face a rare challenge from someone in his own party.", "Outgoing Ohio Gov. John Kasich said on “This Week” on Sunday that he was not ruling out the possibility of taking on Trump.", "\"We need different leadership, there isn't a question about it,” Kasich said. “I'm worried about our country in the long term.”", "Kasich, a moderate Republican who made a run for the presidency in 2016, added that he did not know when he would make a decision whether or not to run.", "“I'm not being coy,” he said. “I'm not doing this for a game, this is really serious for me.”", "And on the possibility of a joint, bipartisan ticket with a Democrat – particularly one like Brown – Kasich said it probably wouldn’t work out.", "“You can't both be from same state, so that's out of the question,” he said."]},
{"title": "‘Draft Beto’ grassroots effort urges Texas Democrat to jump into presidential race", "body": ["'Draft Beto' is holding events in Iowa and New Hampshire to lay the groundwork for O'Rourke if he decides to jump in the race.", "At a noisy brewery on a Friday night in Manchester, N.H., a group of millennials huddled around a table as they sipped beer.", "They’re there for one reason: to get former three-term Rep. ", " to run for president.", "“We’re trying to build neighborhood-based organizations that Beto can tap into if he ", ",” Will Herberich tells the group. He is one of the leaders of Draft Beto 2020, one of the two grassroots organizations launched following his ", " last year.", "\n      Draft Beto supporter Ben Martel talks with fellow O'Rourke enthusiasts at the organizing event in Manchester, N.H. (Rob DiRienzo/Fox News)\n      ", "Despite his defeat, O’Rourke’s campaign was able to raise a ", ". His supporters hope that success continues its momentum into the Democratic primary season and ultimately, against President Donald Trump.", "O’Rourke ", " and will be making a serious decision before the end of this month. In the meantime, the Draft Beto organization will continue to lay the groundwork for the Texas politician to join an already-crowded field of Democratic contenders.", "Among the roughly dozen attendees at the Draft Beto event was enthusiastic O’Rourke supporter Ben Martel, who traveled over 100 miles from Providence, R.I. to take part in the meeting.", "“He's really so radically accessible and egalitarian,” Martel said. “He preaches a message of hope and bringing people together. I think people on the left and the right are so polarized and sick of this polarization.”", "Some in attendance said they are gunning for positions on O’Rourke’s potential campaign, like Martel, while others are there wholly because they think he is the Democratic Party’s best chance at defeating President Trump in 2020.", "“I'm just trying to figure out how I can get involved. It's such an exciting moment,” Martel said.", "Martel was sporting a “Beto 2020” t-shirt while the section of the bar the group was in was adorned with Beto posters and cans of “Beto Beer” — or Bud Light with printouts of O’Rourke’s face taped to them.", "\n      Draft Beto organizers created 'Beto Beer' to create a buzz about O'Rourke's presidential possibilities. (Rob DiRienzo/Fox News)\n      ", "The former congressman has done little to formally prepare for a presidential run compared to his opponents, ", " and having conversations with strangers, without the media coverage or traditional early campaign fanfare typical at this point in the race.", "If O’Rourke were to declare himself a presidential contender, he would have some quick catching up to do on the fundraising front, behind fellow party heavyweights like Sens. Cory Booker, Elizabeth Warren and Kirsten Gillibrand, who have been plotting their runs for months. ", "That’s where Will Herberich is hoping his Draft Beto organization will come in.", "The group has become like a second full-time job for him, along with his two co-chairs Lauren Pardi and Adam Webster, who conceived of the idea in a Massachusetts diner.", "They only have raised a few thousand dollars, ", ", which mostly went to bumper stickers and plane tickets to Iowa.", "“We’ve been building a grassroots effort all over the country from all 50 states, so far we’ve had thousands of volunteers sign up,” Herberich told Fox News. “30,000 on our email list.”", "He said he’s planning to hand all of that over to the official Beto campaign, if there is one.", "Looking at past primary cycles, said Southern New Hampshire University Civic Scholar Dean Spiliotes, these grassroots campaigns touring the state in lieu of the actual candidate are not uncommon.", "“It’s typically for a candidate for whom there is a good bit of social media buzz,” Spiliotes said. ”Maybe somebody who has high visibility nationally, but has been kind of on the fence in terms of announcing whether or not they're actually to get in. It's kind of a way to let them know that the water is warm if they want to jump in.”", "Democratic strategist Roger Fisk said Beto’s midterm momentum could serve him well.", "“He really captured people's imagination. I think his optimism makes him very attractive,” Fisk said. “So you have this kind of renegade storming up the hill in Texas, making the Republicans sweat in Texas.”", "Organizer Jay Surdukowski, who hosted a house party for Draft Beto last week, hopes the Democrat’s near miss in such a deep red state speaks to his appeal to middle America.", "“He is not a New York or Massachusetts politician,” Surdukowski said. “He is from Middle America, in a red, red, red, state.”"]},
{"title": "Julian Castro, former Obama official, forms 2020 presidential exploratory committee", "body": ["\n          Democrat Julian Castro announced he's formed an exploratory committee for a potential 2020 presidential campaign. \n          ", "Julian Castro, former President Barack Obama’s housing chief, has launched a ", " exploratory committee.", "“Americans are ready to climb out of this darkness. We’re ready to keep our promises. And we’re not going to wait. We’re going to work,” Castro, 44, said in a video. “That’s why I’m exploring a candidacy for president of the United States in 2020.”", "An exploratory committee usually is a formality before a candidate launches a presidential campaign. It legally allows potential candidates to begin raising money.", "The former San Antonio mayor said his official decision will be announced on Jan. 12. In the meantime, he encouraged voters to ", " to receive email updates.", "The early jump gives Castro an advantage as bigger name Democrats have continued to be floated as potential 2020 candidates, including Sens. Elizabeth Warren of Massachusetts, Bernie Sanders of Vermont and Cory Booker of New Jersey. Former Vice President Joe Biden and outgoing Rep. Beto O’Rourke, who excited donors in ", " against Texas Sen. Ted Cruz this year, have also been rumored to be considering presidential bids.", "\"I'm also very mindful, especially now for the Latino community, that there's a particular meaning to my candidacy.\"", "Castro would be among the youngest candidates in the field and the most prominent Latino. He told The Associated Press he plans to consult leaders in his party but hasn’t spoken to Obama yet.", "For Castro, running for president would fulfill a destiny that Democrats have projected since he was elected San Antonio mayor at 34, followed by his star-making turn as the keynote speaker at the Democratic National Convention in 2012.", "He is the grandson of a Mexican immigrant and son of a Latina activist. His twin brother, Joaquin Castro, is a Democratic congressman from Texas. The brothers were raised by a single mother who taught them to “make your future happen,” the former mayor said in his video.", "Castro told The Associated Press the Latino community has been treated “like a piñata” under President Trump.", "\"I'm also very mindful, especially now for the Latino community, that there's a particular meaning to my candidacy,\" Castro said. \"We can't go through the 2020 cycle with nobody on that stage because of what's happened over the last couple of years.\"", "Republican National Committee spokesman Michael Ahrens said there is no \"bigger lightweight in the 2020 field than Julian Castro\" in a statement provided to Fox News.", "\"His mayoral job was largely ceremonial, he was in totally over his head at HUD, and no, he doesn't even know Spanish,\" Ahrens said.", "So far, the only declared 2020 Democratic candidate is ", ". Sanders, who ran in 2016, ", " “probably run” if he believes he's the best choice to defeat Trump."]},
{"title": "Mayor Pete surging in Iowa", "body": ["Dave Brown and Alex Vogel weigh in on the field of 2020 Democratic presidential hopefuls.", "\n**Want FOX News Halftime Report in your inbox every day? Sign up ", ".**", " “Democratic voters in the Hawkeye State like ", " – a lot. The former vice president leads the pack and holds the best favorability rating in a field of two dozen presidential contenders, according to the first Monmouth University Poll of Iowa Democratic voters in the 2020 cycle. … In a field of 24 announced and potential candidates, Biden holds the lead with 27% support among Democratic voters who are likely to attend the Iowa caucuses in February. He is followed by Vermont Sen.", "(16%), South Bend Mayor", " (9%), Massachusetts Sen. ", " (7%), California Sen. ", "(7%), former Texas Rep. ", " (6%), Minnesota Sen. ", "(4%), New Jersey Sen. ", " (3%), and former cabinet secretary ", "(2%).  Former Maryland Rep. ", ", New York Sen. ", ", Ohio Rep.", ", California Rep. ", ", and entrepreneur ", " each receive 1% support from likely caucusgoers. The remaining 10 candidates earn less than 1% or were not chosen by any respondents in the poll.”", " “When Pete Buttigieg gathers supporters this weekend in Indiana, the ascending 2020 contender will count among them a name very familiar to Massachusetts voters. ", ", the former Democratic National Committee chairman and state treasurer, is endorsing the 37-year-old South Bend mayor for president, giving Buttigieg a well-connected ally in the donor-rich state. Grossman said he will attend what’s widely expected to be Buttigieg’s formal campaign launch Sunday. The two-time gubernatorial candidate was a supporter and organizer for ", " during her 2016 campaign, and has offered to begin raising money for Buttigieg’s campaign in Massachusetts, where fellow Democrat Elizabeth Warren is building her own 2020 operation.”", " “…[W]hen he announced he was running in 2019, after his challenge to Hillary Clinton had dragged deep into the primary calendar, the tenor was different: ‘He is among the best-known Democrats in a crowded field,’ the [New York] Times wrote earlier this year. But even though he now faces much more competition than he did in 2016’s two-person race, Sanders is already outperforming his benchmarks from the last presidential election cycle. Now he is one of the frontrunners, not the insurgent. You can see that dynamic affecting several of the early indicators… The media, voters, donors and other politicians are all paying a bit more early attention to Sanders than they did last time around.”", " ", " “Democratic presidential candidate Andrew Yang appeared on ‘Fox and Friends’ Friday morning to defend his campaign’s key proposal of giving $12,000 to each American adult every year and criticized Democrats for their newfound support for the abolition of the Electoral College. Yang, former ambassador of global entrepreneurship in the Obama administration and a long-shot candidate for the party’s nomination, was grilled by the show hosts and the audience about his universal basic income program, dubbed ‘Freedom Dividend,’ and his other views. … He added that due to an increasing automation, ‘most of us’ won’t work at Amazon or other companies, leaving the rest of the people at a disadvantage because their source of income will disappear.”", " “Former Virginia governor ", ", long wrestling with whether to run for the White House, has finally hit upon a perfect meme — one that evokes the literal swamp creature he once battled for campaign cash. ‘Of all the candidates running, how many have actually wrestled a 280 pound, 8-foot alligator for a political contribution?’ the Democrat told a crowd of union leaders Wednesday. ‘I’m your man, folks. . . If I can wrestle an alligator, I can certainly wrestle ", "!’ He followed up Thursday on Twitter with side-by-side photos. On the left: a svelte, 23-year-old McAuliffe perched atop the imposing reptile he fought on behalf of President ", "’s 1980 reelection bid. On the right: President Trump, looking especially rotund in golf attire. … For the record, McAuliffe bested the gator, wrangling a $15,000 donation to Carter from Florida’s Seminole Indian tribe. But that was not enough to help Carter, who lost the race.”", "\n“What is the spirit that has in general characterized the proceedings of Congress?” – ", " “Beloved children's author ", "is hitting a milestone on Friday. She's turning 103. April 12 is also National D.E.A.R. (Drop Everything and Read) Day in honor of Cleary. The National Medal of Arts winner and Library of Congress Living Legend is best known for books about her character ", "and sister ", ". … Though her most famous character, Ramona, is one of the most well-known little sisters in the history of children's literature, Cleary herself didn't have any siblings. … Cleary started her career as a librarian, where she realized that boys needed more books with characters they identified with, she said. She published ", " in 1950 to remedy that. … Like many centenarians, Cleary gets asked about the secret to longevity. Her response? ‘I didn't do it on purpose.’ She also says she doesn't look a day over 80.”", " Email us at ", " with your tips, comments or questions.", " 43.2 percent", "51.6 percent", " -8.4 points", " up 1.8 points ", "\n[", ".]", " “President ", "'s job approval rating increased relatively sharply over the past month to 45% in an April 1-9 Gallup poll, up from 39% in March. This marks the third time the 45th president has reached a 45% job approval rating in Gallup trends -- his highest in the series. This is Gallup's first measurement of presidential approval since special counsel ", " completed his investigation into Russian attempts to sway the outcome of the 2016 presidential election. Attorney General ", "'s synopsis of Mueller's findings reported no Russian involvement in the Trump campaign and insufficient evidence of obstruction of justice -- which Trump claims fully vindicates him. Congress has raised questions about the attorney general's synopsis of Mueller's findings and is demanding to see the report. While this plays out, Americans are slightly more approving of Trump than they were before the report's delivery -- though a small majority (51%) still disapprove of the president.”", " “President Donald Trump scoffed Thursday night at the idea of striking a bipartisan two-year deal to ward off billions of dollars in spending cuts. ‘House Democrats want to negotiate a $2 TRILLION spending increase but can’t even pass their own plan. We can’t afford it anyway, and it’s not happening!’ Trump tweeted. The president’s jeers come on the heels of House Democrats’ failure this week to muster the support to pass a bill that would stave off $126 billion in spending cuts in the fiscal year that begins Oct. 1, as well as cuts in the fiscal year that follows. While the proposal would increase discretionary spending to about $1.3 trillion for the upcoming fiscal year, the Trump administration contends that it would lead to nearly $2 trillion in spending increases over 10 years.”", " ", " “Just last week, Senate Majority Leader ", " (R-Ky.) triggered the ‘nuclear option’ and weakened the Senate’s vaunted filibuster to steamroll over Democratic resistance to President Donald Trump’s nominees… To top it all off, the Senate has now failed to muster enough votes to pass a simple disaster-aid bill, something that was once routine and is a failure that will affect millions of Americans. McConnell and his Democratic counterpart, Minority Leader ", "of New York, exchanged verbal blows on Thursday as they gave dueling accounts over who was to blame for the Senate morass. … As Republicans changed the Senate rules last week, McConnell and Schumer engaged in a fierce tit-for-tat on the floor culminating with McConnell literally pointing at Schumer as the one to blame. It was an ugly moment for the Senate. Yet these types of bitter personal exchanges have become routine, and a growing number of senators just try to tune it all out.”", " “Democratic Sen. ", "endorsed GOP Sen. ", "for reelection on Thursday, in a rare rebuff of partisan politics in an increasingly polarized Senate. The moderate West Virginia senator also offered to campaign for the vulnerable Maine incumbent. It’s a boon for Collins, who Democrats likely need to beat if they hope to take the Senate majority in 2020. ‘I would go up and campaign for Susan Collins. If she wanted me to, I would campaign for Susan Collins. For America to lose somebody like Susan Collins would be an absolute shame. I feel that strongly about her,’ Manchin said on Thursday. He admitted his comments will not please Democrats eager to defeat Collins.”", " ", " “", ", who served as national security adviser under President ", ", won’t be challenging Republican Sen. Susan Collins of Maine in 2020. Rice told former Obama administration official", " at the 10th annual Women in the World Summit on Thursday in New York that she loves Maine and that her family has deep roots in the state. But she said she decided with her family ‘that the timing really isn’t right for us.’ Rice tantalized Democrats in October when she expressed interest in Collins’ seat during the contentious confirmation hearing for Supreme Court Justice ", ". She said Collins supporting Kavanaugh ‘felt like betrayal.’ Rice said during the event on Thursday that her daughter is going into her junior year of high school and moving to Maine to run a campaign isn’t the best move for her family. Rice and her family currently reside in Washington D.C.”", " - ", " - ", "- ", "\n“The only unpardonable sin in New York society is poverty.” – ", "\nThis weekend Mr. Sunday will sit down with Rep. ", ", R-N.Y. Watch “Fox News Sunday with ", ".” Check local listings for broadcast times in your area.", "Host ", "has the latest take on the week’s media coverage. Watch #mediabuzz Sundays at 11 a.m. ET.", "\n“While everyone is preaching Amtrak Joe (or Uncle Bernie) as the front-runner, allow me to remind everyone of what happens to front-runners with a single word: JEB!” – ", "\n[", ".]  ", "\n“Someone must eventually ask Buttigieg, if after being reared in a Marxist household, he will disavow Marxism now. Unless he unequivocally answers, ‘Yes,’ which he won’t, he is toast.” – ", "\n[", ".]   ", "\n“Chris, It being Lent, a couple of thoughts about the Mayor Pete vs Vice President Pence story. Those of us who believe in ", "Christ and the truth of the Bible have no reason to dislike Mayor Pete. We dislike sin, not the sinner. We are all sinners. We do not celebrate sin. According to the Bible, marriage is between one man and one woman. What Mayor Pete does is his free choice. It is our belief, based on the teaching of the Bible to consider it sin without judging the sinner. Judgement is the Lord’s. The Pence family from what I can discern, agrees. Keep up the good work.” – ", "\n[", ".]   ", "Email us at ", " and please make sure to include your name and hometown.", " “For the second time in several weeks, thieves have stolen the wheels off of Jackson [Miss.] Police Department cars. Sgt. ", "says three police cars were towed Saturday after police found that their wheels had been stolen. The cars were parked behind a police museum in downtown Jackson and police aren’t sure when the wheels were taken. This is the second time wheels have been stolen from patrol cars in recent weeks. A car was left on blocks outside the west Jackson police training academy in March after thieves stole the tires and rims. The thefts are under investigation.”", "\n“I think the big mistake Trump made was to quote Assange and he sort of had to walk it back. He never admits error. But it is a big mistake to quote somebody who clearly is an enemy of the United States…” – "]},
{"title": "Comedian and actor elected as new president of Ukraine, polls show", "body": ["\n          Ukrainian comedian and presidential candidate Volodymyr Zelenskiy gestures while speaking to his supporters at his headquarters after the second round of presidential elections in Kiev, Ukraine, Sunday, April 21, 2019. Ukrainians voted on Sunday in a presidential runoff as the nation's incumbent leader struggles to fend off a strong challenge by a comedian who denounces corruption and plays the role of president in a TV sitcom. \n          ", "Comedian and actor Volodymyr Zelenskiy will become Ukraine's next president after winning a vast majority of the embattled country's votes despite having no political track record.", "According to an exit poll on Sunday, 41-year-old Zelensky garnered 73 percent of the vote, unseating the incumbent candidate Petro Poroshenko. Zelensky was known for his role in a Ukraine television sitcom in which he plays the role of a president. Like his sitcom character, a teacher thrust into the presidency after a video of him blasting corruption went viral. He focused his campaign on fighting graft, riding the wave of public distrust of Ukraine's political elite.", "“To all Ukrainians, no matter where you are, I promise that I will never let you down,” Zelensky said upon receiving the poll results, ", " reports. “Though I’m still not president, I can say as a Ukrainian citizen to all the countries of the former Soviet Union: Look at us. Everything is possible.”", "Zelenskiy largely stayed away from the campaign trail and eschewed interviews. He campaigned mainly on Instagram, where he has 3.7 million followers. After Zelenskiy voted Sunday, police handed him a court summons for failing to keep his ballot away from cameras, an administrative offense punishable by a $30 fine.", "The candidates engaged in fierce mutual criticism and jockeyed for dominance. Wrapping up the campaign with a sentimental moment, both men dropped to on their knees during a debate at the country's largest sports stadium Friday to ask forgiveness of those who lost relatives on the eastern battlefront.", "\n      Ukrainian President Petro Poroshenko gestures while speaking to the media as his wife Maryna stands next to him, at a polling station, during the second round of presidential elections in Kiev, Ukraine, Sunday, April 21, 2019. Top issues in the election have been corruption, the economy and how to end the conflict with Russia-backed rebels in eastern Ukraine. ()\n      ", "Millions of Ukrainians who live in the rebel-controlled east and in Russia-annexed Crimea are unable to vote. Russia seized Crimea in 2014 in a move that Ukraine and almost all of the world views as illegal. Fighting in the east that erupted that same year after the Russian annexation has killed more than 13,000 people.", "Poroshenko campaigned on the same promise he made when he was elected for his first five-year term in 2014: to lead the nation of 42 million into the European Union and NATO. However, the goals have been elusive amid Ukraine's economic problems, pervasive corruption and fighting in the east. A visa-free deal with the EU spawned the exodus of millions of skilled workers for better living conditions elsewhere in Europe.", "In a jab at his rival, the president warned voters that \"it could be funny at first, but pain may come later.\"", "Poroshenko emphasized the need to \"defend achievements of the past five years,\" noting the creation of a new Ukrainian Orthodox Church that is independent from Moscow's patriarchate, a schism he championed.", "But Poroshenko's message fell flat with many voters struggling to survive on meager wages and pay soaring utility bills.", "\"We have grown poor under Poroshenko and have to save to buy food and clothing,\" said 55-year-old sales clerk Irina Fakhova. \"We have had enough of them getting mired in corruption and filling their pockets and treating us as fools.\"", "Poroshenko denies any link to an alleged embezzlement scheme involving one of his companies and a top associate.", "Zelenskiy, who comes from Ukraine's mostly Russian-speaking east, has opposed Poroshenko's push for a bill that would outlaw the Russian language and mocked the creation of the new church as a campaign stunt.", "Speaking to reporters, he said his campaign \"helped unite the country.\"", "Like Poroshenko, Zelenskiy pledged to keep Ukraine on its pro-Western course, but said the country should only join NATO if voters give their approval in a referendum. He said his top priority would be direct talks with Russia to end the fighting in eastern Ukraine.", "Zelenskiy's image has been shadowed by his admission that he had commercial interests in Russia through a holding company, and by his business ties to self-exiled billionaire businessman Ihor Kolomoyskyi. A Poroshenko archrival, Kolomoyskyi owns the TV station that aired the sitcom the actor starred in as well as his comedy shows.", "However, his ties to Kolomoyskyi have not sullied his image enough to cast him as a corrupt candidate in the eyes of voters.", "\"I have grown up under the old politicians and only have seen empty promises, lies and corruption,\" said Lyudmila Potrebko, a 22-year-old computer programmer who cast her ballot for Zelenskiy. \"It's time to change that.\""]},
{"title": "Kamala Harris, Democratic frontrunner", "body": ["California Sen. Kamala Harris announces bid for 2020 Democratic presidential race; Peter Doocy reports.", "**Want FOX News Halftime Report in your inbox every day? Sign up ", ".**", "\nYou can’t have a horserace without a frontrunner, and now the Democrats have both.", " has been running for president perhaps since even before her 2016 Senate win. Like 2005’s favorite freshman, ", ", she arrived in Washington with great expectations.", "\nBack then, Harris handily won the Democratic primary for what initially promised to be a hyper-competitive race to replace the retiring ", ". Harris breezed in (thanks in part to her long, highly successful alliance with then-Mayor now California Gov. ", ".)", "\nAs state attorney general and previously a longtime San Francisco district attorney, Harris had the right credentials. But most of all, she was well suited to the new political realities of a one-party Golden State.", "\nHers was the first statewide contest that featured no Republican in the general election under a new jungle primary system. Harris ran as an unapologetic liberal but one who would maintain her tough-on-crime credibility earned as a prosecutor.", "\nHarris’ real advantage, though, was she meant to be there. While as many as a dozen members of Congress, state lawmakers, mayors and others mulled a run, Harris got in early and did so with enough economic and institutional support to make her the frontrunner from the start.", "\nAnd like Obama, she drew national attention for her Senate run from the start. Young (yes, 54 is young by the standards of the Senate), attractive, media savvy, ambitious and of multi-ethnic origins, the Obama comparisons were instantaneous.", "\nNow, right on schedule and with an increasingly large number of backers, Harris is officially making her move. Her choice of ", " for the launch doubly emphasizes who she aims to be in the race: the candidate for an increasingly diverse party and one where women increasingly dominate.", "\nAlong with a similar path to power, Harris has also already inherited much of Obama’s base within the party, particularly among the donor class and political professionals. ", " could certainly change that with the flip of a switch, but as for today, Harris is the Obama legacy candidate. And given the depth of love Democrats again feel for Obama, that’s a good place to be.", "The other senators running, particularly ", " and ", ", boast robust fundraising and scores of devoted supporters. But they are also candidates of limited spectrum and will be stuck much of the campaign duking it out over and over again for the same activist voters. Harris has appeal among a broader swath.", " is also a legacy candidate, but it’s more baggage than blessing. She seems a great deal like an updated version of the woman she succeeded in the Senate, ", ". Gillibrand has lots of love from Wall Street, fungible views on policy and is evidently worried about her relatability. That all sounds pretty familiar.", "\nAnd ", "? Maybe ", "needs someone to ride shotgun as he LiveJournals his way across the hinterland.", "\nIt’s extremely early, and there will be changes on a near-daily basis. But Harris’ candidacy has the most important hallmark of a frontrunner: She’s making other candidates think and act differently. ", "\n     ", "\n“…for upon some occasions things will not admit of accommodation; and then the measures of government must be injuriously suspended, or fatally defeated.” ", " “A collection of the Rev. ", " Jr.’s papers on display in Atlanta provides insight into the slain civil rights leader’s thought processes as he drafted some of his most well-known speeches and notable sermons. ‘The Meaning of Hope: The Best of the Morehouse College Martin Luther King, Jr. Collection’ is set to open Saturday at the National Center for Civil and Human Rights in Atlanta. It is timed to commemorate what would have been King’s 90th birthday on Jan. 15 and to attract people visiting Atlanta for the Super Bowl next month. The Voice to the Voiceless gallery at the center plays host to exhibits of King’s papers from the Morehouse collection that rotate every four months. Organizers intended this particular exhibit to showcase the ‘best of the best,’ papers that people would instantly recognize without much explanation.”", "                                                                                                                            ", " - Email us at ", " with your tips, comments or questions.", " ", " 39.8 percent", " 55.6 percent", " -15.8 points", " down 1.4 points", "\n[", "]                    ", "                                                                                       ", " “[", "] … The moderate Democrat from Upstate New York had just been appointed to the Senate and liberals were in an uproar. Then a congresswoman, Gillibrand had an A-rating from the National Rifle Association. She co-sponsored bills to roll back restrictions on firearms in the District of Columbia and to limit disclosure of gun trace information by law enforcement. Gun control advocates were stunned that she was chosen to fill the seat. But Gillibrand’s transformation had already begun. … Gillibrand overhauled her political identity during this period, abandoning the conservative positions that made her popular upstate and embracing or even moving further left than the liberal consensus on guns, immigration, Wall Street and same-sex marriage. As the Democratic Party itself moved left, she staked out positions popular with the party’s swelling base of liberals, a posture most evident when she called for abolishing the Immigration and Customs Enforcement agency. She has voted against President Trump’s agenda more than any other senator.”", " ", " “Former Vice President ", " on Monday touted his relationship with former President ", " in a meeting with black voters in New York and assured them that he is close friends with Obama. ‘He's my buddy,’ Biden said at a breakfast hosted by Rev. ", " and the National Action Network. ‘All those memes are true, except he did the first friendship bracelet, not me.’ Biden name-checked Obama multiple times during his speech by referring to him as his friend ‘Barack,’ as he pitched the Obama administration’s record on the topics such as criminal justice reform. Biden made no specific reference to 2020, although he has hinted he'll be a candidate in the coming months. He appeared with former New York City Mayor ", ", who hinted that both he and Biden might be running.”", " ", " “Former Vice President Joe Biden acknowledged Monday that his record on criminal justice issues hasn’t always been perfect, addressing, albeit briefly, a key aspect of his long career in public office that could be a liability if he runs for president. ‘You know I’ve been in this fight for a long time,’ Biden said in remarks to a Martin Luther King Jr. Day breakfast in Washington. ‘I haven’t always been right, I know we haven’t always done things the right way. But I’ve always tried.’ Biden made no mention of the 1994 crime bill he authored, a law that's sparked criticism from progressive activists for its strict sentencing requirements. Biden had long touted his work on the issue, even recently as vice president since the legislation included gun control measures that have since expired.”", " ", " “Bloomberg’s top boosters insist he hasn’t made up his mind yet about running. He’ll make an official announcement within a month. If he decides to run, Bloomberg told reporters in Iowa last month, he would make climate change ‘the issue.’ Guns won’t be far behind. … At first glance, Michael Bloomberg would seem to have zero appeal in a Democratic Party where progressive populism is on the rise and activists and elites say it’s time for a woman or a person of color to win the White House. But unlike any of the other presidential hopefuls, Bloomberg plays a dominant leadership role on two of the top issues on the minds of progressives heading into the 2020 cycle: climate change and gun control. He’s spent a decade as the nation’s preeminent financier on those issues, buying considerable goodwill in progressive circles.”", " “It's likely that former San Antonio mayor ", " and former U.S. Rep. ", " of El Paso will joust for the Democratic nomination for president, along with numerous contenders from across the country. Some analysts have dismissed Castro's chances. They point out that since his keynote speech at the 2012 Democratic National Convention, his star has slipped…. Until he got into the presidential sweepstakes this month, Castro had been somewhat obscure since serving as Housing secretary in President Barack Obama's last term. Despite his low name recognition, Castro has strengths. He's currently the only major Latino in the contest. In the era of Donald Trump, where issues like building a wall along the nation's southern border with Mexico are dominant, Castro is a clear contrast to the sitting president.”", " “The annual King Day at the Dome in South Carolina served as a jumpstart to the 2020 presidential contest, featuring U.S. Sens. ", " and ", " telling voters they deserve better. The two are among a host of potential contenders to challenge President Donald Trump. … The event has become a staple for Democrats — or, in Sanders’ case, an independent — seeking the nation’s top job, as a way to appeal to voters in the first-in-the-South presidential primary. South Carolina is the first contest with a significant portion of black voters. … Booker, a Democrat from New Jersey, broadly challenged the audience to honor King by getting involved and working for change.”    ", " “The U.S. senator from Massachusetts announced in an email Sunday she will hold an event in South Carolina’s capital this week. It is the latest step in Warren’s potential 2020 presidential campaign, following ‘the launch of her exploratory committee,’ according to the email. Warren will attend a ‘Columbia Organizing Event,’ on Wednesday, her press office said in the email. The event will be held at Columbia College, and ‘is open to the public,’ the email stated. Tickets for Warren’s event can be reserved online. In addition to making tickets available, Warren’s press office said it is also looking for volunteers to ‘help’ at the event, per the website. … Warren has already visited New Hampshire and Iowa since launching her exploratory committee, the Associated Press reported.”    ", "                                   ", " “Secretary of State ", " is slated to meet with veteran Republican strategist Ward Baker on Sunday afternoon to discuss a possible 2020 run for the vacant Kansas Senate seat, according to two people familiar with the plans. Pompeo, a former congressman and ex-CIA director who in April 2018 was confirmed as secretary of State, is considering a Senate bid, though he has yet to make a final decision. Yet party leaders, including Senate Majority Leader ", ", are aggressively wooing him. McConnell (R-Ky.) and Pompeo spoke shortly after Kansas Sen. ", " announced his retirement. Pompeo and Baker are expected to talk about what a Senate campaign would entail.”", "              ", " “Democrats once said the so-called BRIDGE Act was urgently needed to protect young immigrants brought to the country illegally as children. But now that President Trump has offered to essentially include it as part of a compromise to re-open shuttered government agencies, those same Democrats are rejecting it -- unwilling to trade border wall funding for the immigrant protections they have long sought. … While the Democratic leadership in Congress has come out against the compromise, they are facing some pressure to deal. The editorial board of the Washington Post over the weekend called on Democrats to come back to the table. In an editorial titled ‘Make a deal. Save the dreamers,’ the paper argued Trump ‘should not be rewarded for having taken the government hostage’ but said Trump’s offer to compromise ‘should be welcomed.’”", " ", " “[T]he issue passed to the Senate, where Majority Leader Mitch McConnell has agreed to bring Trump’s proposal to the floor this week. Democrats say there’s little chance the measure will reach the 60-vote threshold usually required to advance legislation in the Senate. Republicans have a 53-47 majority, which means they need at least some Democrats to vote in favor.”", "     ", " ", " “Republicans had hoped his plan would put Democrats in a corner, but Democrats called it a nonstarter, prompting attacks from the president on the House speaker, Nancy Pelosi. And her relationship with her counterpart in the Senate, Mitch McConnell, who presumably would need to make a deal with her, is fraught. … While Mr. Trump has projected confidence in public, he has expressed private frustration over what he views as negative coverage. Many Republicans concede, also in private, that he has made strategic errors and allowed dysfunction to continue.”", " “The longest shutdown in history has left nine of the 15 major federal agencies without funding since Dec. 22, throwing government workers into furlough status, cutting pay to contractors and canceling previously scheduled projects. ADC, which provides security and conducts background checks for a variety of government agencies, has 350 employees in Albuquerque but it supports more than 2,600 workers nationwide.”                                    ", "     ", " - ", "    ", "                       ", ": ", " - ", " - ", "                      ", "                                                                                     ", " “I’m not thinking about politics right now.” ", "  “Thank you for bringing some semblance of looking at all sides of an issue. I feel very upset and disappointed with all politics lately. It has left me feeling like I don’t belong anywhere politically. Basically I’d like all the elected officials to do their jobs and stop acting like they are afraid to stand up to leaders in their party. I wonder if we would be better off if we didn’t have parties - just elect individuals and make them responsible for working together to get things done.” ", "\n[", "]", "“Many years ago I volunteered at my Son's elementary school (K-6) as what they called a ‘Yard Teacher’. We were, quite simply, an adult presence on the playground during recess and lunch break to give the teachers a break and help keep mayhem to a minimum. The children would have their spats, they would come to us for a solution, we would help them work things out and they would quickly get back to business. In light of the present situation, I think the Executive and Legislative branches of our government are badly in need of a ‘Yard Teacher’. To paraphrase Winston Churchill, ‘Never have so few done so little for so many’.” ", "\n[", "]                    ", " Email us at ", " and please make sure to include your name and hometown.", " “Kyrgyzstan is gearing up to introduce legislation that would oblige its president to wear a national pointed hat on diplomatic trips following a national uproar. On Monday a parliamentary committee supported the proposal -- which will also see fines levied for insults to the felt hat -- the first step towards the legislation's introduction for a general parliamentary vote. The bill is a result of a furore that erupted in late 2017 when a dog was photographed wearing an Ak-Kalpak hat at a dog show. The headpiece, which is usually white, has a special place in the Central Asian country, revered so much that it has its own national day. The four-panelled hat symbolises ‘the peaks of the magnificent Kyrgyz mountains, forever snow-capped,’ a former presidential advisor, ", ", told AFP last year.”", " “But remember: Enforcement followed by legalization is not just the political thing to do. It is the right thing to do — an act both of national generosity and national interest. It has long been the best answer to the immigration conundrum. It remains so.” ", " ", " January 31, 2013                                                                                                                            ", " is the politics editor for Fox News. ", " contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up ", "."]},
{"title": "Paul Ryan calls on Gianforte to apologize", "body": ["Republican candidate looked like a safe bet for Montana's lone house seat before altercation; correspondent Alicia Acuna reports from Bozeman", "House Speaker Paul Ryan said Thursday that Greg Gianforte, the GOP House candidate charged with assaulting a reporter, should apologize but added that it is now up to voters in Montana to choose whether they want him as their representative in Congress.", "\"There's never a call for physical altercations,\" Ryan told reporters during his weekly press conference. \"That is wrong and it should not have happened.\"", "\"I think he should apologize,\" Ryan added.", "The incident occurred when a Fox News team was scheduled to interview Gianforte at his campaign headquarters. The team said Ben Jacobs, a reporter from The Guardian, pressed Gianforte about the newly released Congressional Budget Office report on the American Health Care Act.", "Gianforte told Jacobs to talk to his press officer. At some point, Gianforte grabbed Jacobs by the neck with both hands and slammed him into the ground, according to witnesses.", "The Gallatin County Sheriff’s Office said in a statement that there was probable cause to issue a citation, but the nature of the injuries “did not meet the statutory elements of a felony assault.”", "If he’s found guilty, Gianforte faces a $500 fine and up to 6 months in jail.", "Gianforte, a former software executive, had the slight edge over his Democratic challenger Rob Quist, a country music performer, to fill the vacant House seat leading up to Thursday’s election. The majority of voters were expected to have already cast their ballots by early voting so it is unclear how much Wednesday’s events will have on election results.", "The Democratic Congressional Campaign Committee announced that it would launch as many Facebook ads as possible about the incident, targeting Montana Democratic voters who might not otherwise vote Thursday. The committee also said Gianforte must quit the race and the Republican Party should publicly denounce him.", "Three of Monatana’s biggest newspapers – The Missoulian, the Billings Gazette and the Independent Record - pulled their endorsement from Gianforte after an audio recording of the encounter went viral.", "The editorial board at the Billings Gazette wrote, \"We previously supported Gianforte because he said he was ready to listen, to compromise, to take the tough questions. Everything he said was obliterated by his surprising actions that were recorded and witnessed Wednesday.\"", "Gianforte had been slated to appear on \"America’s News Headquarters\" with Sandra Smith at 2 p.m. but a representative for the candidate said he would not be doing any national interviews following Wednesday’s incident."]},
{"title": "The shutdown is dead! Long live the shutdown!", "body": ["President Trump praises federal workers and their families, announces that he will sign a bill to open the government for three weeks until February 15.", "\n**Want FOX News Halftime Report in your inbox every day? Sign up ", ".**", "\nAssuming that this evening, the president does, in fact, sign a ", ", we will have just endured what amounted to an incredibly expensive spitting contest.", "and House Speaker ", "entered into a battle of wills in which he would not allow the government to reopen without billions more for border security funding and she would not negotiate more funding until the government was reopened.", "\nPelosi, needless to say, cleaned his clock. But we all know that this was just round one of what is expected to be the most grueling governance we’ve seen in the federal city.   ", "\nThe feeling of ennui (that’s French for “I can’t even…”) in Washington about the seemingly endless shutdown was because people here mostly understand shutdowns to be matters of budget priorities. And on its face, this one seemed to be exactly that. Democrats offer $1.6 billion in border funding, but Trump wants $5.7 billion. Seemingly simple, right? ", "\nBut more than a month passed and there were essentially no negotiations. And no counteroffers. There were no “gangs of eight” or discharge petitions or any other maneuvers. Everyone just sat and watched Trump and Pelosi sit and watch each other to see who would crack first. ", "\nAnd it is true that as a policy proposition, it was pointless. A short-term deal that allows negotiations to proceed is the expected outcome of every shutdown at its outset. That’s what usually happens after two days, not two pay periods. ", "\nBut this shutdown, and the one that will likely follow it on Feb. 15, was not about money. It was about establishing dominance. It was about base voters. It was about bragging rights. And most of all, it was about the 2020 election.", "Both sides now fairly agree that the purpose of this enormous infliction of intentional harm was to “teach a lesson” to the other side. Some of the quotes about it are on fake Washington background (“who asked to speak anonymously so she could say stuff she would never be caught dead saying in real life, anywhere.”) but others are pretty transparent.", "\n“We cannot reward the kind of behavior of hostage taking,” Sen. ", ", D-Va., told NBC. “Because if the president can arbitrarily shut down the government now, he will do it time and again.” No doubt very comforting for his constituents who couldn’t pay their rent.", "When you say publicly that you’re trying to establish an advantageous rhythm for continuing dysfunction you’re not exactly reaching for the Founders’ cup.", "Now that’s not to say we don’t strongly endorse the new performative style in Congress as recently exhibited by Sen. ", ", D-Colo., and Rep. ", ", R-La. Old ", " would be proud. It’s good to see lawmakers whooping it up again instead of just reading “Green Eggs and Ham.” Plus, three-piece suits and facial hair are both back in style, so we’ve got a real throwback situation going on.", "\nBut there’s no doubt it’s getting a little dicey in the cradle of Madisonian democracy.", "Congressional leaders invented the partial shutdown in the post-Watergate era when something as humiliating as not paying the Coast Guard would have been beneath the honor even of politicians. We suppose after you have a vice-president and president resign and surrender your embassy in South Vietnam, you tend to be more circumspect about asinine political stunts.", "But our current leaders have been treating this like an episode of “Shutdown Island.” ", "\nIt’s popular now to say that “this is why we can’t have nice things.” It would be more accurate to say that “this is why we can’t even have rotten things like government shutdowns.” And over less four one hundredths of the deficit alone!", "How does this cliffhanger end? Well, there’s a chance that it will result in some kind of holistic, durable and humane response to illegal immigration and illegal immigrants. There are about 50 other chances that say this is just the first of many damaging, petulant difficulties arranged around what are probably deeply misguided presuppositions about the 2020 elections.", "Republicans have been busy trying to designate a poster person for the increasingly liberal Democratic Party. Every day, Republicans find new shocking statements by left-wing Democrats, including... who’s the freshman from the Bronx? We can’t remember.", "But as Republicans scurry to brand Democrats as the party of ", " and ", ", Democrats are having no trouble defining the party of Trump as, well, the party of Trump. He is seemingly everywhere, and always talking.", "Despite the death of the daily press briefing, Trump is, to our knowledge, the most accessible American president in generations. He would do a press gaggle while he was flossing his teeth if they had good enough light in the bathroom. And have you ever seen such a cabinet meeting as these?", "\nNeither he nor his core supporters can like how this first round is ending, but as a concept, high-stakes struggles that consume day after day of coverage are a very good fit for our theatrical president.", "There are a million things that would be politically useful for Republicans to be talking about right now: The radicalizing Democratic Party, the biographical or personality flaws of the emerging Democratic field, impeachment, Covington Catholic High, New York’s new elective abortion bill... almost anything other than bread lines for active-duty military families.", "Will Trump be able to govern in such a way that doesn’t set the GOP up next year for an even worse kick in the teeth than they got in 2018? Does he want to? What if his interests and those of his party diverge?", "The answers start to matter more each day as Republicans — especially the president’s own campaign — work desperately to not make the 2020 election a referendum on Trump. For Republicans to have a fighting chance, the election will have to be substantially about the fitness of the Democratic challenger.", "\nAnd Trump driving like ", " from shutdown to showdown will not be the way to get there.", "\n“For the absurdity must continually stare us in the face of confiding to a government the direction of the most essential national interests, without daring to trust it to the authorities which are indispensable to their proper and efficient management.” – ", ", ", " “…", " [", "] was co-inventor of Bubble Wrap with his business partner ", ", a Swiss chemist. They were trying to create a textured wallpaper in 1957 that would appeal to the burgeoning Beat generation. They put two pieces of plastic shower curtain through a heat-sealing machine but were disappointed—at first—by the results: a sheet of film with trapped air bubbles. However, the inventors did not totally dismiss their failure. They filed the first of several patents for the process and equipment of embossing and laminating materials, then started thinking of uses: more than 400, in fact. One—greenhouse insulation—made it off the drawing board, but ultimately was about as successful as textured wallpaper. … To continue developing their unusual product, which was branded Bubble Wrap, Fielding and Chavannes founded Sealed Air Corp. in 1960. It wasn’t until they decided the next year to use it as packaging material that they found success.”", " Email us at ", " with your tips, comments or questions.", "39.2 percent", "56.6 percent", " -17.4 points", " down 1.6 points", "\n[", ".]       ", " “As he ponders a third presidential run, ", "is wrapping himself in familiar imagery, casting himself as an optimist who likes working with Republicans, an experienced and stabilizing force in a rocky political period. But the open question, asked even by longtime Biden supporters and advisers, is whether there is a market in 2020 for the Biden brand. The Democratic Party over the past two years has become increasingly partisan and sharp-edged. It has been fueled by a visceral hatred of Trump. And in its sharp shift, it has turned toward things that Biden, the 76-year-old lifetime pol, most certainly is not: fresh faces, minorities, and women. His strategy of casting himself as the bridge from one generation to the next, and as the one who can win over pragmatic Democrats as well as disaffected Republicans, would test the limits of Democratic primary voters who have encouraged the most diverse crop of candidates in history.”", " “Former Virginia Gov. ", " was the keynote speaker at the University of Virginia Center for Politics’ 20th Annual American Democracy Conference on Thursday. He said he’ll announce his decision about running for the Democratic nomination for president by March 31 and predicted the swelling field of Democratic candidates would quickly be narrowed to a dozen or fewer by the fundraising demands of a presidential campaign. Serious candidates, he said, would need to raise $50 million this year to be ready to compete.”", " “", "might not have a campaign yet, but he has a campaign-in-waiting. And if he decides to run for president, he’ll be handed an existing infrastructure that could help mitigate the effects of a late entry into the 2020 race. Two separate ‘Draft Beto’ efforts have become a significant force to keep public attention focused on him as a potential presidential candidate. And their groundwork in early primary states could prove critical if O’Rourke enters the race, delivering a roster of consultants and supporters for him to tap into if he runs. Unlike many of his Democratic rivals — several of whom are already far along in building their staffs — O’Rourke has done little on his own to assemble a campaign infrastructure in those states. In Nevada last week, a message introducing the Draft Beto effort was forwarded to Democrats via the secretary of the state Democratic Party, and when Democrats in New Hampshire received invitations to a Draughts with Draft Beto event in Concord next week, nine state representatives were listed among the co-hosts.”", " “The conservative Koch political network has told donors that it plans to once again stay out of the presidential race and will not work to help reelect ", "in 2020, a move that sidelines a major player that has been pivotal in mobilizing voters on the right for more than a decade. The decision reflects a narrow path that the influential network led by billionaire industrialist ", " has sought to walk in the Trump era: aligning with the president on some policy issues while withholding its electoral firepower on his behalf. The network’s plan to stay out of the 2020 race was quietly relayed to major donors in recent months, according to people familiar with the conversations. It comes as the network has sought to shift attention from its political activities to its investments in education and philanthropy. Donors say they expect to discuss the issue at a retreat for top network contributors this weekend.”", " ", " “Former West Virginia State Sen. ", " ended his long-shot presidential bid on Friday. A leader of the state’s teachers strikes last year, Ojeda concluded that the campaign ultimately wasn’t winnable and told his supporters that he could no longer ask people to contribute money to a cause he thought was lost. ‘I don’t want to see people send money to a campaign that’s probably not going to get off the ground,’ he said in a video he recorded and provided to The Intercept and The Young Turks.”", " “Former Trump adviser ", "vowed during a dramatic press conference outside a federal courthouse in Florida on Friday afternoon to fight the charges of witness tampering, obstruction and false statements brought by Special Counsel ", ", calling the charges ‘politically motivated’ while insisting he would not turn against President Trump. ‘I will plead not guilty to these charges,’ Stone told reporters, speaking over hecklers. ‘I will defeat them in court. This is a politically-motivated investigation.’ Stone, who once worked for former President Nixon and has a tattoo of the former president on his back, flashed the Nixon V-signs in front of cameras before he spoke. ‘There is no circumstance whatsoever under which I will bear false witness against the president, nor will I make up lies to ease the pressure on myself,’ said Stone, who will appear on ‘", " Tonight’ on Fox News Channel Friday at 8 p.m. ET.”", "- ", " - ", "- ", " - ", "\n“No one should ever underestimate the Speaker, as Donald Trump has learned.” – ", "\nThis weekend ", " will sit in for Mr. Sunday. He will be joined by Sen. ", ", D-W. Va., and NATO Secretary General ", ". Watch “Fox News Sunday with ", ".” Check local listings for broadcast times in your area.", "Host ", " has the latest take on the week’s media coverage. Watch #mediabuzz Sundays at 11 a.m. ET.", "\n“Thank you for including the link to", "’s ", " in the Atlantic regarding the media coverage of the Covington students. The inspiring truth that is missed by most of the coverage is the astonishing restraint demonstrated by these teenage boys. Flanangan thankfully does the deep dive that this story truly deserves. Her closing with receiving an email reminder from the New York Times on journalistic ethics is priceless.” – ", "\n[", "]", "\n“Your use of ‘Terpsichore’ [in Thursday’s Halftime Report] sent me running to Wikipedia. Your motive, no doubt, was to transport your readers to Greek Myth and thus allow us to escape from our depressing contemporary tragedies. Were you also intending for us to learn that Hubris is one of Greek Myths’ main themes? And that perpetrators were punished for ‘actions that shamed and humiliated the victim for pleasure or gratification’?” –", "\n[", "]    ", "\n“The length of the Halftime Report is ‘Just right!’ It varies depending on what is going on… and is bound to be longer to cover all the maneuvering by the Dems in the lead-up to 2020! I suggest to your reader who was not bothering to open just open, and read the sections you are interested in!! It is very nicely delineated with a short phrase or sentence in bold… that will alert you as to whether that is something you are interested it. It would be a shame to miss the opening commentary by Chris, Krauthammer’s quote and other notables!!” – ", "\n[", "]", "Email us at ", " and please make sure to include your name and hometown.", " “", "from Lexington, Kentucky, entered his [science] project titled, ‘Is ", " a Cheater?’ into his elementary school's science fair to prove that deflated footballs give players an advantage. Brady and the Patriots were famously accused of deflating footballs in 2015 during the AFC title game by the Indianapolis Colts. … But, Davis, who is also a quarterback, wasn't satisfied with the punishment and set out to solve the mystery — once his dad gave him the idea for the project. … Ace's experiment utilized the scientific method, listing his hypothesis on a trifold poster to illustrate his findings. … To test his theory, Ace's family was enlisted to throw footballs with varied amounts of inflation in their yard. After measuring the distance of each throw and calculating the average, Ace found that the least-inflated ball traveled the farthest distance. … Ace said he would tell Brady he ‘needs to retire’ if the two ever came face-to-face. Ace also said he would tell him ‘give me some of your money. You don't deserve it.’”", "\n“The Founders we're deeply opposed to the militarization of civil society. There is all kinds of aversions to it and this is importing it because, as you say, it's cheap, it's easy, it's silent. It's something that you can easily deploy. It's going to be, I think the bane of our existence.” – "]},
{"title": "In Florida battleground, Puerto Ricans fleeing Maria's destruction reshape electoral landscape", "body": ["Hurricane Maria changed the electoral landscape in Florida's critical I-4 corridor with an influx of displaced Puerto Ricans who can now register to vote. Some influential community leaders open up about the power of the Puerto Rican vote.", "Carmen ‘Millie’ Santiago arrived in Florida with her husband and two children after Hurricane Maria took everything – destroying her home and the child care center where she worked, forcing the family to leave Puerto Rico and start over.", "“Often, when people relocate to a new place, they have the opportunity to sell a couch or a mattress and have some money,” Santiago said. “The people who came here after Maria didn’t have the opportunity to do any of that. We are all here starting from scratch.”", "Santiago represents just one of the roughly 200,000 Puerto Ricans", "who fled their island for Florida after the Category 4 storm hit the U.S. territory last September.", "But as they begin the painstaking work of rebuilding their lives in the Sunshine State, the influx of new residents has also commanded the attention of Florida’s officeholders and candidates. Taken together, these potential new voters represent a potent political force and their relocation could hold major implications for this year’s elections and beyond.", "Over 56,000 Puerto Ricans, including Santiago and her family, have settled in the Orlando area, according to estimates by the Center for Puerto Rican Studies at Hunter College in New York. Orlando is a critical part of what’s known as the I-4 corridor – which runs between St. Petersburg and Daytona Beach and has become one of America’s most contested political battlegrounds.", "'There’s an active campaign and fight for the soul of the Puerto Rican voter.'", "According to Census Bureau data, Puerto Ricans have voted 60 percent Democratic in past elections nationally. But these voters could well be up for grabs for both parties, in this year’s midterms and perhaps in 2020 – as Puerto Ricans pay close attention to candidates’ plans and promises for the island’s reconstruction and for those who fled.", "Donald Davison, a professor of political science at Rollins College, said it would be wrong to view their vote on a monolithic bloc for one party.", "“I think it’s a simplification to classify a Puerto Rican vote or a Hispanic vote as a party’s lock yet,” Davison said. “These are groups of voters that display a great complexity and subtlety.”", "In just one sign of how the population has expanded in a short period of time, nearly 14,000 people – three times as many as last year – showed up during the Puerto Rican parade in Central Florida in April.", "More significant, community leaders told Fox News that many registered there as first-time voters.", "\n      'People are engaged,' Christian Lloyd Suarez says.\n      ", "“People are engaged and involved and you saw a lot of people there registering voters,” Christian Lloyd Suarez, the Puerto Rican parade’s organizer, said.", "While a litmus test for political candidates wooing this important electorate traditionally has been their position on statehood for Puerto Rico, the view of the U.S. government’s controversial handling of post-Maria recovery aid has become just as important, community members and leaders say.", "Some Puerto Ricans felt the Trump administration offered insufficient help to the island in the wake of the disastrous storm. The island was allocated over $15 billion in federal aid earlier this year, though Puerto Rican leaders have asked for much more.", "“People are still watching and they’re seeing who’s helping our community, who’s voting in favor of legislation that will help our community,” community leader Zoé Colón told Fox News, noting that Puerto Ricans are not remaining passive. “… We are a force to be reckoned with.”", "Florida’s 2018 midterm election could be one of the most important in years. And candidates seeking all levels of public office have been courting Puerto Ricans, who have a long history in the state.", "\n      Zoé Colón says, 'We are a force to be reckoned with.'\n      ", "The governor's office is open this year, while several congressional seats will be competitive and Floridians will vote on 13 proposed constitutional amendments. Sitting Republican Gov. Rick Scott, who backs Puerto Rican statehood, also is challenging three-term Democratic Sen. Bill Nelson.", "The issue of displaced Puerto Ricans flared into a recent campaign controversy in a Florida congressional race – when Republican John Ward, a businessman running in Florida’s 6th District, came under fire for saying those who relocated to Florida after Hurricane Maria shouldn't be allowed to vote.", "“I don't think that they should be allowed to register to vote,” he told a reporter, saying he \"doesn't necessarily have a problem\" with Puerto Ricans coming to the mainland United States but thinks the focus should be on their return. He said the U.S. should provide \"the capital and resources to rebuild Puerto Rico, which is where I honestly think they belong.\"", "One of his primary opponents, former state representative Fred Costello, posted a video of the remarks on YouTube. State GOP Rep. Bob Cortes, a Costello supporter who is Puerto Rican, said of Ward, \"Electing a candidate like that is dangerous and would be a disservice, not just to the Puerto Rican Americans he would disenfranchise, but to all freedom-loving Americans.\"", "In an interview with the Orlando Sentinel on May 22, though, Ward clarified his remarks and said he was referring to temporary, displaced Puerto Ricans.", "“Puerto Ricans are American citizens, and if they’re going to be permanently living here in Florida, of course they can register and be welcomed into the community,” he said.", "Despite Ward’s comments, many Puerto Ricans may now consider Florida their long-term home.", "Hurricane Maria caused more than an estimated $100 billion in damage. The number of hurricane-related deaths remains in dispute; many experts believe it is in the hundreds, if not thousands, according to an Associated Press report.", "Hurricane Maria also caused the longest blackout in U.S. history, leaving the entire island of 3.3 million people without power, including those in hospitals and nursing homes who relied on respirators.", "Millie Santiago recalled to Fox News that she told her husband in the wake of Maria that they could “start in Florida from scratch, because we lost everything in Puerto Rico.”", "“It was at that moment when we enrolled in FEMA,” she said.", "Puerto Ricans leaders allege a contrast between the Trump administration’s response to Hurricane Maria, whose highest sustained winds hit 155 miles per hour, and Hurricane Irma, which hit Florida 10 days earlier and had maximum winds at 132 miles per hour.", "They note, for instance, that the Federal Emergency Management Agency (FEMA) activated its Transitional Sheltering Assistance (TSA) program on the day Irma struck, but the agency took more than a month to active it on the mainland for Hurricane Maria evacuees.", "Rev. José Rodríguez of Iglesia Episcopal Jesus de Nazareth, who has been helping many of the Puerto Rican families displaced by Maria, complained that families affected by Maria had to fight with the feds for hotel extensions while those affected by Irma did not.", "\n      Jimmy Torres Vélez says Puerto Ricans who make Florida their new home are mindful of the impact their participation in elections can have on Puerto Rico.\n      ", "“Why did Irma get extended without a fight, but the Puerto Rican families have to fight?” he asked.", "The Trump administration, though, has adamantly defended its response.", "“We've done unprecedented movement in terms of federal funding to provide for the people of Puerto Rico and others that have been impacted [by] these storms,” White House Press Secretary Sarah Sanders said last September. “We'll … continue to do everything that we possibly can under the federal government to provide assistance.”", "Brendan Ramirez, CEO of the Pan American Behavioral Health Services of Florida, said political candidates cannot dismiss Puerto Ricans’ concerns, though.", "“You don’t have to look any further than the 2016 presidential election, where voters felt marginalized and did something that nobody thought they would be able to do, and the reason that they did that was precisely because they felt like they were marginalized,” he said. “That’s what you’re going to see here in Central Florida with new and established Puerto Ricans.”", "Puerto Ricans long have been rooted in Florida, first in the southern end of the state and in later years in the central region. Their numbers in Central Florida have grown dramatically in recent years in response to the economic crisis on the island, prompting many professionals and more affluent Puerto Ricans to leave.", "Jimmy Torres Vélez, coordinator for Boricua Vota, said that Puerto Ricans who make Florida their new home are mindful of the impact their participation in elections on the mainland can have on Puerto Rico.", "“Here, we have an opportunity and can vote,” Velez said, “and we need to make sure that people understand that by voting here, they can help Puerto Rico.”", "Fernando Rivera, professor of Sociology at University of Central Florida, said the connection between Puerto Ricans on the island and the mainland has “grown stronger” since the storm. “The U.S. Congress has a lot to say and do, as to the future of the island,” he said.", "Millie Santiago said there should be no question about the determination of Puerto Ricans. “I can tell you firmly that we’re hard-working people. We’re on the streets fighting to get ahead and we are here for everyone, not just fighting for our own skin; we stick together,” said Santiago. “I want people to understand that. We’re here to fight, not just for our fellow Puerto Ricans, but for all the Latinos that find themselves here without housing.”", "The most recent data shows that in 2015, about 769,000 Puerto Ricans in Florida were eligible to vote. Groups like Boricua Vota, Mi Familia Vota and UnidosUS are making major pushes to register Hispanic voters in the state. Their leaders say they expect to register a combined total of 35,000 new Puerto Rican voters.", "Christian Lloyd Suarez said lawmakers from both parties have an opportunity to make their case to Puerto Rican voters. “A lot of Puerto Ricans don’t identify as a Democrat or as a Republican … so I think there’s a real opportunity for Puerto Ricans to be persuaded,” Suarez said.", "As Hector Cordero-Guzman, a professor at Baruch College Marxe School of Public and International Affairs, put it, “There’s an active campaign and fight for the soul of the Puerto Rican voter.”"]},
{"title": "Doug Jones, new Alabama senator: What to know", "body": ["Does the Democrat's victory put more pressure on the GOP to pass tax reform before he gets to the Senate?\n", "For the first time in more than 20 years, Alabama has a Democratic senator – Doug Jones.", "Jones ", " controversial Republican Roy Moore in a special Senate election last month. Jones, a former prosecutor, is the state's first Democrat elected to the U.S. Senate since Richard Shelby in 1992. Shelby, who is still in the Senate, later became a Republican.", "Jones was sworn in to the U.S. Senate Wednesday. He is expected to be escorted by former Vice President Joe Biden, a Biden aide confirmed to Fox News.", "When asked by Fox News if he had a message for Alabama voters, Jones simply responded, “Thank you.”", "A former U.S. attorney during the Clinton administration, Jones, 63, is perhaps best known for successfully prosecuting two members of the Ku Klux Klan accused of bombing a Birmingham church in 1963 that killed four young girls.", "\n      Democratic Alabama U.S. Senate candidate Doug Jones acknowledges supporters at the election night party in Birmingham, Alabama.\n      ", "“I may have the honor of serving Alabama as your senator, but the most important thing I have done is prosecuting those klansmen who killed 4 little girls at 16th St Baptist Church,” Jones said in a November tweet ahead of his election.", "Because of his resume, Steven Taylor, a political science professor at Alabama’s Troy University, said Jones is considered to be a “quality candidate” in the political science world. He's “someone who is credible and, therefore, competitive,” Taylor told Fox News.", "“We’ve not seen a lot of quality Democratic candidates for Senate because Sen. [Richard] Shelby and Sen. Sessions, they were so strongly ensconced in their positions that the Democratic nominee was most often a more fringe candidate and not taken very seriously,” Taylor said. “Jones doesn’t fall in that category – he has a background as a prosecutor, he has linkage to civil rights prosecution for the bombers in Birmingham. This makes him a more serious and significant candidate.”", "Openly critical of Trump, Jones promised to fight for pro-abortion policies, tackling student loan debt and raising the minimum wage.", "He also made it clear during the special election that he is opposed to Republicans’ efforts to repeal former President Barack Obama’s signature health care overhaul. He called those efforts a “nonstarter.”", "“There are a lot of people who didn’t vote for me, and I hope they will keep an open mind because I am going to try to be the best senator I can for the state to try to move the state forward as a whole and not just one particular group or philosophy,” Jones said.", "\"I will be an independent voice and work to find common ground with my colleagues on both sides of the aisle...\"", "Jones will represent one of the most conservative states in the nation and has already expressed his strong desire to work with both parties while in office. He will be under some pressure to find areas of agreement with Republicans and has hinted that infrastructure improvements could be one such arena.", "“I will be an independent voice and work to find common ground with my colleagues on both sides of the aisle to get Washington back on track and fight to make our country a better place for all,” Jones previously said.", "Before the Senate seat belonged to now-Attorney General Jeff Sessions – whom Jones is replacing – it belonged to the man Jones considered his mentor, the late Sen. Howell Heflin. Jones worked for Heflin as a staffer after graduating from law school in 1979.", "Alabama House Minority Leader Anthony Daniels, a Democrat, praised Jones for being “a fighter for his entire career.” He ", " that Jones would bring “unity and civility” to the Senate and would work with lawmakers across the aisle to better Alabama.", "During the campaign, Roy Moore, Jones’ Republican opponent, was accused of having inappropriate sexual relations with minors while Moore was in his 30s. Moore, now 70, adamantly denied allegations of misconduct but did tell Fox News’ Sean Hannity that he “generally” didn’t date women who were teenagers when he was in his 30s and would not date someone without her mother’s permission.", "\n      A combination photo shows Democratic Alabama U.S. Senate candidate Doug Jones (L) and Republican U.S. Senate candidate Roy Moore (R) at their respective election night parties in Birmingham and Montgomery, Alabama.\n      ", "While Jones initially stayed away from the accusations against Moore, the Democratic candidate came out swinging during a speech the week before the election.", "“I damn sure believe that I have done my part to ensure that men who hurt little girls should go to jail and not the United States Senate,” Jones said.", "Jones received surprising financial backing from a Senate Republican – Jeff Flake. The Arizona senator tweeted a photo of a check made out to Jones with the subject line saying, “Country over Party.”", "Flake, who has announced he will not seek re-election in 2018, was openly critical of Moore and ", " to “step aside” from the race.", "After Moore won the Republican primary in the special election, President Trump offered his support. But once Moore lost, Trump congratulated Jones and attempted to distance himself from the beleaguered former judge.", "“Congratulations to Doug Jones on a hard fought victory. The write-in votes played a very big factor, but a win is a win,” Trump said. “The people of Alabama are great, and the Republicans will have another shot at this seat in a very short period of time. It never ends!”"]},
{"title": "Dem women shrug off Biden controversy in poll", "body": ["Recent allegations of former ", " ", " dominated political headlines for most of last week, but a new poll indicates voters in one of the country's largest states don't consider it a serious issue.", "A Quinnipiac University public opinion ", " of California voters also suggests that Biden – who’s likely to launch a White House bid in the coming weeks – is the leader of the pack in the Golden State among the large field of contenders vying for the Democratic presidential nomination.", "Two-thirds of voters questioned in the live operator survey – including 67 percent of women, 71 percent of Democrats, and even 55 percent of Republicans - said the controversy was not a serious issue.", "\"'Let Biden be Biden,' say California voters, clearly unconcerned about former Vice President Joe Biden's tactile embrace of supporters,\" Quinnipiac Polling assistant director Tim Malloy said. \"But there is one noticeable generational split. The youngest of voters are far more inclined to say, 'hands off.'\"", "Biden’s well publicized and decades long affectionate brand of physical politics was thrust into the spotlight nearly two weeks ago, thanks to allegations from 2014 Nevada Democratic lieutenant governor nominee Lucy Flores. She said in an essay published in New York Magazine that Biden made her feel \"uneasy, gross, and confused\" at a campaign rally when she said he kissed her on the back of the head. Her claims quickly went viral and became a top cable news story for a  week.", "In the ensuing days, six other women came forward to recount similar physical encounters with Biden that they said made them feel uneasy.", "Those accounts were countered by dozens of testimonials from women – ranging from former Biden staffers to lawmakers – who said they had always viewed the former vice president as supportive.", "Speaking with reporters last Friday, the former vice president stressed, “I’m sorry I didn’t understand more. I’m not sorry for any of my intentions. I’m not sorry for anything I’ve ever done. I’ve never been disrespectful intentionally to a man or a woman.”", "And Biden explained that \"it is incumbent on me and everybody else to make sure that if you embrace someone, if you touch someone, it’s with their consent, regardless of your intentions.\"", "\"It’s my responsibility to do that,\" he added.", "According to the poll, 26 percent of likely Democratic presidential primary voters in California say they would support Biden as their party’s nominee, with Sen. Bernie Sanders of Vermont in second place at 18 percent. Sen. Kamala Harris of California, the state’s former attorney general, was a percentage point behind Sanders, at 17 percent.", "Sen. Elizabeth Warren of Massachusetts and South Bend, Indiana Mayor Pete Buttigieg stood at seven percent, with Sens. Cory Booker of New Jersey and Amy Klobuchar of Minnesota and former San Antonio mayor and former Health and Human Services secretary Julian Castro each at two percent. Everyone else in the large field of 2020 contenders registered at one percent or less.", "Thirty-five percent of Democrats or Democrat-leaning independents said Biden had the best chance of beating Republican President Donald Trump in the 2020 general election, and 31 percent said Biden would be the best leader.", "California is playing a more influential role in the 2020 nominating process, thanks to a move by the state to push it’s primary up to early March. California will be the largest of the 12 states scheduled to vote on March 3, 2020, directly after the early voting primary and caucus states of Iowa, New Hampshire, Nevada and South Carolina.", "The Quinnipiac University poll was conducted April 3 - 8, with 1,005 California voters question. The survey’s overall sampling error is plus or minus 4.1 percentage points, with 5.9 percentage plus or minus margin of error for questions of likely Democratic primary voters."]},
{"title": "Beto O’Rourke picking off support from primary rivals out of the gate", "body": ["CHARLESTON, S.C. -- Kicking off his campaign with a swing through early battleground states, newly announced Democratic presidential hopeful ", " met with voters at the University of New Hampshire in Durham on March 20.", "Speaking to an overflow crowd of over 500 people, most of whom were students, he discussed tackling ", ", raising pay for teachers, the debate over ", " and reducing student debt, sharing his personal experience with the growing burden.", "“I have no hope of earning your vote if I have not first listened to you,” he said.", "University of ", " student Madeline Putman said it was exactly what she wanted to hear from a visiting ", "“I was interested in [Vermont Sen.] ", " and [New York Sen.] ", " because I am from upstate New York and that's where she's from, but after hearing their policies versus Beto’s today, I think he has my vote,” she told Fox News.", "UNH student Wyleigh Chase said O’Rourke’s age, 46, is a factor for her.", "“He's young and refreshing…he's somebody that I think I can relate to just as much as my parents can relate to and I think that's really unique and something that you don't find in a lot of political candidates,” she said. “So far, my support is leaning for Beto.”", "When asked whether they would attend future New Hampshire events hosted by other Democratic candidates, both Putman and Chase said it would take a lot of convincing to change their minds.", "It’s an effect being repeated at campaign stops across the country —the former El Paso congressman plucking supporters of his Democratic rivals to join his movement.", "With a ferocious pace and laidback style, O’Rourke hit eight traditionally-early voting states in his campaign’s first 10 days.", "Driving his own rented minivan to and from events and speaking in both English and Spanish to crowds of hundreds, he has made a lasting impression on voters who had heard little of him before his visit to their state.", "On March 14, after months of speculation, he announced ", " that he was jumping into the crowded race to take on incumbent President Donald Trump.", "Less than two years ago, O’Rourke was relatively unknown, developing a faithful following during his high-profile Senate run against incumbent Republican Texas Sen. Ted Cruz. After his ", " in November 2018, coming within just two points to victory, rumors began to circulate about a possible presidential run—the loss proving to be a catalyst to his run for a position far greater.", "O’Rourke showed that he could be competitive in deep-red Texas, peeling away his label as an underdog to become a rising star within the Democratic party.", "Since his announcement, the venues for his campaign stops have ranged from dive bars to university auditoriums, each standing-room only by the time he begins speaking. Most of the time, he's perched on a stool, chair or bar top so all attendees have a view of him.", "Crowds chant “B-E-T-O” as they wait for him to arrive and swarm around him asking for autographs, selfies and handshakes as soon as he wraps up.", "“He is a very charismatic engaging young man,” said Iona College political science professor Jeanne Zaino. “People really do…feel that he has this ability to transcend almost into an Obama-esque quality…these people feel like he has what it takes to beat the sitting president and to bring the country together should he be elected.”", "His outsider status, millennial appeal and reputation as a moderate with crossover appeal for Republicans critical of President Trump have gained him a new base of supporters, many of whom have jumped ship to join the “Beto bandwagon.”", "“My loyalty has mainly lied with Bernie Sanders,” said University of South Carolina student Dev Patel. “But frankly, I have to admit a few of the views he holds are too radical to really work with the political ecosystem we have…so as of now, I’m definitely loyal to Beto.”", "But he isn't only appealing to former Sanders supporters.", "“I was very much a fan of [California Sen.] Kamala Harris,” said South Carolina voter Dwayne Green.  “It was between her and Beto and right now, I’m team Beto.”", "New Hampshire voter Courtney Tobe said she identified as a Republican until the 2016 election and is attracted to O’Rourke’s message of unity.", "\n      Former Republican New Hampshire voter Courtney Tobe said O'Rourke's message of unifying the country attracted her to the candidate.\n      ", "“He doesn't seem to be doing much mudslinging or…talking trash about the other candidates,” she said. “He's really just trying to focus on how he can bring the country together and that's what we need. We need someone who we can look up to and respect.”", "But some voters are patiently holding out for other candidates to gain their support.", "“Does he have what it takes? Does he have my best interests at heart?” asked South Carolina voter Jennifer Duggan. “That still remains to be seen…there's a lot to still uncover about all the candidates…I'm just being open-minded to who’s all out there…”", "O'Rourke ", " in online contributions during the first 24 hours of his grassroots campaign, outpacing Sanders, who raised more than $5.9 million in the first full day after he launched his campaign. Harris, who declared her candidacy in January, raised $1.5 million in the 24 hours following her announcement and Minnesota Sen. Amy Klobuchar raised more than $1 million within the first 48 hours.", "Free of a day job, O’Rourke is determined to get ahead of the rest of his competitors, with 10 months left until voting begins.", "\n      \n      ", "He is up against more than a dozen Democratic rivals, including fellow Texan, Julián Castro, the former Obama administration Secretary of Housing and Urban Development and San Antonio Mayor.", "With his announcement, ", ", who is technically still undeclared, but has hinted at entering the race. An official April announcement is expected.", "According to the ", ", Biden is the top choice at 31 percent, followed by Sanders at 23 percent. O’Rourke, three decades their junior, makes up a second tier with Harris. They are followed by New Jersey Sen. Cory Booker and Massachusetts Sen. Elizabeth Warren, each with four percent. The other candidates received less than 2 percent of the vote.", "\n      \n      ", "But his popularity seems to be rising. ", "released this week ranked O’Rourke third at 12 percent among Democrats and Democratic-leaning independents.", "O'Rourke's willingness to take questions from both attendees and the media at each of his events has shown the country what he stands for, as well as what he lacks as a candidate.", "His speeches touch on a variety of hot-button topics like climate change, gun control, criminal justice and healthcare reform, student debt and police brutality against African-American men, among others.", "But critics argue his work-in-progress platform doesn’t have specific policy proposals compared to his competitors who were able to detail step-by-step strategies for change at this point in their campaigns, something that is most apparent in post-speech Q&A sessions with attendees and conversations with media where O’Rourke sidestepped questions on his views on late-term abortion and whether his campaign will accept money from the fossil fuel industry.", "“Beto is going to have to answer the lack of experience question…he's going to have to lay out his policy positions in a more concerted way,” said Zaino. “He has so far been fairly vague…about many issues that Democrats care about.”", "But Antjuan Seawright, CEO and founder of Blueprint Strategy, a political consulting company, says O’Rourke could use that to his advantage.", "“...The more miles you have on your political engine, the harder it is for your car to travel down the road…so I think that's actually a strength…that he does not have the experience some of the others in the race have,” he said.", "O’Rourke will officially kick off his campaign on Saturday with visits to three Texas cities, starting in his hometown of El Paso. Campaign volunteers have organized more than 1,000 watch parties across the country for the announcement."]},
{"title": "Howard Schultz, at Fox News Town Hall: Trump will win re-election if Bernie Sanders gets Democrat nomination", "body": ["Former Starbucks CEO Howard Schultz discusses accusations that Joe Biden inappropriately touched women.", "Potential independent 2020 White House contender Howard Schultz predicted outright that President Trump will win re-election if Democrats nominate a self-described socialist like Bernie Sanders, during Fox News' \"America's Election HQ\" Town Hall Thursday night in Kansas City, Missouri.", "Schultz also said he \"took full responsibility\" for his disastrous ownership of the former Seattle SuperSonics professional basketball franchise from 2001 to 2006, claiming he lost money on the team that now operates as the Oklahoma Thunder. Mismanaging a basketball team of \"13 people\" and driving away the city's first major professional sports franchise, Schultz insisted, should not in any way be seen as a \"proxy\" for his presidential chops.", "The Town Hall, co-hosted by Fox News' Bret Baier and Martha MacCallum, began as Schultz ", " \"concerning,\" but also charged that it was similarly \"concerning\" that the allegations had suddenly surfaced as he prepares to announce a presidential bid.", "Earlier this week, members of Biden's inner circle signaled they were becoming increasingly convinced the Bernie Sanders' campaign ", " of physical misconduct recently leveled against the former vice president -- and, in the words of one prominent backer, ", "\n      FILE - In this Feb. 7, 2019, file photo, former Starbucks CEO Howard Schultz speaks at Purdue University in West Lafayette, Ind. A Florida woman is suing Schultz after she says she and others on the national do not call list got automated text messages promoting his book tour. Schultz is considering an independent bid for president and launched a tour in January for his latest book, \"From the Ground Up.\" (AP Photo/Michael Conroy, File)\n      ", "\"There's no reason for anyone to believe that these women are not telling the truth, but it's really up to the voters to decide whether Vice President Biden is qualified to run,\" Schultz said.", "Asked by Baier if Schultz would ever vote for Biden, Schultz said simply that he would \"vote for myself.\" However, he clarified that he was not announcing a presidential run Thursday.", "Schultz additionally criticized Trump's ", ", which has resulted in the ", " against the country's virulently anti-U.S. leadership, as well as the planned ", ".", "Schultz also characterized Trump's claims -- ", " -- that ISIS had been largely defeated as a \"falsehood.\" Schultz said he would \"discuss with my advisors\" whether to re-enter the Iran deal.", "Schultz separately denied he would play a \"spoiler\" in the race -- and suggested instead that someone like Sanders could unwittingly play that role.", "\n      Smoke rises from the last besieged neighborhood in the village of Baghouz, Deir Al Zor province, Syria, March 18, 2019. REUTERS/Stringer - RC17D06F0850\n      ", "On abortion, Schultz said to applause, \"In my view, there should be no abortion that is in the last trimester. Abortion should be safe, legal, and rare.\" Later, Schultz said John Roberts would be his model bipartisan Supreme Court pick. Roberts, in February, ", ", as the chief justice publicly tries to present the court as nonpartisan.", "On providing taxpayer-funded reparations to Native Americans and black Americans, Schultz said he would \"rather look forward.\" Several prominent Democrat candidates have openly embraced the idea of issuing such reparations, including ", ", Kamala Harris, Elizabeth Warren, Beto O’Rourke, Julian Castro and Tulsi Gabbard.", "On immigration, Schultz decried partisanship on the issue, calling the situation a \"crisis that can be solved.\" He compared what he saw on the border to \"internment camps\" during World War II.", "\"Given what's happening in our southern border ... it's a question of humanity and legal immigration,\" Schultz said. \"I don't know how many people are aware in this audience, but President Bush 43 and Obama, both, while they were president, submitted to Congress an immigration bill. In both cases, the opposition took that bill, rejected it, and would not pass it.\"", "Schultz said those bills, today, would be indistinguishable as Republican or Democrat-sponsored bills, and said they failed simply because of reflexive political obstruction.", "\"That is the problem that existed then, and that is the problem that exists now. I can promise you that Nancy Pelosi will not, under any circumstances, give President Trump a victory on immigration.\"", "\"What I saw, in my mind, is a fracturing of American values and a fracturing of humanity.\"", "Former Starbucks CEO Howard Schultz discusses border security.", "Schultz also condemned both Republicans and Democrats for their health care proposals -- saying there's a \"better way\" than simply repealing ObamaCare or enacting a costly \"Medicare for All\" scheme.", "Schultz's appearance on Fox News came weeks after the Democratic National Committee (DNC) excluded the network from hosting a Democrat primary debate. The DNC has since ", " with Sanders appearing on Fox News.", "Schultz similarly bucked Democrats with his decision to attend the annual American Israel Public Affairs Committee (AIPAC) conference in Washington on Monday, which came as Democrats have been grappling with the left's criticism of Israel and as most presidential candidates are sitting this year's conference out.", "Prominent Democrats, including ", " and ", ", have come under fire from several commentators for making purportedly ", " -- with Omar ", "On Friday, Schultz responded to a tweet from the liberal advocacy group MoveOn, which has been urging Democratic presidential candidates not to attend. He said that the \"unwillingness of the far left to even speak with people they may disagree with is one of the worst symbols of the dysfunction in Washington today.\""]},
{"title": "Some US Venezuelans flock to GOP amid anger at Dems for lack of action against Maduro", "body": ["DORAL, Fla. -- For the first time in 60 years, South Florida’s political magnifying glass is on a country other than Cuba. The unfolding humanitarian crisis in ", " has pulled it to the forefront of the political conversation not just in the Sunshine State, but across the country.", "As the ", ", Democratic Venezuelan-Americans question whether their party’s actions go far enough. ", " say they feel forgotten by a new generation of outspoken, progressive Democrats, leaving them less beholden to a party they had long supported.", "Issues that for years were hotly debated in an area of Miami known as \"Doral-zuela\" due to its vibrant Venezuelan community, have made their way to the ears of some of the most powerful lawmakers in Washington, D.C.", "The Venezuelans are angry that, as the country continues to spiral, some Democrats keep calling on the U.S. to pull out of Venezuela and lift all sanctions against the government.", "“This is where the Democrats have consistently dropped the ball…they have never felt like it was an important issue…it's very difficult to feel and coexist in the same party that is saying these things are so ignorant about my homeland,” said Venezuelan immigrant Helena Poleo.", "Poleo attended college in the U.S. with all intentions of returning to Caracas to begin her journalism career in her family’s magazine and newspaper business, unaware that years later, in November 2017, the Venezuelan government would wedge itself between her and her dreams.", "“They denied us access to paper, they would shut down our power right at print time…it just became very hostile,” said Poleo, now president of Influence Communications, Inc. in Miami. Her family also fled to the United States and now runs the publications online from Miami.", "“We have a newsroom in Venezuela but it's been very difficult these past few days. They haven't had power, they haven't had Internet,” she said.", "Democratic Representatives Ro Khanna, Ilhan Omar and Tulsi Gabbard are ", " to recognize 35-year-old opposition leader Juan Guaidó as president of Venezuela, impose oil sanctions and refuse to rule out military action against denounced lefist-president, Nicolás Maduro.", "New York freshman congresswoman Alexandria Ocasio-Cortez, a self-proclaimed Democratic-socialist, has described U.S. strategy in impoverished Venezuela as “counterproductive,” siding with Vermont Sen. Bernie Sanders in refusing to denounce the Maduro regime, prompting harsh backlash from both sides of the political aisle.", "The U.S. was the first country to recognize Guaidó as the legitimate president of Venezuela, prompting over 60 other nations to follow suit. The United Nations continues to recognize Maduro, although it has called for talks, as roughly 50-member nations have vowed to support him, including China, Cuba, Iran, North Korea, Russia and Syria.", "“A lot of folks…are frankly taken aback by this expression of solidarity by the Left to the military regime…they wonder how it's possible,” said Cuban-American Congressman Mario Díaz-Balart, R-Miami. “If you look at Venezuela, it's hard not to understand that socialism…has destroyed it.”", "Luigi Boria, who moved to the U.S. from Venezuela with his wife and kids in 1989, agrees. He said he doesn’t understand how elected officials could come to his community of exiles, many having experienced socialism first-hand, to tout those policies.", "“This is something that's scares me coming from Venezuela…we need the United States because we love this country. This is a great country. And we came here looking for help…and we don't want that to get thrown out like what happened in Venezuela,” said Boria, the former mayor of Doral, home to the largest concentration of Venezuelans in Miami.", "But some Venezuelans are not entirely content with the Republican approach either. They said they want the president to pair tough talk abroad with action at home.", "“I think Venezuelans are confused a little bit…on the one hand, we do have sort of a tough-talking administration that seems to take this issue very seriously and they appreciate that. But on the other hand…If we are recognizing the fact that there's a crisis happening in Venezuela it seems that it would be the appropriate thing to extend some kind of protection to people who are in this country right now and not deport them back to a country that is living through what Venezuela is living through,” said Maurizio Passariello, a Venezuelan-born Democratic strategist.", "Although the Trump administration has criticized the Venezuelan regime and expressed support for its citizens, it has not granted legal status to immigrants fleeing to Florida, Texas and other states. While rare for the U.S. to grant legal status to those escaping a regime, it was granted for Cubans until 2017.", "Florida’s Republican Cuban-American Sen. Marco Rubio is working with top Senate Democrats on temporary protected status legislation.", "From 2017 to 2018, Venezuela had more U.S. asylum applications than any other country.", "Immigration from the country, which is home to 31 million people, increased by 21 percent, or almost 61,000 people, between 2016 and 2017, the largest significant increase in immigrants from one country that year, according to the Migration Policy Institute. In the last three years, over 100,000 Venezuelans have settled in Florida.", "\n      Worsening hardships in Venezuela have tightened the link between the country and its exiles in the United States.\n      ", "Poleo said those members of Congress speaking out against U.S. intervention don’t speak for the whole party, arguing South Florida’s three Democratic Congresswomen—Donna Shalala, Debbie Wasserman Schultz and Debbie Mucarsel-Powell—are among the strongest supporters of the administration’s campaign to overthrow the Maduro government. They have also been quick to distance themselves from some of the far-left Democratic lawmakers commenting on this issue.", "Shalala has insisted that Sen. Sanders’ positions were not reflective of those held by most Democrats.", "\"I'll make it clear, @SenSanders does not reflect the majority of the Democratic Party and our support for Venezuela's interim president @jguaido and the Venezuelan people,\" Shalala tweeted. \"Maduro is a dictator and must go.\"", "She and Rep. Wasserman-Schultz also traveled to the Venezuela-Colombia border, where Maduro's government had set up barriers to prevent humanitarian aid from entering the country.", "“Our local Democratic leaders have been very vocal…but the rest of the country, the Democrats seem to be very ill-informed…so they are themselves fueling this,” Poleo said.", "That position could give President Trump an edge with Latino voters in 2020 in one of the country’s largest swing states and home to its highest concentration of Venezuelans.", "Nearly 17 percent of Florida’s registered voters are Hispanic, a group that includes Venezuelans, Cubans, Puerto Ricans, Colombians and Nicaraguans, among others. In a state that Trump won by 113,000 votes in 2016, the Latino vote can make or break an election.", "The issue is already taking center stage on the 2020 campaign trail with most candidates asked about their position on the crisis. California Sen. Kamala Harris has called for free elections and humanitarian aid to be allowed in Venezuela while Sens. Kirsten Gillibrand, Cory Booker, Amy Klobuchar, along with former Vice President Joe Biden have affirmed their support of Guaidó as the legitimate leader of Venezuela.", "“This is really not about ideology…there is actually a ", " happening in Venezuela,” said Passariello. “There's a lack of medicine, there's a lack of food and an out of control refugee crisis.”", "In a ", " to a South Florida crowd of mostly political asylum-seekers, President Trump said, “The days of socialism and communism are numbered…not only in Venezuela but in Nicaragua and in Cuba, as well.”", "\n      \n      ", "“We already saw the Republicans using the socialist term against Democrats and connecting them to a regime. This is completely wrong and it's completely a wrong connection,” said Poleo. “But it's a connection that works and it's all about buzzwords. So it definitely works.”", "Still, Republicans insist their anti-socialist message will help them in 2020.", "“This could be what the ", " was for Cuban voters…This could be a one-issue situation where even if you are a Democrat you vote for a Republican because they've been supportive of this,” said Poleo, adding that Venezuelans have found a support system in South Florida’s Cuban exile community since arriving to the U.S.", "Díaz-Balart said the socialist-leaning positions of some Democrats could leave the party with the possibility of a new generation of Republican Venezuelan-Americans as the Cuban-Americans experienced in the 1960s.", "Michael Touchton, a political science professor at the University of Miami, said the political impact could last for years, even decades.", "“Just like with the Cuban-American population, I see an opportunity to take that political support for a generation or more,” said Touchton. “Many other members of Latino communities that are sympathetic…will be interested to see how this scenario is resolved or not resolved up to the 2020 election…so it might be more votes on the line than we think… these issues could reverberate well beyond the Venezuelan community.”"]},
{"title": "Beto 2020 off to a rocky start", "body": ["Democratic presidential hopeful Beto O'Rourke vows to run a 'respectful' campaign; Mike Emanuel reports from Washington.", "\n**Want FOX News Halftime Report in your inbox every day? Sign up ", ".**", " “A more disciplined candidate might not have been so sloppy, with months to prepare and adoring crowds waiting. Yet there was ", ", wobbling on policy, offending women with a joke about child care, frustrating local Democrats with his high-handedness and picking bewildering fights with the media. … O’Rourke’s liabilities began showing soon after he arrived in Iowa, the first-in-the-nation caucus state. On Friday, the second day of his campaign, the former Texas congressman was forced to apologize for what he called ‘really hateful’ writings from his youth… Hours later, O’Rourke was apologizing for ham-handedly joking about his wife, ", ", raising their children ‘sometimes with my help.’ … Yet he was still confronting his previous comments as recently as Sunday — after drawing criticism for remarks printed on the cover of Vanity Fair in which O’Rourke said before entering the race that he was ‘just born to be in it.’ … It was not a clean start to O’Rourke’s 2020 run. Though he benefited from nonstop media coverage, a blockbuster initial fundraising figure, and his own political acuity … O’Rourke’s opening act also laid bare disorder in his nascent campaign.”", " ", " “Beto O’Rourke reported raising more than $6.1 million during the first 24 hours of his presidential campaign, a record-setting haul that narrowly tops the amount announced by Sen. ", " and dwarfs everyone else in the 2020 field. O’Rourke was a fundraising juggernaut during his U.S. Senate race in Texas last year, but there were significant questions about whether that would translate to a national campaign… The answer appears to be yes. O’Rourke’s campaign said he raised $6,136,763 from donations that came from all 50 states, D.C., and every U.S. territory. ‘In just 24 hours, Americans across this country came together to prove that it is possible to run a true grassroots campaign for president — a campaign by all of us for all of us that answers not to the PACs, corporations, and special interests but to the people,’ O’Rourke said in a statement.”", " “The first time Beto O’Rourke praised ", ", it could have been dismissed as an act of diplomacy. ‘I don’t see why not,’ the newly minted presidential candidate said Friday when asked outside a campaign stop in Washington, Iowa, whether he thought Biden should run for president. ‘I think he’s done an extraordinary job for this country as senator and as vice president. … I think very highly of him.’ Then it happened again, when an Iowan in Independence told O’Rourke, who is 46, that he wanted ‘to see some young people run for president’ and would prefer that Biden — who has 30 years on O’Rourke — stay out. O’Rourke could have let the comment hang in the air, but he came immediately to Biden’s defense. And Biden was still on his mind several hours later.”", " “The Republican National Committee on Sunday tweeted out a ‘special message’ from ‘noted Irishman Robert Francis O’Rourke,’ by sending his mugshot with a leprechaun hat that was widely criticized as insensitive. O’Rourke has previously admitted to a 1998 arrest when he was 26 for drunken driving and said nothing else will come out that could be used against him during the 2020 presidential campaign. O’Rourke told supporters Sunday that there’s ‘nothing’ he hasn’t already revealed about his past that could come back to hurt his run for office. The Washington Examiner reported that several high-profile Republicans came out against the tweet. An aide for Sen. ", ", R-Ky., tweeted, ‘If you think you’re funny or clever by stereotyping and making fun of any race or nationality to score political points, you’re an idiot, and you should probably not tweet.’”", "\n“I have thought it not superfluous to give the outlines of this important portion of history; both because it teaches more than one lesson, and because, as a supplement to the outlines of the Achaean constitution, it emphatically illustrates the tendency of federal bodies rather to anarchy among the members, than to tyranny in the head.” – ", " “‘French fries’ might not be on the menu if not for ancient farmers, and not because we can now grow plenty of potatoes, but because it would be harder to enunciate the ", "sounds needed to order them. The ability to make labiodental sounds—which are sounds that require you to put your lower lip on your upper teeth, such as ", "and ", " sounds—may not have fully developed until agriculture introduced softer foods to the human diet, changing our jaws, according to an intriguing and controversial study published [on March 14] in ", ". Orthodontists know that overbite … are common among people all over the world. But the study’s authors assert that such jaw structures were rarer in the Paleolithic Period, when hunter-gatherer’s rough diets demanded more force from teeth that met edge to edge. Agriculture softened our ancestors’ diets with processed gruels, stews and yogurts, and this fare led to gradually shrinking lower jaws to produce today’s overcrowded mouths.”", " Email us at ", " with your tips, comments or questions.", "41.6 percent", " 53.8 percent", "-12.2 points", " down 1.4 points ", "\n[", ".]", " “New York Sen. ", "made official what already was well-known Sunday, formally joining the crowded Democratic field of candidates for president in 2020. ‘I’m running for president,’ she tweeted. ‘Let’s prove that brave wins.’ Gillibrand, 52, made the announcement on Twitter with a two-and-a-half- minute campaign video titled ‘The Brave.’ She discusses ‘The Star-Spangled Banner’ and urges Americans in ‘the home of the brave’ to support her and her policies. Gillibrand talks about universal health care, family leave, an end to gun violence, the Green New Deal and campaign finance changes. The video concludes with the senator saying that each generation must answer the anthem's question, whether the brave will win. … Gillibrand, one of six women in the Democratic field, launched an exploratory campaign in January. Recent polling of the field shows her garnering 1 percent or less of the vote – an important number because claiming 1 percent or more would qualify her for primary debates.”", " “With a record number of female candidates running for president, some male Democratic contenders are signaling that a woman will be on their 2020 ticket — just not at the top. Two male candidates, Senator ", " of New Jersey and Beto O’Rourke, the former Texas congressman, suggested this weekend that they would pick a woman as their vice president if they won the nomination. ‘It would be very difficult not to select a woman, with so many extraordinary women who are running right now,’ Mr. O’Rourke told reporters in Iowa on Saturday night. … Announcing the demographic profile of a potential vice-presidential pick is highly unusual, especially more than 10 months before the first round of voting takes place in Iowa. The comments reflect a desire by male candidates to show that they are not taking female voters for granted, particularly as so many women mount bids of their own for the nomination. … Issues of race and gender have already emerged as a central theme of the Democratic primary race…”", " “After watching ", " transform the judiciary over the past four years, liberals are demanding a bold response. And Democrats are listening. Sens. ", ", ", " and Kirsten Gillibrand told POLITICO they would not rule out expanding the Supreme Court if elected president, showcasing a new level of interest in the Democratic field on an issue that has until recently remained on the fringes of debate. The surprising openness from White House hopefuls along with other prominent Senate Democrats to making sweeping changes — from adding seats to the high court to imposing term limits on judges and more — comes as the party is eager to chip away at the GOP’s growing advantage in the courts. … Expanding the Supreme Court would amount to a historic power play by the next Democratic president and Congress, requiring an intense legislative fight and the abandonment of many judicial and congressional norms.”", " “Maryland Gov. ", " acknowledges that many Republicans nationwide who have heard about his potential presidential ambitions probably view him as a centrist with little hope of finding support in ", "’s GOP. But amid growing tensions between Trump and Republican lawmakers over foreign policy and the president’s treatment of global alliances, Hogan is signaling that if he decides to wage an insurgent campaign for the GOP nomination, he would pitch himself as far more in tune with the party’s long-held values and worldview than Trump. ‘I come from the ", "school of politics,’ Hogan said last week in a wide-ranging interview at the state capitol, shaking his head in disapproval when asked whether he shares Trump’s nationalism. He said groups such as the North Atlantic Treaty Organization, a frequent target of Trump’s ire, are ‘critically important.’ He expressed alarm about the way the president is ‘not standing by or standing up for some of our allies,’ and he poked fun at Trump’s competence.”", " “Amid signs that special counsel ", "'s investigation into Russian election interference may be near its conclusion, a new USA TODAY/Suffolk University Poll finds that trust in Mueller has eroded and half of Americans agree with President Donald Trump's contention that he has been the victim of a ‘witch hunt.’ Support for the House of Representatives to seriously consider impeaching the president has dropped since last October by 10 percentage points, to 28 percent. Despite that, the survey shows a nation that remains skeptical of Trump's honesty and deeply divided by his leadership. A 52 percent majority say they have little or no trust in the president's denials that his 2016 campaign colluded with Moscow in the election that put him in the Oval Office. That number does reflect an improvement from previous polls. One year ago, 57 percent had little or no trust in his denials; in December, 59 percent did. Twenty-eight percent say they have a lot of trust in former FBI director Mueller's investigation to be fair and accurate. That's the lowest level to date and down 5 points since December.”", " “President Trump on Saturday backed bipartisan calls in Congress for FBI Special Counsel Robert Mueller’s report into Russian interference in the 2016 election to be made public. ‘Play along with the game!’ the president told Republicans. ‘On the recent non-binding vote (420-0) in Congress about releasing the Mueller Report, I told leadership to let all Republicans vote for transparency,’ he tweeted. ‘Makes us all look good and doesn’t matter.’ The House voted on Thursday in support of a nonbinding resolution to encourage Attorney General ", " to release the report, amid continuing concerns in some quarters that it won't be made public. Four Republican lawmakers voted present. Since the measure is nonbinding, Mueller, Barr and Trump cannot be forced to release more information to Congress and the public than the Justice Department and federal law require.”", " - ", "- ", " - ", " - ", "- ", "\n“I try to just avoid ruling things out when there’s others who are in control. The Lord will get me to the right place.” –", "Email us at ", " and please make sure to include your name and hometown.", " “After leading police on a chase across Campus Parkway in Indiana this weekend, a runaway cow crossed over three lanes of traffic before stopping at a Chick-fil-A. With traffic halted for a short while, one driver was able to capture video of the bovine on the loose. In the video … you can see the cow cross over the highway and head down a hill toward the restaurant. A police car pulls up behind the cow shortly after it crosses. … The Noblesville Police Department had some fun with the incident, posting on Facebook that they ‘ran with the bulls’ while chasing a wild bovine all over.”", "\n“You bring criminals to justice; you rain destruction on combatants. This is a fundamental distinction that can no longer be avoided.” –"]},
{"title": "Ted Cruz, Beto O'Rourke try to rally Latino voters in Texas Senate race", "body": ["Turnout among Hispanics historically low in Lone Star state", "His legal name is Robert Francis O’Rourke, but he goes by Beto, his nickname from his childhood growing up in El Paso, Texas – a border town that is one of the most Hispanic cities in America.", "A fluent Spanish-language speaker, he occasionally sprinkles the language in his speeches and talks about inclusion and representing everyone.", "“That means going to every county in Texas, but it also means listening and speaking in English ", ",” O’Rourke, a Democrat, said during a rally at Rice University last week.", "The El Paso congressman, who is running for a U.S. Senate seat in Texas, is Irish-American but is trying to mobilize Latino voters in a Republican-leaning state with a large Hispanic population.", "“I think I have never seen something in Texas where one candidate is so popular, particularly among young people,” said Carlos Duarte, Texas state director for the non-partisan non-profit organization, Mi Familia Vota. “I think using his nickname, Beto, has really connected with Hispanics. But, I think he has also invested the time, visiting people, doing the ads targeting the Latino community.”", "\n      Democratic Congressman Beto O'Rourke says he addresses crowds in English and Spanish because he wants to make sure everyone is represented.\n      ", "One of O’Rourke’s challenges: He’s running against Cuban-American Texas. Sen. Rafael Edward Cruz, a Republican who ironically goes by his nickname, Ted, for a seat that Cruz has held since 2013.", "O’Rourke has been receiving national attention and has been called “Kennedyesque,” but experts say if he wants to stay competitive in the race he has to energize Latino voters, who in Texas have traditionally failed to show up to the polls on Election Day. A recent Quinnipiac poll shows Cruz leading the Senate race by 9 points, but O’Rourke holds a 24-point lead among Hispanic voters.", "Texas has routinely ranked near the bottom for voter turnout, and census data shows only 40 percent of Hispanics voted during the 2016 presidential election.", "“The belief [is] that the more Latinos who are not regular voters turn out, the smaller the proportion of Latino votes that Republicans [will] win,” said Mark Jones, a political science fellow at Rice University’s Baker Institute.", "Cruz has mocked O’Rourke’s effort to appeal to Latino voters, suggesting the congressman is trying to deceive them.", "\"Liberal Robert wanted to fit in, so he changed his name to Beto and hid it with a grin,\" said a Cruz campaign jingle.", "\n      Sen. Ted Cruz, who recently released a digital Spanish ad, says Hispanics in the Lone Star state are conservative. \n      ", "O’Rourke has pushed back from the criticism. Earlier this year, he released an Instagram post with a photo of him as a child wearing a sweatshirt that had his nickname, Beto.", "\"My parents have called me Beto from day one, and it's just -- it's kind of a nickname for Robert in El Paso. It just stuck,\" ", " in an interview.", "Cruz has also made an effort to appeal to Latino voters. Last Friday, he released a Spanish-language ad featuring his father’s escape from Cuba.", "But Cruz's hardline stance on immigration has turned off some Latino voters, according to Duarte.", "“Because he has this Latino last name, they think, ‘OK, so he’s Latino so I should be voting for him,’” Duarte said. “[But] they oppose a border wall, they really hate the situation of the separation and incarceration of families at the border, and definitely the support for Dreamers is in the minds of a lot of young people.”", "\n      Canvassers are hitting neighborhoods throughout Houston, reminding residents to vote. Census data shows only 40% of Hispanics voted during the 2016 presidential election. \n      ", "Duarte said O’Rourke is drawing support among Latinos because he favors a more sympathetic stance toward undocumented immigrants – he opposes the border wall and supports Dreamers.", "\"It's clear Beto is gaining a lot of ground with the Latino community,” Duarte said.", "Cruz, however, is not buying it.", "“The Hispanic community in Texas, our community, is a conservative community. The values we believe in are faith, family and patriotism,” Cruz told reporters during a rally in Houston last week.", "About 28 percent of eligible voters in Texas are Hispanic, the second largest Hispanic statewide eligible voter share nationally, according to Pew Research Center. Pew says about 21 percent of Texas' population who are Republican or lean Republican are Hispanic and 37 percent of the population who are Democratic or lean Democrat are Hispanic.", "The state’s Democratic Party said Hispanics are a part of the electorate that it is trying to reach.", "“This cycle, Latinos are the primary target for our candidates to engage with at every level of their campaigns,” party officials said.", "The Republican Party of Texas, meanwhile, said its message connects with the community.", "“[Our] pro-life, fiscally conservative message resonates,” the party said, “…not just with Hispanic voters, but with all Texans.”"]},
{"title": "Beto O'Rourke reportedly tried to flee scene before 1998 drunken-driving arrest, witness said", "body": ["According to police reports, Texas Senate Democratic nominee Beto O'Rourke tried to flee the scene after drunken crash; analysis from Fox News politics editor Chris Stirewalt.", "New details are being released about Texas Senate Democratic nominee Beto O’Rourke’s arrest 20 years ago for drunken driving, including how a witness at the time reportedly said O’Rourke attempted to flee the scene after crashing his car.", " from O’Rourke’s September 1998 DWI arrest in Texas near the New Mexico border. The records, according to the paper, indicate the incident was a “more serious threat to public safety than has previously been reported.”", "The arrest has long been public knowledge, but the details in the police reports had not.", "The police reports published by the paper state that a witness said O’Rourke was driving drunk at a “high rate of speed” in a 75 mph zone on the interstate when he lost control and hit a truck. O’Rourke’s car crossed the center median and into oncoming lanes, the police report says, though no one was injured.", "According to the paper, a witness stopped at the scene and said O’Rourke tried to drive away.", "“The driver attempted to leave the accident but was stopped by the [witness],” a police officer wrote, according to the police report.", "O’Rourke recorded 0.136 and 0.134 blood alcohol levels on Breathalyzers, the records said. The state legal limit at the time was 0.10.", "O’Rourke was arrested, but had the charges dismissed after completing a court-approved diversion program, the paper said.", "O’Rourke, in a statement released by his campaign, said Friday, “I drove drunk and was arrested for a DWI in 1998. As I've publicly discussed over the last 20 years, I made a serious mistake for which there is no excuse.\" His campaign said the arrest is something O'Rourke has long addressed.", "In a recent op-ed, O’Rourke ", " his past brushes with the law.", "“Twenty-three years ago I was arrested for attempted forcible entry after jumping a fence at the University of Texas at El Paso,” O’Rourke said. “I spent a night in the El Paso County Jail, was able to make bail the next day, and was released. Three years later, I was arrested for drunk driving,” also describing it then as “a far more serious mistake for which there is no excuse.”", "Added O’Rourke: “But those mistakes did not ultimately define me or stop me from what I wanted to do in my life or how I wanted to contribute to the success of my family and my community — as a father, small business owner, city council member, and congressman.”", "O’Rourke, a Democratic congressman, has surged in the polls in his race against incumbent Texas Republican Sen. Ted Cruz. The Cruz campaign declined to comment.", "But Texas Republicans accused O’Rourke of misleading voters about the past incident.", "“While Beto touts his honesty on his DWI arrest, we now know he has been misleading Texas voters about it all,” Republican Party of Texas chairman James Dickey said.", "Dickey added: “He has been misleading Texas voters about the costs and damages of the policies he’s promoting in his campaign, and also about true scope of this arrest. Texas voters deserve better.”", "Meanwhile, President Trump on Friday said he planned to campaign for Cruz, his former rival during the 2016 presidential race.", "“I will be doing a major rally for Senator Ted Cruz in October,” Trump tweeted. “I’m picking the biggest stadium in Texas we can find. As you know, Ted has my complete and total Endorsement. His opponent is a disaster for Texas - weak on Second Amendment, Crime, Borders, Military, and Vets!”", "While recent polls indicate that O’Rourke is closing the gap on Cruz, the Real Clear Politics polling average of the race shows Cruz with a lead of 5.5 points."]}
]