[
{"title": "Trump targets Mueller report scapegoats", "body": ["\n                In one instance cited in the redacted report, President Donald Trump apparently criticized White House counsel Don McGahn for telling Robert Mueller's investigators that Trump sought to have Mueller removed. | Chip Somodevilla/Getty Images ", "\n                        ", "\n                        A day after celebrating the Mueller report as a vindication, the president seems to be souring on its conclusions.", "\n                    By ", ", ", " and ", "\n                    Updated ", "A day after claiming that special counsel Robert Mueller’s report had vindicated him, President Donald Trump was in a foul mood about Mueller’s detailed findings, lashing out at the Russia investigator and fuming about aides who cooperated with him.", "Close White House advisers said they expect Trump’s hottest rage in the coming days will be directed at former White House counsel Don McGahn, a source of some of the report’s most embarrassing findings about the president. Trump angrily tweeted on Thursday that the report contained “total bullshit” from people trying to make themselves look good and harm the president.", "Story Continued Below", "Trump’s obvious frustration was a sign that the White House’s victory lap on the Mueller report was premature. Although Trump celebrated the fact that the report did not find a conspiracy between his 2016 campaign and the Kremlin or that he obstructed justice, Trump seemed to be blaming scapegoats for the scathing media coverage that followed the report’s release — including McGahn. ", "The president and his former top White House lawyer had a tenuous relationship even before Mueller’s report detonated over Washington on Thursday. McGahn, who left his job in October 2018", "after nearly two years, sat for roughly 30 hours of interviews with Mueller’s team and he plays a starring role in the report for his efforts to stop Trump from crossing the line into obstructing justice. One Friday morning headline capturing the capital’s post-Mueller consensus ", " that McGahn had “saved Trump from himself” — a conclusion bound to irk a news-obsessed president who resents suggestions that his aides control him. ", "“Statements are made about me by certain people in the Crazy Mueller Report, in itself written by 18 Angry Democrat Trump Haters, which are fabricated & totally untrue. Watch out for people that take so-called ‘notes,’ when the notes never existed until needed,” Trump wrote in a string of tweets from his Mar-a-Lago resort in Florida. ", "\n                                ", "The report made clear that a handful of staffers took notes of their interactions with the president including McGahn, former staff secretary Rob Porter, former chief of staff John Kelly and former deputy National Security Adviser K.T. McFarland. ", "That revelation came as a shock to some of those who spoke to the special counsel’s team, some of whom told POLITICO they did not realize their interviews would be recounted in such detail in the report for public consumption. The president's reaction also frustrated Trump associates who privately noted that they had little choice but to comply with Mueller's requests for information — and who they stressed that the White House gave them permission to participate. ", "Trump complained that he was unable to push back on the claims made by his aides in ", " because of his decision not to sit down with Mueller in person. He also suggested he was unfairly thrown under the bus by those who had spoken freely to investigators.", "“Because I never agreed to testify, it was not necessary for me to respond to statements made in the 'Report' about me, some of which are total bullshit & only given to make the other person look good (or me to look bad),” he continued in another tweet.", "He finished, with, \"This was an Illegally Started Hoax that never should have happened, a big, fat, waste of time, energy and money - $30,000,000 to be exact. It is now finally time to turn the tables and bring justice to some very sick and dangerous people who have committed very serious crimes, perhaps even Spying or Treason. This should never happen again!\"", "Trump’s missives, sent as he kicked off Easter weekend at Mar-A-Lago, are signs that he will brood over the weekend over the report’s many damaging revelations. They also suggest that ", " among his current and former aides that the report might prompt him to seek retribution were well-founded.", "Joining Trump in Florida this weekend are both his acting chief of staff Mick Mulvaney and White House counsel Pat Cipollone, neither of whom is known to have spoken to Mueller.", "The anecdotes of White House staffers who worked in close proximity with Trump are littered throughout Mueller’s report, ", " the chaos of Trump’s presidency while undercutting his claim of “total exoneration” by Mueller.", "\n                    ", "\n                    By ", "Trump advisers who spoke to Mueller’s team counter that they were bound to comply with the special counsel’s interview requests — and they note the White House signed off on their participation.", "“It’s not like somebody has a choice to cooperate,” said one of the people who sat for an interview ", "Even before he lashed out on Twitter Friday, Trump signaled privately to his aides that he was frustrated by their note-taking. ", "In one instance cited in the redacted report, which was released Thursday, the president apparently criticized McGahn for telling Mueller's investigators that Trump sought to have Mueller removed.", "\"Why do you take notes? Lawyers don't take notes. I never had a lawyer who took notes,\" Trump is quoted as saying, to which McGahn responded that a \"real lawyer\" does.", "Trump countered that he'd had \"a lot of great lawyers\" like Roy Cohn, who he argued \"did not take notes.\"", "A person close to the president said Trump was particularly annoyed by notes taken by Jeff Sessions’ then-chief of staff, Jody Hunt. Hunt captured Trump’s reaction to learning about the special counsel investigation in vivid detail. ", "“Oh my God,” the president told Sessions, according to Hunt’s notes. “This is terrible. This is the end of my Presidency. I’m fucked.”", "Since the report was released Thursday morning, several of Trump’s current aides have pushed back about how their comments were portrayed, appearing to engage in public damage control – even though their interviews with special investigators were under oath. ", "\n                    ", "\n                    By ", ", ", " and ", "Press secretary Sarah Huckabee Sanders on Friday suggested the report put words in her mouth.", "In an interview on “CBS This Morning,” Sanders was grilled over the ", " in Mueller’s report that she falsely ", " in a press briefing that “countless” FBI agents had reached out to her to express their gratitude over Trump’s 2017 firing of Director James Comey. Sanders told Mueller’s office that the use of that word was a “slip of the tongue” despite her repeated assertion she’d received such messages.", "She also told Mueller’s team that when she said during a White House press briefing that “countless” rank-and-file FBI agents had told her they’d lost confidence in Comey, she erred “in the heat of the moment.” The report concludes that the comment “was not founded on anything.” ", "Sanders said on Friday that “those were Mueller’s words,” adding: “I said that it was in the heat of the moment, meaning it wasn’t a scripted thing, it was something that I said and which is why that one word has become a big deal. But the big takeaway here is that the ", " is 100% accurate.”", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "5 unresolved mysteries about Russian meddling in Mueller’s report", "body": ["\n                Several lines of inquiry that special counsel Robert Mueller and the FBI — not to mention countless journalists and amateur internet sleuths — had been pursuing went unaddressed in the copious document.  |  Alex Wong/Getty Images", "\n                        ", "\n                        Even in a 448-page report, the special counsel left several big questions unaddressed or only partially answered. ", "\n                    By ", "Over 448 pages, special counsel Robert Mueller’s final report covered a huge amount of ground, from Trump campaign contacts with Russian operatives to President Donald Trump’s efforts to thwart Mueller’s probe.", "But while Mueller found that the Trump campaign did not conspire with the Russian government, he didn’t resolve every mystery surrounding the Kremlin’s 2016 presidential election interference scheme.", "Story Continued Below", "Several lines of inquiry that Mueller and the FBI — not to mention countless journalists and amateur internet sleuths — had reportedly been pursuing went unaddressed in the copious document. They include mysterious interactions between the Trump Organization and Alfa Bank computer servers, the inner workings of the data mining firm Cambridge Analytica, and influence-peddling by Middle Eastern countries targeting Trump’s fledgling administration. Other avenues, like whether compromising tapes exist of the president and what a Russian oligarch did with the internal Trump campaign polling data he was given, were left open-ended.", "It’s possible that some or all of these topics are being examined by federal prosecutors independent of Mueller’s office. Mueller revealed in his report", "that foreign intelligence and counterintelligence information was often transferred to FBI headquarters or field offices. Mueller also made 14 criminal referrals", "to the Justice Department and the bureau. Only two of those referrals — involving Trump’s former personal lawyer Michael Cohen and former Obama White House counsel Greg Craig — are publicly known.", "Sign up today to receive the #1-rated newsletter in politics", "By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.", "It seems clear that none of those subplots prompted Mueller’s team to bring criminal charges. But while Mueller’s original mandate directed him to pursue both a counterintelligence investigation and a criminal probe, his report contains no classified information, leaving unknown to the public anything he might have discovered in that category.", "Here are five of the biggest unresolved subplots of the Russia investigation:", " ", "Even before Mueller was appointed, the FBI was examining why a computer server for Alfa Bank, Russia’s largest commercial bank — led by oligarchs with close ties to Russian President Vladimir Putin — had thousands of contacts with a server used by the Trump Organization between May and September 2016. A Slate report on the contacts based on research by computer scientists caused an online sensation just days before the election, until The New York Times ", " that the FBI had concluded there could be what the paper called an “innocuous explanation” for the activity, like a marketing email or spam.", "Many independent cybersecurity researchers and experts, many of whom worked at senior levels in the Pentagon, White House and intelligence community, have continued to insist that the timing and frequency of the server activity was not consistent with an automated process. “The timing of the communication was not random, and it wasn’t regular-periodic,” one researcher ", " the New Yorker in October. “It was a better match for human activity.”", "Innocuous or not, the server activity is not addressed in the Mueller report at all. The only discussion of Alfa Bank comes within the context of efforts by its CEO, Petr Aven, to connect with the Trump transition team in December 2016. Those efforts apparently were unsuccessful, according to Mueller, which may have led the special counsel’s office to dismiss the computer server activity as inconsequential. But there’s still no conclusive explanation for the pinging or why the Trump domain that Alfa was contacting abruptly disappeared two days after The New York Times", "notified Alfa’s representatives in Washington of the server activity. ", "One of the biggest subplots of the investigations into Russian election interference is the role the data mining firm Cambridge Analytica. But the company didn’t appear once in the report, despite indications that Mueller had questioned and subpoenaed former employees.", "The Trump campaign hired Cambridge Analytica in summer 2016, and the company played a key role in trying to sway voters using pilfered Facebook data.", "Beginning in 2014, Aleksandr Kogan, a Russian-American who worked at the University of Cambridge, helped the firm harvest the raw data of up to 87 million Facebook profiles, which the company then used to microtarget political ads. There’s a WikiLeaks connection, too: Alexander Nix, the company’s CEO, has acknowledged reaching out to WikiLeaks founder Julian Assange in summer 2016 to offer help organizing any Hillary Clinton-related emails WikiLeaks planned to release.", "Mueller subpoenaed Brittany Kaiser, the former business development director for the firm, earlier this year. She told The Guardian that she was fully cooperating. Sam Patten, a Washington-based operative who began cooperating with Mueller’s probe last year after pleading guilty to an unrelated charge, worked at the Oregon office of Cambridge Analytica’s parent company, SCL Group, in run-up to the 2014 midterm elections. And Mueller quizzed several digital experts who worked on Trump’s campaign about the big-data firm, according to ABC. ", "Like the server activity, however, Cambridge Analytica is not mentioned at all in Mueller’s report. Therefore, it is still unclear what, if anything, the company knew about WikiLeaks’ plans or whether its microtargeting efforts were coordinated with the Russian’s information warfare campaign. ", " Intriguingly, though, much of the portion of Mueller’s report dealing with Russia’s Internet Research Agency — which tasked internet trolls with spreading disinformation and propaganda during the presidential election — was redacted in the final report because of potential harm to ongoing investigations.", "\n                    ", "\n                    By ", "Since the 2016 presidential election, there have been numerous but vague data points indicating the Russians might be trying to infiltrate the National Rifle Association as a way to connect with Republicans and Trump’s campaign.", "Mueller’s report, however, didn't shed any light on the subject, despite media reports that the special counsel was poking around on the subject.", "The first indication of Mueller’s interest in the potential ties came earlier this year, when former Trump campaign adviser Sam Nunberg told CNN the special counsel’s team had asked him about the campaign’s relationship with the NRA and the circumstances of a Trump speech to the group in 2015. The investigators continued asking witnesses about the campaign’s ties to the NRA as recently as December, according to CNN.", "And July’s indictment of Mariia Butina, a Russian national who sought to infiltrate both the Trump campaign and the NRA before the election, also raised questions about the group’s status as a potential intermediary between Trump and the Russians. Butina was charged with acting as an agent of a foreign government without notifying the Justice Department.", "Butina was the first person to ask Trump in public about his position on Russian sanctions — during a 2015 event in Las Vegas — and tried to broker a meeting between Trump and her Russian handler, Alexander Torshin, at an NRA convention in May 2016.", "McClatchy later reported that FBI counterintelligence investigators were investigating whether Torshin laundered money from Russia through the NRA to help fund Trump’s campaign — the NRA spent $30 million to support Trump in 2016, triple what it spent supporting Mitt Romney in 2012.", "Despite the investigators’ interest, however, the gun rights group was not mentioned a single time in Mueller’s report. And Butina's case was handled by prosecutors in Washington, not Mueller’s team.", "Mueller did answer one lingering question about Russian election hacking — how Kremlin agents got their digitally pilfered emails to WikiLeaks.", "But he didn’t address the potentially more damning question: Did WikiLeaks know it was getting the material from Russian cutouts?", "In his report, Mueller outlined in detail how Russia’s military intelligence agency, the GRU, hacked Democrats during the campaign. Between March and April 2016, the report said, “the GRU stole hundreds of thousands of documents from the compromised email accounts and networks” and disseminated them both through GRU agents posing as independent hackers — including Guccifer 2.0 and DCLeaks — and WikiLeaks.", "According to Mueller's report, the GRU used those fake online personas to shuttle some of its stolen cache to WikiLeaks. Through DCLeaks, the GRU initiated a conversation with WikiLeaks about transferring stolen documents on June 16, 2016. Eight days later, WikiLeaks reached out to Guccifer 2.0 via Twitter and asked for “any new material.”", "Mueller noted that Assange and WikiLeaks tried to obscure the source of the hacked materials by claiming in public statements that the DNC hack was an \"inside job\" carried out by Seth Rich, a murdered committee staffer, rather than Russia.", "But the special counsel’s office either wouldn’t or couldn’t explain what WikiLeaks knew about the true identity of the hackers.", "“Both the GRU and WikiLeaks sought to hide their communications, which has limited the Office's ability to collect all of the communications between them,” the report said, pointing to their use of encryption.", "That information could be relevant to determining whether WikiLeaks acted in a journalistic capacity, as Assange has maintained, or as a “non-state hostile intelligence service” abetted by Russia, as then-CIA Director Mike Pompeo claimed in April 2017.", "Assange was arrested in London earlier this month after Ecuador withdrew his asylum. He faces U.S. criminal charges for allegedly trying to help former U.S. intelligence analyst Chelsea Manning crack into a computer storing sensitive government files in 2010. ", "\n                    ", "\n                    By ", " Perhaps no element of the Trump-Russia scandal was as sensational as the claim, contained in an unverified dossier assembled during the campaign by former British spy Christopher Steele, that the Russians had \"kompromat\" on Trump in the form of video of him cavorting with prostitutes in a Moscow hotel room. ", "Although the alleged tape has consumed vast public attention over the past two years, Mueller mentions it only briefly. His report states that Russian businessman Giorgi Rtskhiladze texted then-Trump lawyer Michael Cohen on Oct. 30, 2016 and said: \"Stopped flow of tapes from Russia but not sure if there’s anything else. Just so you know .... \" Rtskhiladze told investigators that “tapes” referred to derogatory tapes of Trump rumored to be in the possession of the Agalarovs—a Russian-Azerbaijani family that hosted the Miss Universe pageant in Moscow in 2013.", "Rtskhiladze told Mueller that he believed the tapes were fake. But for whatever reason, he didn’t tell that to Cohen, according to the report. Mueller does not draw a conclusion one way or the other. It remains unclear who might have been creating or disseminating such tapes, what their motive might have been — and whether anyone on Mueller’s team ever saw one or more of them.", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "Mueller whacks Trump with evidence of obstruction", "body": ["\n                POLITICO Illustration/Getty Images", "\n                        ", "\n                    By JOSH GERSTEIN and ", "\n                    Updated ", "Special counsel Robert Mueller's long-awaited report is more damning than President Donald Trump has publicly claimed, detailing Trump's aggressive efforts to interfere in the Justice Department's Russia probe and declining to rule out that Trump obstructed justice.", "Far from the “complete and total exoneration” the president has declared in recent weeks, the report depicts a president who made repeated moves to thwart the investigation into his campaign and presidency, possibly because Trump was trying to hide other, potentially criminal behavior — although Mueller found no evidence of a criminal conspiracy to help Russia influence the 2016 election.", "Story Continued Below", "The report, which riveted Washington Thursday, recounts Trump's repeated attempts to fire Mueller and his anger when those efforts became public. It also details an effort to pressure staffers to send an email exonerating him and notes that the president had more knowledge of an aide’s potentially criminal behavior than he may have let on. ", "One implication of the report is that Trump may have escaped a finding that he obstructed justice only because his top aides refused to carry out his most dramatic orders. Indeed, Mueller’s team describes several of Trump's actions as satisfying all the legal elements of obstruction.", "The 448-page report is the culmination of a nearly two-year-long investigation that has cast a shadow over Trump’s time in office as questions swirled around whether Trump’s campaign conspired with Moscow intermediaries to sway the 2016 election, and whether the president tried to impede an investigation into the matter.", "\n                                ", "While the exhaustive document confirms that Mueller found no conspiracy between Trump’s campaign and the Kremlin, it contains numerous unfavorable observations regarding potential obstruction of justice and sheds light on why the special counsel chose to neither exonerate Trump nor conclude that he committed a crime. ", "Perhaps most notably, Mueller’s prosecutors said that while Trump seemed confident the FBI would not uncover a conspiracy between his campaign and Moscow, he was still concerned about what else they might find. Among his anxieties were the ongoing attempts during the 2016 campaign to seek business in Russia, including an attempt to build a Trump Tower in Moscow.", "“The evidence does indicate that a thorough FBI investigation would uncover facts about the campaign and the President personally that the President could have understood to be crimes or that would give rise to personal and political concerns,” the report states. ", "The passage could speak to Trump’s intent when he took several actions that investigators and some of his own aides flagged as potential attempts to impede the authorities. ", "In recent weeks, Attorney General William Barr has emphasized Trump’s intent as he explained his decision to not pursue an obstruction case against the president, even though Mueller chose not to make such a definitive conclusion.", "“It is important to bear in mind the context,” Barr said at a Thursday morning press conference. “There was relentless speculation in the news media about the president’s personal culpability,” Barr added. “Yet, as he said from the beginning, there was in fact no collusion.”", "\n                                ", "Mueller’s team seemed far less definitive about Trump’s mindset regarding potential obstruction.", "“If we had confidence after a thorough investigation of the facts that the President clearly did not commit obstruction of justice, we would so state. Based on the facts and the applicable legal standards, however, we are unable to reach that judgment,” the report says in a 182-page section dedicated to obstruction.", "“Accordingly, while this report does not conclude that the President committed a crime, it also does not exonerate him,” it continues.", "The passage is particularly notable as it contains the full context of a line Barr used in an initial March 24 letter he released summarizing the principal conclusions of Mueller’s report. Barr chose only to include a portion of the final sentence, frustrating Democrats, some former DOJ officials and even some on Mueller’s team, who felt that the selective editing narrowly presented the special counsel’s findings.", "Barr also proactively announced in his March letter that he would not bring an obstruction case against the president, further irritating Democrats.", "Mueller’s report leaves open the possibility that Trump could at least in theory face prosecution for criminal acts after he leaves office. Mueller’s prosecutors decided, therefore, that a criminal investigation of the president was appropriate.", "However, Mueller’s team said making a decision about whether crimes were committed would have gone too far. Long-standing DOJ legal guidance dating to Watergate says a sitting president can’t be indicted.", "In a lengthy analysis, the report explains that claiming the president obstructed justice without the ability to charge him would taint his presidency and damage his ability to govern — leaving him with no legal recourse to clear his name or protections normally afforded to criminal defendants.", "“Fairness concerns counseled against potentially reaching that judgment when no charges can be brought,” the report says.", "\n                    ", "\n                    By ", ", ", ", ", " and ", "Still, the report details a number of incidents of presidential meddling that Mueller and even Trump’s own aides found troubling. ", "The obstruction section is one of the less-redacted sections in a report that includes 954 total redactions, mostly centered on withholding secret grand jury material and information that could harm ongoing investigations. In total, 40 percent of pages have at least one redaction, although only 14 percent of the obstruction pages have blacked out passages.", "The obstruction section unveils new details about a much-scrutinzed discussion Trump had with former FBI Director James Comey. According to Comey, Trump leaned on him to drop an investigation into one-time national security adviser Michael Flynn regarding an untruthful interview with the FBI.", "The Mueller report says when that conversation occurred, Justice Department officials had already told White House counsel Don McGahn that Flynn’s conduct could be considered unlawful, and that McGahn related that information to the president.", "The report also says that Trump repeatedly directed McGahn to dissuade Attorney General Jeff Sessions from recusing himself from the Trump-Russia probe, given his integral role in the Trump campaign.", "“McGahn continued trying [on] behalf of the President to avert Sessions’ recusal by speaking to Sessions’s personal counsel, Sessions’s chief of staff and Senate Majority Leader Mitch McConnell, and by contacting Sessions himself,” Mueller’s team wrote.", "After the recusal was announced, Trump pulled Sessions aside during a weekend visit to Mar-a-Lago and suggested he “unrecuse,” the report says.", "\n                    ", "\n                    By ", ", ", " and ", "Trump's ire for McGahn is apparent in several of the document’s passages. One section recounts that after The New York Times reported that Trump had requested McGahn fire Mueller, the president few into a rage, calling McGahn a “lying bastard” in a conversation with White House staff secretary Rob Porter. Trump demanded that McGahn write a letter denying the firing request, but McGahn declined.", "Indeed, the report recounts at least two occasions in June 2017 when Trump asked McGahn to order that DOJ dismiss Mueller.", "Trump said firing Mueller was justified because of what the president considered conflicts of interest, like an alleged dispute related to Mueller’s membership in a Virginia golf club Trump acquired and issues raised by Mueller being briefly considered for a Trump nomination as FBI director. ", "McGahn told Mueller’s office that he viewed those supposed conflicts as “silly” and “not real,” and resolved not to carry out Trump’s directive. After a second phone call from Trump in one day about the issue, McGahn began to take steps to resign, the report says. “McGahn recalled feeling trapped. ... McGahn decided he had to resign,” Mueller’s team wrote. “He then drove to the office to pack his belongings and submit his resignation letter.” ", "While McGahn was talked out of resigning at that point, he eventually left the administration in October 2018.", "The report also said Trump once dressed down McGahn for his note-taking practice. “What about these notes? Why do you take notes? I never had a lawyer who takes notes,” the president declared, according to McGahn.", "McGahn said he replied that he keeps notes because he’s a “real lawyer,” the report says.", "Trump also once tried to get a senior adviser to send an email insisting that he had not ordered Flynn to discuss economic sanctions with the Russian ambassador to the U.S. during the presidential transition period.", "Questions have long lingered about how much involvement Trump had in the incident, which Flynn later pleaded guilty to lying about to the FBI amid questions about whether the incoming Trump administration was seeking to undermine economic penalties the Obama administration had just imposed on Moscow.", "According to Mueller’s report, Trump asked his chief of staff, Reince Priebus, to get Flynn’s deputy, K.T. McFarland, to “draft an internal email that would confirm that the President did not direct Flynn to call the Russian Ambassador about sanctions.”", "“MacFarland told Priebus she did not know whether the President had directed Flynn to talk to [the Russian ambassador] about sanctions, and she declined to say yes or no to the request.”", "\n                                ", "McFarland and another official considered the request “sufficiently irregular” to document it and raise concerns about it, the report says.", "Mueller's team concluded that some of Trump's suspect actions seemed to have multiple motivations, which made it difficult to conclude whether the president had corrupt intent when he took certain steps, like firing Comey in May 2017.", "“Evidence indicates that the President was angered by both the existence of the Russia investigation and the public reporting that he was under investigation, which he knew was not true based on Comey’s representations,” the report says. “Other evidence indicates that the President was concerned about the impact of the Russia investigation on his ability to govern.”", "Mueller’s report found that the initial explanation Trump and the White House gave for firing Comey was “pretextual” and that Trump had already decided to fire Comey before Justice Department officials like Deputy Attorney Rod Rosenstein weighed in with critiques of Comey’s actions during an investigation into Hillary Clinton’s use of a private email server.", "The report also indicates that Rosenstein provided information to Mueller’s team that may have been unhelpful to Trump.", "After White House officials asked the Justice Department to issue a statement saying it was Rosenstein’s idea to fire Comey, the deputy attorney general told aides that he wouldn’t put out a “false story,” according to the report.", "Trump then called Rosenstein directly and urged him to hold a press conference about his role in the firing. “Rosenstein responded that this was not a good idea, because if the press asked him, he would tell the truth that Comey’s firing was not his idea,” the report says, citing accounts from Rosenstein and another DOJ lawyer.", "Although Trump eventually conceded that he decided to fire Comey before getting those recommendations, “he did so only after DOJ officials made clear to him that they would resist the White House’s suggestion that they had prompted the process that led to Comey’s termination,” the report states.", "Mueller’s report also addresses a major question that has lingered since the public got the first glimpses of his findings in late March — why the special counsel’s team didn’t push for an interview with the president. The question took on greater importance Thursday morning, when Barr emphasized at a news conference that he believed Trump’s intent was critical to determining whether the president was trying to stymie the Russia probe with his actions.", "“We also sought a voluntary interview with the President. After more than a year of discussion, the President declined to be interviewed,” Mueller’s team wrote. Just after that statement, however, a portion of the report was redacted on grand jury secrecy grounds.", "\n                    ", "\n                    By KATIE GALIOTO", "Trump ultimately agreed to answer written questions on Russia topics, but declined to answer questions about “obstruction topics” or about the transition period.", "“Ultimately, while we believed that we had the authority and legal justification to issue a grand jury subpoena to obtain the President’s testimony, we chose not to do so,” the report states. “We made that decision in light of the substantial delay that such an investigative step would likely produce at a late stage in our investigation.”", "Mueller’s team also felt it had “sufficient evidence to understand relevant events and to make certain assessments without the President’s testimony,” according to the report.", "Mueller’s investigators faced challenges along the way, including unnamed individuals who invoked their Fifth Amendment right against self-incrimination. Witnesses also gave false testimony, leading to some charges. It also “faced practical limits” on getting information and documents from “numerous witnesses and subjects” who live outside the U.S. ", "Some individuals, including some on the Trump campaign also “deleted relevant communications” or used encrypted apps to shield their chatter. ", "The Mueller probe will live on in various incarnations. ", "The report includes an index listing 14 cases in all that the special counsel saw as outside the scope of its jurisdiction but worth a referral to other law enforcement officials. Two cases are public — one involving former Trump personal attorney Michael Cohen and another involving Greg Craig, the former Obama White House counsel charged earlier this month with violating foreign lobbying requirements. ", "The other 12 cases are redacted with no information released publicly.", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "Barr v. Mueller: Friends pitted against each other", "body": ["\n                Tensions between Attorney General William Barr and special counsel Robert Mueller are only going to get more pronounced when the two men are summoned to testify separately on Capitol Hill about the turbo-charged Russia investigation. | Tasos Katopodis/Getty Images", "\n                        ", "\n                        Despite close ties, the attorney general and special counsel face increasing scrutiny of their disagreements on the Trump probe.", "\n                    By JOSH GERSTEIN and ", "Bill Barr and Robert Mueller have been close friends for 30 years, from the Justice Department to family weddings and the Bible study attended by both of their wives.", "Now they’re anchoring two ends of a legal high-wire act playing out through news conferences, congressional hearings and close-up reviews of the special counsel’s long-awaited findings on Russian interference in the 2016 presidential election.", "Story Continued Below", "The bond between the two men has been stressed over the past month amid a volley of letters and closed-door negotiations among their aides. Finally, on Thursday, the release of Mueller’s final report showcased the large amounts of daylight between the veteran law enforcement officials on fundamental questions at the heart of Donald Trump’s presidency.", "“We don't go through this process just to collect information and throw it out to the public,” Barr said with evident frustration, referring to Mueller’s ", " which failed to make a conclusive finding on whether Trump obstructed justice. “Because the special counsel did not make that decision, we felt the department had to. That was a decision by me and the deputy attorney general.”", "Now, the tension between Barr and Mueller is only going to increase when the two men are summoned to testify separately on Capitol Hill about the turbo-charged Russia investigation that consumed Trump’s first two years in office. Democrats are intent on uncovering any evidence that Barr shaded the public disclosure of Mueller’s findings to favor the president who appointed him.", "Differences in how the attorney general and special counsel came at the Russia probe and interpret its findings are apparent on many levels.", "Sign up today to receive the #1-rated newsletter in politics", "By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.", "First there’s the rhetoric. Barr in Thursday’s news conference four times adopted the same “no collusion” mantra that Trump has used obsessively since the Mueller investigation started. It’s language that stands in sharp contrast to Mueller, whose report ticks through a stream of interactions between Trump, his family, aides and allies and Russians interested in cultivating a rookie Republican politician mounting a long-shot bid for the White House. ", "The only references the special counsel makes to “collusion” come in an attempt to explain how the term is hardly the accurate legal one but instead should be thought of in the context of a conspiracy.", "Barr, in his much-criticized news conference, also defended Trump and reiterated his “sincere belief that the investigation was undermining his presidency.” Mueller, by contrast, offered in his report a methodical run-down of all the evidence that his prosecution team unearthed during a nearly two-year investigation, calling out Trump aides for giving misleading testimony and deleting records to block the investigation.", "More than anything, though, the contrast between Barr and Mueller centers primarily around whether Trump committed obstruction of justice — and whether the attorney general ", " the special counsel’s views on the subject in his ", " to Congress last month and then again Thursday during the press event.", "At the news conference, Barr declared that Trump’s White House “fully cooperated” with Mueller’s probe.", "Mueller’s report, however, made it clear that Trump himself did not submit to a sit-down interview and, in negotiated written questions, declined to answer questions about obstruction of justice.", "While there have been hints for weeks that Barr and Mueller did not see eye-to-eye on the Trump-Russia case, Barr publicly confirmed the disconnect with Mueller at the news conference when Barr said he and Deputy Attorney General Rod Rosenstein “disagreed” with some of the special counsel’s legal theories underlying the obstruction investigation.", "\n                    ", "\n                    By ", " and ", "Some of the 10 episodes Mueller specifically examined didn’t amount to crimes “as a matter of law,” Barr said.", "But Mueller’s report made no findings on Trump’s legal culpability, explaining that the special counsel was adhering to longstanding Justice Department ", " ", " that a sitting president could not be indicted. Mueller’s lengthy analysis went on to say that claiming the president obstructed justice without the ability to charge him would taint his presidency and damage his ability to govern — leaving him with no legal recourse to clear his name or protections normally afforded to criminal defendants.", "But that series of caveats is notably surrounded by multiple examples of potential obstruction by Trump, including urging Attorney General Jeff Sessions to reverse his decision to recuse himself from overseeing the investigation; pressing then-White House Counsel Don McGahn to fire Mueller; and communicating through back channels his appreciation for loyalty to key investigative targets like Michael Flynn, Paul Manafort and Michael Cohen. ", "“If we had confidence after a thorough investigation of the facts that the President clearly did not commit obstruction of justice, we would so state,” the Mueller report said. “Based on the facts and the applicable legal standards, however, we are unable to reach that judgment. …Accordingly, while this report does not conclude that the President committed a crime, it also does not exonerate him.”", "Barr, however, insisted at his news conference that Mueller had “made it very clear several times” that the Justice Department’s guidance on charging a president wasn’t what stopped Mueller from concluding that Trump had committed a crime. ", "“He was not saying that but for the [Justice Department] opinion, he would have found a crime. He made it clear that he had not made the determination that there was a crime,” Barr explained.", "Barr also rejected the idea that Mueller in his report was all along angling to send his findings to Congress for it to consider impeachment proceedings.", "“I hope that was not his view, since we don't convene grand juries and conduct criminal investigations for that purpose. ", " I didn't talk to him directly about the fact that we were making the decision, but I am told that his reaction to that was that it was my prerogative as attorney general to make that decision,” the attorney general said.", "\n                    ", "\n                    By POLITICO STAFF", "Some former officials who know both Barr and Mueller expressed disappointment Thursday in Barr’s decision to present what they viewed as a skewed version of Mueller’s findings.", "“The attorney general only talked about stuff favorable to the president and that struck me as odd and it did strike me as a tactic,” a former U.S. attorney who knows both men, Chuck Rosenberg, said on MSNBC Thursday. “We need to see what Mueller said, not the characterization of what Mueller said by the attorney general. That was a tactic. He did employ it. It's disappointing to me, but not terribly surprising.”", "Barr arguably cast the first stone in the conflict between the two men nearly a year ago by writing an unsolicited ", " attacking the notion that Trump could be guilty of obstruction of justice for any efforts to end the investigation into potential collusion between the Trump campaign and Russia.", "The June 2018 missive sent to Rosenstein argued that the obstruction case against Trump was so weak — and the legal theory for accusing the president of obstruction so flawed — that Mueller’s team should not even be permitted to demand an interview with Trump.", "“Mueller’s obstruction theory is fatally misconceived,” Barr declared in his broadside, which he also circulated to more than a dozen other prominent lawyers across Washington. Barr argued that only acts such as witness tampering and destruction of evidence could amount to obstruction by the president, but actions stemming from his constitutional authority to end an investigation or replace its overseer could not.", "Barr, who previously served as attorney general in the George H.W. Bush administration, went even further in the memo, contending that if there was no conspiracy between the Trump campaign and Russia, the president could not be guilty of obstruction of justice and therefore Mueller should not be able to press that issue further.", "“The president’s motive in removing [FBI Director James] Comey and commenting on [the inquiry into former National Security Adviser Michael] Flynn could not have been ‘corrupt’ unless the President and his campaign were actually guilty of illegal collusion,” the once and future attorney general wrote. “Either the President and his campaign engaged in illegal collusion or they did not … If they did not, then the cover up theory is untenable.”", "Mueller’s report appears to reject that conclusion, stating that statutes do not require the existence of an underlying crime to prosecute someone for obstruction of justice.", "“I don’t think the Mueller report reflects either the view that public officials cannot obstruct justice through official acts or that obstruction of an investigation into something that isn’t unlawful isn’t obstruction,” said University of Texas law professor Stephen Vladeck, summarizing points Barr made in his 2018 memo. “The contrary, I read the Mueller report as suggesting that both of the opposite things are true … but I do think the report was written with this fight about obstruction in mind, partly because of Barr and partly because that argument about obstruction has been out there a while.”", "Barr did acknowledge in his 2018 memo that he did not have all relevant facts about the investigation, which could give him a chance to say his views have evolved or are now more informed. But there was no sign Thursday he plans such a shift. In addition, the legal conclusions he articulated before becoming attorney general were so sweeping that they seemed to dismiss thousands of hours of work Mueller’s team had invested in their inquiry.", "During Barr’s confirmation hearing in January, he didn’t shy away from talking about his personal relationship with Mueller — a sore spot with Trump considering the president had been firing direct Twitter broadsides at the special counsel for months.", "In his testimony, Barr said he and his wife were close to Mueller and his wife. Barr added that when he met with Trump briefly in 2017 about possibly becoming a personal lawyer for the president, Trump asked about his relationship with Mueller, and Barr replied that he and his wife “would be good friends” with the Muellers long after the probe concluded.", "Despite that exchange, Barr’s talk at the confirmation hearing about his friendship with Mueller startled Trump as he watched the session on TV, ", ".", "At the Senate hearing, Barr also seemed to downplay his June 2018 memo, saying it didn’t challenge Mueller’s “core investigation.” The then-nominee also went on to say he wouldn’t rule out subpoenaing Trump before a grand jury if Mueller asked to do so.", "“I don’t know what the facts are,” Barr said then. “If there was a factual basis for doing it and I couldn’t say that it violated established policies, then I wouldn’t interfere, but I don’t know what the facts are.”", "But there have been clear indications in recent weeks of more distance between Barr and Mueller than what one might expect given their professional and personal history.", "Mueller was notably absent from Barr’s announcement Thursday. Instead, the attorney general was flanked by Rosenstein and an aide who helped oversee Mueller’s probe, Ed O’Callaghan. Peter Carr, a spokesman for Mueller, declined comment when asked whether the special counsel had even been invited to the event.", "At the news conference, Barr said he and Mueller had not spoken about the attorney general’s decision to issue a public conclusion that Trump wasn’t guilty of a crime, even though Mueller explicitly refrained from making such a declaration.", "“I didn't talk to him directly about the fact that we were making the decision, but I am told that his reaction to that was that it was my prerogative as attorney general to make that decision,” Barr said.", "A Justice Department official who spoke on background said there had been little contact between the two men in the past two months. The only direct interaction Barr mentioned was on March 5, when Mueller gave the new attorney general an update on the special counsel investigation. Mueller informed Barr and Rosenstein that he planned to close the investigation without resolving whether Trump obstructed justice, the official said.", "“Barr and Rod were both surprised,” the official said. “It was unexpected.”", "On Capitol Hill, the hearings on the Mueller report seem unlikely to produce a face-to-face confrontation between the attorney general and the special counsel. Still, Democrats are likely to zero in on whether Barr mischaracterized Mueller’s finding when the attorney general comes to Capitol Hill for back-to-back Senate and House hearings set for May 1 and May 2.", "House Judiciary Committee Chairman Jerry Nadler (D-N.Y.) leapt on the differences between Mueller and Barr, noting that the special counsel’s report said a “thorough FBI investigation would uncover facts about the campaign and the President personally that the President could have understood to be crimes or that would have risen to personal and political concerns.”", "But Barr “excluded this critical finding from his version of events,” said the New York Democrat, who on Thursday sent a letter to Mueller inviting him to testify by May 23.", "For his part, Barr said Thursday he had no objection to Mueller appearing before lawmakers. Mueller’s spokesman declined comment when asked whether the special counsel — who assiduously shunned the spotlight during his nearly two-year tenure — plans to accept Nadler’s invitation to testify.", "One way for the Trump team to try to defuse or smooth over any tension between the two men may be to suggest that Mueller’s report is not as much the definitive view of the former FBI director as a compendium of the conclusions of his aides — the hard-charging prosecutors Trump has branded as “13 Angry Democrats.”", "One prominent lawyer close to Trump and Barr took that tack Thursday, saying that during Mueller’s tenure at the Justice Department he had a reputation for allowing his staff more leeway in drafting official memos and legal documents than other senior officials did.", "“Mueller doesn’t always control the pen as heavily as other officials might,” said the attorney, who said some lines in the report seemed “a little out of character” for the veteran prosecutor and ex-FBI chief.", "“I just assume some people on his team felt strongly and he wasn’t going to take them out,” added the Trump adviser, who requested anonymity.", "Rudy Giuliani, one of the president’s personal attorneys, said one difference he can see between Mueller and Barr centers on “how do you legally assess or interpret the situations that are alleged to be obstruction?” ", "“And I think that Barr has the classic approach to obstruction and I think some of Mueller’s staff have a much more expansive notion of it, which they may actually believe or they may be contorting because they’re pretty desperate to get the president,” the former mayor of New York said.", "Glenn Kirschner, who worked as a homicide prosecutor under Mueller in the U.S. attorney’s office in Washington D.C., predicted that the special counsel would eventually spell out his differences with Barr before Congress.", "“Mueller is not the kind of guy who is going to stand up at a press conference and disagree with the attorney general. He’s going to wait. He’s going to bide his time,” Kirschner said. “He will not let injustice stand. … He’ll set the record straight. All things in time.”", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "Trump lashes out at Romney  ", "body": ["\n                Mitt Romney is one of the few GOP senators who have expressed disappointment in President Donald Trump after the release of the special counsel's report. | Carolyn Kaster, File/AP Photo", "\n                        ", "\n                    By ", "President Donald Trump on Saturday ridiculed Sen. Mitt Romney for his loss to former President Barack Obama in 2012 — one day after Romney said he was “sickened” by Trump’s actions as detailed in special counsel Robert Mueller’s report.", "“If @MittRomney spent the same energy fighting Barack Obama as he does fighting Donald Trump, he could have won the race (maybe)!” Trump ", ". ", "Story Continued Below", "Attached to the president’s post was a 40-second video contrasting election night footage and CNN news coverage from Romney’s White House loss 6½ years ago to Obama with Trump’s victory over Hillary Clinton in 2016. It was unclear whether the White House produced the brief clip, or if it was crafted by one of the president’s supporters.", "The Utahan is one of the few Republican senators who have expressed disappointment in the president after the release of a redacted version of Mueller’s report by Attorney General William Barr on Thursday. ", "Sen. Susan Collins (R-Maine) ", " that the special counsel’s findings offered “an unflattering portrayal of the president,\" and Sen. Rob Portman (R-Ohio) ", " that the 448-page report “documents a number of actions taken by the president or his associates that were inappropriate.”", "\n                    ", "\n                    By ", "But Romney was harsher in his criticism than his GOP Senate colleagues, ", " Friday that he was “sickened at the extent and pervasiveness of dishonesty and misdirection by individuals in the highest office of the land, including the President.” ", "The Utah senator also said he was “appalled” that individuals associated with Trump’s 2016 campaign “welcomed help from Russia” — which Romney was roundly dismissed for naming as America’s greatest geopolitical foe during a 2012 debate with Obama.", "Romney's and Trump’s weekend swipes are the latest in a yearslong series of rhetorical barbs exchanged between the Republican Party’s two most recent presidential nominees.", "Romney was critical of Trump’s candidacy throughout the 2016 White House race, prompting Trump to ", " in June of that year that Romney “choked like a dog” against Obama in 2012.", "In January 2019, two days before Romney was set to be sworn in as Utah’s junior senator, he wrote in an ", " for The Washington Post that Trump “has not risen to the mantle” of his office and that the president’s “words and actions have caused dismay around the world.”", "\n                    ", "\n                    By ", "Trump responded less than 24 hours later on Twitter, ", " that he would “prefer that Mitt focus on Border Security and so many other things where he can be helpful. I won big, and he didn’t. He should be happy for all Republicans. Be a TEAM player & WIN!”", "Despite the mutual enmity, Romney — a former governor of Massachusetts — was reportedly ", " to become secretary of State. He dined with the president-elect in November 2016.", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "Trump allies assail Mueller report even as they defend its conclusions", "body": ["\n                Trump attorney Rudy Giuliani denounced special counsel Robert Mueller's investigation as \"one-sided\" and \"infected\" with bias. | Drew Angerer/Getty Images", "\n                        ", "\n                    By ", "\n                    Updated ", "President Donald Trump’s allies fanned out in his defense on Sunday, taking a confrontational stance about the Mueller report and maintaining that even though the report did not lead to the president’s indictment, it was biased and built on a foundation of inappropriate logic and conduct.", "Their combative tone, struck in a string of interviews across cable news, indicates that even as Trump and his allies have claimed exoneration, they are gearing up for another drawn-out fight. And the arguments they made previewed a line of defense as Congress prepares to pick up where Mueller left off — though Democrats continued to tread lightly on the issue of impeachment ahead of a strategizing huddle with House Speaker Nancy Pelosi on Monday.", "Story Continued Below", "Trump’s personal attorney Rudy Giuliani sparred with Chris Wallace on “Fox News Sunday,” Chuck Todd on NBC’s “Meet the Press” and Jake Tapper on CNN’s “State of the Union,” while senior counselor Kellyanne Conway, speaking with ABC’s Martha Raddatz, defended the president and found fault with the way the report was presented.", "“That entire report, and the way you just presented it, is all from the point of, ‘Let's see if we can hang Donald Trump,’” Giuliani told Todd.", "“Go to Page 2 of the obstruction thing. The president’s got to prove he’s innocent. They have to be convinced that he didn’t do it. When is that the standard ever in America? How can you prove a negative?”", "For Giuliani, a former federal prosecutor, the investigation itself was the crime.", "“Where’s the interest now,” he said on NBC, “in trying to figure out how could it be that the FBI investigated this in two separate investigations, used four wiretaps in order to do it, four electronic surveillances, talked to 500 witnesses, spent $40 million, and the answer is there was no — not the slightest bit of evidence of conspiracy between Trump, anyone on the Trump campaign and the Russians? That was the story. Not this stuff which is underneath it.”", "Giuliani argued that it was misleading for Trump’s critics to point out that Mueller hadn’t exonerated the president in declining to bring charges against him for collusion or obstruction of justice.", "“Exoneration means proving a negative,” Giuliani said to Wallace, calling the notion that Mueller’s report would need to exonerate Trump a “biased, warped view of a prosecutor’s role.”", "\n                    ", "\n                    By ", "Conway also took issue with many of Trump’s critics, as well as media reports, that have focused on the report’s explicitly noting that “while this report does not conclude that the President committed a crime, it also does not exonerate him.”", "“The word exoneration was unnecessary in the Mueller report, and I would say inappropriate,” she said, adding: “You either prosecute or you don’t. You either bring an indictment or you don’t.”", "Despite her quarrels with Mueller’s phrasing, Conway contended that the mere lack of charges against the president was exoneration in itself.", "“The job of a prosecutor is to gather evidence and decide whether to indict or to decline to indict,” she told Raddatz. “They declined to indict. The president is not going to jail, he’s staying in the White House for five and a half more years. Why? Because they found no crime, no conspiracy. That was the central premise.”", "Though he said there would be no rebuttal from the president’s team just yet, Giuliani continued to question the report’s findings on obstruction even while lauding its findings that no one on the Trump campaign conspired to collude with Russia to sway the 2016 election.", "“A lot of things left off, a lot of things are false — I shouldn’t say a lot of things. Some things are false, a lot of things are questionable,” he said of the report.", "On Sunday, Giuliani and Conway appeared to have settled on a similar line of attack going forward, questioning the credibility of those who played a key role in Mueller’s crafting of the obstruction portion. Trump previewed that argument on Friday, calling some of what his aides told Mueller “total bullshit.”", "Giuliani and Conway both zeroed in Sunday on the testimony of someone who made frequent appearances in Mueller’s report: former White House Counsel Don McGahn, who spent 30 hours with the special counsel’s team.", "According to the report — which Giuliani denounced as “one-sided” and “infected” with bias, despite hailing it for clearing the president legally — Trump asked McGahn to inform Deputy Attorney General Rod Rosenstein that Mueller was too conflicted to serve as special counsel, just days after media reports revealed that the special counsel was looking into whether Trump obstructed justice and for the first time was personally a target of the investigation. McGahn said he took this to mean Trump was asking him to remove Mueller from the investigation.", "McGahn declined to fire Mueller, instead threatening to resign rather than do so, putting him in the company of numerous other presidential aides who shut down Trump’s attempts to thwart the investigation.", "“The president’s efforts to influence the investigation were mostly unsuccessful, but that is largely because the persons who surrounded the president declined to carry out orders or accede to his requests,” the report states.", "Trump’s team has pointed out that Trump never explicitly ordered McGahn to act, and that he told several slightly differing versions of the episode.", "It’s an argument the president’s allies have fallen back on a number of times, including to dispute former FBI Director James Comey’s interpretation of Trump’s telling him to go easy on then-national security adviser Michael Flynn, who was also embroiled in the probe.", "In his interview on CNN’s “State of the Union,” Giuliani asserted that McGahn’s account was not credible enough to hypothetically be put in front of a jury.", "\n                    ", "\n                    By JOSH GERSTEIN and ", "“The guy has three different versions of something as important as this?” he asked. “You say I can’t rely on it.”", "Giuliani added of McGahn: “I’m telling you, he’s confused.”", "Though Giuliani seemed resigned to a congressional investigation of obstruction, he cast doubt on whether lawmakers could legally make a determination on whether Trump’s firing of Comey and his attempts to fire Mueller amounted to obstruction.", "“If they’re gonna review his removal power,” he said, there’s a “real question under Article 2 whether they can do that. The Constitution of the United States give the Congress a role in appointment, advise and consent; it deliberately doesn’t give them a role in removal because they say, go back to the Constitutional Convention, that would be too much of an intrusion.”", "Even so, Giuliani contended about the possibility of removing Mueller, “had he done it, it would not have been obstruction of justice” because “there were very good reasons” to dismiss the special counsel due to perceived bias and conflicts of interests on Mueller’s team.", "And, he continued, Trump would have known that firing Mueller would not have halted the investigation because of its continuing under different leadership when Trump fired Comey. On CNN, he accused investigators of not interviewing witnesses who would have backed up the Trump team’s version of events.", "“The second version is about as close to the truth as you’re going to get I think,” Giuliani said on CNN. “But the reality is there are independent witnesses they didn’t bother to interview who would say at that time the president was not taking the position that Mueller should be fired. In fact, Mueller was reassured he wouldn’t be fired. Those witnesses were not interviewed. Second, there are witnesses that dispute — a witness that disputes whether that’s correct.”", "Despite Giuliani’s insistence that only Trump’s firing of Comey and his attempted removal of Mueller were in question regarding obstruction, the special counsel’s report lays out eight other episodes where the president potentially obstructed justice.", "McGahn responded to the barrage of criticism over the weekend, telling NBC News he stood by his recollection of the episode, declaring that it was accurately described in the report and calling it a “mystery why Rudy Giuliani feels the need to re-litigate incidents the attorney general and deputy attorney general have concluded were not obstruction.”", "\n                    ", "\n                    By ", "Rep. Jerry Nadler (D-N.Y.), chairman of the House Judiciary Committee, which would be in charge of kicking off impeachment proceedings, said on Sunday that he planned to call McGahn to testify about his time in the White House. Rep. Elijah Cummings (D-Md.), who chairs the House Oversight Committee, said on CBS’ “Face the Nation” that he, too, wanted to hear from McGahn.", "In his report, Mueller appeared to punt the issue of obstruction to lawmakers, writing that his office did not seek to make a “traditional prosecutorial decision” on obstruction because of longstanding Justice Department policy against indicting a sitting president.", "However, the report says: “The conclusion that Congress may apply the obstruction laws to the President’s corrupt exercise of the powers of office accords with our constitutional system of checks and balances and the principle that no person is above the law.”", "Nadler on Friday issued a subpoena for the unredacted report and its underlying evidence, including grand jury information, even though, he said on Sunday, the redacted version contained “plenty of evidence of obstruction.”", "He also denied that Democrats had already moved to open an impeachment inquiry.", "“I don’t think we’re doing that,” Nadler said on “Meet the Press.” “We may get to that. We may not. As I’ve said before, it is our job to go through all the evidence, all the information we can get.”", "Despite calls from a growing number of prominent voices — including two Democratic presidential candidates, Julian Castro and Sen. Elizabeth Warren — to initiate impeachment proceedings, Cummings and Rep. Adam Schiff (D-Calif.), chairman of the House Intelligence Committee, urged caution at barging ahead with such a divisive case.", "Schiff, on Fox, called it “a very difficult decision.”", "“We’re going to have a caucus about this over the next couple weeks to try to figure out what the best course is. Not for the party, but what’s the best course for the country,” he said, dinging Republicans, who have remained resolute in their opposition to impeachment. “I think it’s certainly the case that an impeachment would be unsuccessful if the Republican Party continues to place party above country, continues essentially to back the president no matter how unethical or dishonest his conduct may be, and sadly, that’s where we are right now.”", "But he and Cummings both warned against inaction, with Schiff arguing that it might “signal that somehow this president’s conduct is OK, that future presidents can engage in this kind of corruption without consequence.”", "Cummings worried that not taking any action would only “embolden” Trump, and said he wouldn’t rule out impeachment.", "“I’m not — I’m not there yet, but I can foresee that possibly coming,” he said on CBS’ “Face the Nation.” ", "“There comes a point in life where we all have to make decisions based upon the fact that it is our watch,” he said. “And, you know, history, I think even if we did not win possibly, if there were not impeachment, I think history would smile upon us for standing up for the Constitution.” ", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "Meet the Democrats’ New Voice on Foreign Policy", "body": ["The Friday Cover is POLITICO Magazine's email of the week's best, delivered to your inbox every Friday morning.", "By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.", "\n                M. Scott Mahaskey/POLITICO", "\n                        ", "\n                        Tom Malinowski is an unlikely member of Congress. But he's fast becoming a force on Capitol Hill.", "\n                    By ", "\n                    Updated ", "SOMERVILLE, N.J. — It was a Friday in March at 5:00 p.m. on the dot. Rep. ", " and I had just sat down in his largely empty temporary congressional office when special counsel Robert Mueller informed Attorney General William Barr that his 22-month investigation was complete, prompting a dizzying whirlwind of speculation about what comes next.", "Malinowski, a Democrat, took his iPhone out of his pocket to glance at the update but appeared largely uninterested — and disappointed. He put his phone on his desk and changed the subject to something that had happened a mere three hours ago and was at the top of his mind.", "Story Continued Below", "President Donald Trump had just reversed — via tweet, no less — his own Treasury Department’s decision to impose new sanctions on North Korea, with the White House press secretary saying Trump “likes” Kim Jong Un and therefore believes the harsh financial punishments would have been unnecessary.", "But suddenly, the world’s attention shifted to the news that Mueller had wrapped up his investigation and the attorney general’s sparse, four-page summary of Mueller’s findings. Trump’s stunning reversal of North Korea sanctions would soon be forgotten, a fact that irked Malinowski, who was enraged by the president’s decision.", "“We’re inured to this. The president ‘likes’ the leader of an adversary state and therefore will not take action against him?” Malinowski said in his characteristic deep, monotone voice that he almost never raises. “You don’t wait for your Treasury Department to sanction people and then the next day theatrically overturn them. You don’t do that.”", "Malinowski, 53, is just one of nearly 100 members of the freshman class in the House — but he’s quickly becoming one of Democrats’ most influential voices on foreign policy, educating his fellow members about key issues and aggressively pushing the Trump administration to prioritize global human rights issues and reorient its often chaotic foreign policy.", "“He's brought to the committee a wealth of experience and a list of good ideas a mile long,” said Rep. Eliot Engel (D-N.Y.), chairman of the Foreign Affairs Committee, on which Malinowski sits. “He's going to play a big role in our work in the years ahead.\"", "It’s all the more surprising because Malinowski wasn’t supposed to be here. Born in Poland and having immigrated to the U.S. at 6, he spent 12 years as a top official at Human Rights Watch before joining Barack Obama’s State Department as head of the Bureau of Democracy, Human Rights and Labor — hardly the usual launching pads for a congressional career. In the 2018 midterms, he narrowly defeated a GOP incumbent in a Republican-leaning central-north New Jersey district, winning in part by flipping longtime Republicans in a year that saw a “blue wave” reaction to the president’s first 21 months in office.", "Building a public profile around foreign-policy and national security issues is a daunting task in any era. And in a freshman class that includes firebrands like Alexandria Ocasio-Cortez and Ilhan Omar, it often seems impossible to jerk the media spotlight over to sobering topics like the famine in Yemen. Yet that’s exactly what Malinowski is aiming to do — while assiduously tending to the needs of his constituents: Officially, his top issue is pushing for the construction of the proposed Gateway Tunnel linking New Jersey with Manhattan.", "“You know my job in Congress: Dig a tunnel and save the world — in that order,” he often says, ranking his spot on the Transportation Committee above membership on the Foreign Affairs panel. But it’s clear that human rights — not bridges and tunnels — remains his true passion.", "Calling out and punishing human-rights abusers is one of the few actions that brings Republicans and Democrats together on Capitol Hill — and Malinowski has a history of finding allies on the other side of the aisle. Over his years in Washington, he has cultivated relationships with Republicans like the late Senator John McCain of Arizona, with whom he found common ground despite McCain’s stinging criticisms of Obama’s policies. They worked together during the George W. Bush administration to oppose the CIA’s use of \"enhanced interrogation techniques\", and McCain ", " Malinowski at his Senate confirmation hearing in September 2013. Malinowski ", " McCain’s praise in a campaign advertisement shortly after the senator’s death.", "The two men often butted heads over Obama’s foreign policy, even as they often agreed in private. Malinowski revealed to POLITICO that he worked behind the scenes to fight some of Obama’s most criticized foreign-policy decisions — most notably, the initial intervention into Yemen’s civil war by providing aid to Saudi Arabia despite the kingdom’s poor record on human rights and Obama’s refusal to set up a no-fly zone over Syria despite his “red line” on chemical-weapons attacks.", "McCain was, for decades, the go-to authority for congressional Republicans on foreign policy and national security matters — and a vocal critic of autocratic regimes. Democrats had their own hawkish ", "until his death in 2008: Rep. Tom Lantos of California, who, like Malinowski, grew up in the Eastern bloc and learned to despise Soviet-style governance. But few figures in either party command that kind of authority today — which presents an opportunity for someone with the gravitas and media savvy to step into the vacuum.", "In 2019, Republicans maintain a national security edge over Democrats, though ", " show that the gap is narrowing. Many on Capitol Hill believe the gap can be reversed if Democrats can ", " of Trump’s disjointed and often haphazard approach to world affairs.", "It seems unlikely a freshman House member who’s never held elected office before could become a real irritant to the White House on foreign policy — especially in an age when America is turning inward, consumed by debates over health care, inequality, race and immigration. And in this “Romney Republican” congressional district, there’s no guarantee that Malinowski will be able to stick around longer than just one term. In fact, he already has a ", " for 2020: the son of former New Jersey Governor Tom Kean.", "But Malinowski is betting that Americans still deeply care about the world beyond their borders, and he projects more worry about the substance of Trump’s foreign policy — his praise for dictators like Russia’s Vladimir Putin and North Korea’s Kim, his erratic Twitter statements on the use of nuclear weapons, his disdain for NATO — than politics.", "“I think Americans still care. I think the State Department still cares. I think our armed forces still care,” he said.", "“Every institution cares apart from the White House,” Malinowski added. “And unfortunately, the president speaks for the United States, so the world gets a warped impression of what the United States is all about right now because of one man. And that is consequential. But it can be reversed.”", "***", "For a freshman lawmaker who doesn’t dance on social media or tangle with the president over Israel, Malinowski’s ability to get attention is impressive. During a recent House Foreign Affairs Committee hearing, he cornered Secretary of State Mike Pompeo on the disconnect between the president calling out Venezuela’s socialist government and his praising communist North Korea for its economic potential. The clip went viral on Twitter, causing many to ask: Who’s Tom Malinowski?", "“If we’re going to be so forceful in denouncing socialism, why is the administration so high on communism?” Malinowski asked.", "“Yeah, I mean, the very statement there is outrageous,” Pompeo responded, going on to defend the Trump administration's strict sanctions on Pyongyang.", "“Why is ‘liking’ Kim Jong Un a sufficient reason to cancel or not to pursue sanctions against companies helping his nuclear program?” Malinowski retorted, referring to Trump’s reversal of Treasury-approved sanctions — the same decision that vexed Malinowski so much that he shrugged off the completion of the Mueller investigation.", "He later brought up Trump’s glowing comments about Kim and asked Pompeo if Kim is responsible for the country’s labor camps and the assassinations of his uncle and brother, among other human rights abuses.", "“He’s the leader of the country,” Pompeo said each time.", "“What’s to ‘like’ about Kim Jong Un?” Malinowski pressed.", "“Sir, don’t make this a political football. It’s inappropriate,” Pompeo responded.", "It hasn’t always been this easy for Malinowski to grab the spotlight, though. Only a few weeks into his tenure, he did something almost unheard of on Capitol Hill in the era of social media virality: He walked up to a reporter after a news conference and asked if the confused scribe had any more questions for him.", "“Nothing bores me more than people complaining about press coverage and not getting attention,” he later said. “It’s our job to do things that are worthy of attention. And I think we’re doing a pretty good job. And I’m satisfied that I’m getting my message out.”", "***", "Before I arrived at his office, Malinowski was preparing his remarks for a vigil later that night for the victims of the mosque attacks in Christchurch, New Zealand, where a white supremacist killed 50 Muslim worshippers and wounded dozens more. As I walked into his office, he asked a staffer to find the names of the victims who were living in New Zealand as refugees.", "Speaking in a gymnasium at Mount Olive High School later that night, Malinowski said those refugees came from Syria, Somalia and Afghanistan because they thought they would be safe in New Zealand. Without mentioning Trump by name, Malinowski harangued politicians who employ language about an “invasion” of migrants — as Trump had the day after the shootings and during the run-up to the 2018 midterm elections. At the vigil, he implored attendees to “call out anyone in this country who uses language that is in any way similar to the language that those terrorists use.” The crowd did something that rarely happens at vigils: It stood up and applauded for nearly a minute before Malinowski could continue speaking.", "“The shooter in New Zealand said exactly the same thing: Immigrants are invading Western countries,” Malinowski told me in his office. “And when the president responds the next day after the massacre in New Zealand by repeating that immigrants are invading America, that does not make people in my district feel more safe any more than they would have felt safe if Barack Obama had echoed the propaganda of ISIS after an ISIS attack. So this isn’t politics. This is serious business. This is about protecting our country and protecting our people. It’s about defending our law enforcement institutions, defending our intelligence community.”", "He recently introduced a resolution condemning white supremacist rhetoric and those who amplify or repeat it. The legislation doesn’t mention Trump specifically, but it’s an implicit dig at the president with a twist: The resolution almost entirely consists of quotes from conservative darling Ronald Reagan's final speech as president. It was an address Malinowski described as a “love letter” to immigration. It’s something close to his heart as an immigrant himself.", "“The idea would be to ask Republicans to choose between Reagan and Trump,” Malinowski said. “This is becoming a national security issue and I want us to stop playing defense on immigration and start playing offense and point out that this demonization of immigrants and this spreading of outright paranoid lies about invasions of rapists and killers is radicalizing a portion of the American population in ways that are dangerous to all of us.”", "“It’s scary,” he said at another point in our interview. “It’s like nothing I’ve ever seen before in our country. And it’s a problem we’re going to be dealing with, I fear, after Trump is gone.”", "***", "As alarmed as Malinowski can sound about Trump, he finds himself in a curious political position: In his historically Republican district, he could not have won by bashing the president all the time. On domestic issues, he positions himself as a moderate Democrat, rejecting progressive goals like \"Medicare for All\" and the \"Green New Deal\" as irresponsible and unrealistic.", "At the same time, he viewed 2018 as a turning point for the two political parties. In Malinowski’s view, Republicans had all but abandoned the core principles that Americans had associated with the party of Lincoln.", "“I felt like I was running as the candidate of the party of patriotism in America, the party of law enforcement in America, the party that wants to defend our country against foreign adversaries, the party of family values — since our presidents don’t pay off porn stars while they’re in the White House,” he said. “These are all principles that used to be associated with the Republican Party. And I proudly embrace them and believe that my party stands for them today.”", "The Democratic Congressional Campaign Committee advised Malinowski that to win his race against Republican incumbent Leonard Lance, the safest thing to do was to run on the party’s health care message. Don’t take the bait, the Democratic strategists in Washington warned, on Trump’s late-stage rhetoric about a migrant caravan coming to “invade” the country.", "The New Jersey Democrat ignored that counsel.", "One of his final ", " of the campaign cycle, titled “Rejecting Fear,” featured Malinowski explicitly pushing back on Trump’s closing message: “They want you scared — scared of your neighbors, scared of me.” Malinowski thinks the message resonated in part because of the ethnic diversity in New Jersey’s 7th Congressional District and the fact that 20 percent of its residents were born outside the U.S.", "“Democrats can talk about these issues so long as we frame them in the right way,” Malinowski insisted to me. “I’m not an alarmist. I speak calmly and precisely about what’s happening in our country and to our community.”", "***", "Malinowski’s presence on Capitol Hill — particularly his perch on the Foreign Affairs Committee — irks some of his Republican colleagues.", "“Anything to do with the horrid foreign policy of President Obama, it’s not healthy for our country so we can’t support that,” said Rep. Ted Yoho (R-Fla.), a longtime member of the Foreign Affairs Committee, naming the Iran nuclear deal and other cornerstones of Obama’s foreign policy. “The bad policies that [Obama] did have really damaged this country.”", "But Malinowski has also used his State Department experience to his advantage on the panel.", "During a committee debate about a War Powers Resolution to withdraw U.S. support for the Saudi-led coalition in ", ", Republicans were arguing that the effort was ill-conceived because the U.S. is not engaged in “hostilities” in Yemen. Malinowski fired back, explaining that he was involved in the discussions when the Obama administration decided to get involved in Yemen in the first place. The Obama administration considered the U.S. to be formally engaged in hostilities in Yemen, Malinowski countered.", "\n                            Rep. Tom Malinowski listens to California Rep. Jimmy Panetta discuss legislation supporting NATO  on  Jan. 22, 2019.   | Andrew Harnik/AP Photo", "“If a foreign power was bombing Washington, D.C., and a second foreign power was refueling the first power’s aircraft over Chesapeake Bay on their way to drop ordnance on the Capitol building, we’d consider both countries to be at war with us, obviously,” Malinowski told me. “And if we’re refueling Saudi aircraft, if we’re servicing them on the tarmac, helping them get back into the air, we’re part of this conflict. And therefore need to make responsible decisions.”", "Most — if not all — first-time members of Congress have never been in a classified briefing. Malinowski’s fellow freshman lawmakers often lean on his executive branch experience when drawing their own conclusions. Every Democrat ended up voting in favor of the ", ", a remarkable and rare show of Democratic unity on a fraught foreign-policy issue.", "“Witnesses can’t get things by him,” said Rep. Ted Lieu (D-Calif.), a fellow Foreign Affairs Committee member. “He’s able to provide a lot of knowledge for the members of the committee, but he also uses it on the floor.”", "***", "Despite the GOP criticisms, Malinowski is far from an Obama sycophant. During his tenure as assistant secretary of State for democracy, human rights and labor, he was often a dissenting voice among the Obama foreign-policy brass. Republicans like McCain took notice.", "“We fought together in the trenches to do something that we both passionately believed in,” Malinowski said of his work with McCain on banning the use of torture. “He won my lifelong loyalty and admiration in that fight.”", "But McCain, an ardent critic of Obama’s foreign policy, often used Malinowski as a punching bag to vent about what he viewed as a disjointed and dangerous series of foreign-policy decisions — including the last time they saw each other, in McCain’s Senate office in 2017.", "“He reamed me out about my support for banning arms sales to Saudi Arabia. He said, ‘Are you one of those people who think we should stop selling [precision-guided munitions] to Saudi Arabia?’ And he gave me a look that could kill,” Malinowski said with a laugh. “I tried to shift the subject as quickly as I could.”", "“I loved him. And he liked a good fight and always — he jumped into the toughest fights and was never afraid of taking a strong position on a difficult issue. And I try to be the same way. And sometimes that meant we were on opposing sides. And it did not and could not have affected our friendship.”", "Malinowski agreed with one of McCain’s central critiques of Obama’s foreign policy: that the U.S. should have done more to stanch the bloodshed in Syria after Obama’s “red line.” But Malinowski, who at the time was a senior official on the president’s national security team, couldn’t project his views publicly; instead, he tried to change Obama’s course from the inside.", "“When I was working with the president, for the president, I made my opinions known in a way that one responsibly does as a member of the administration,” he said.", "On Syria, though, Malinowski struck out. Obama was reluctant to do anything that would drag the U.S. into a prolonged conflict in the region, even as Syrian President Bashar Assad was deploying chemical weapons on his own people. Malinowski wanted to set up a no-fly zone well before Russia staged a military intervention in 2015; the idea would have been to prevent Syrian fighter jets from flying over cities like Aleppo and threaten to shoot down aircraft that crossed into opposition-held areas. But once the Russians got involved, all bets were off.", "Malinowski argues that had his view prevailed, the cascading and disastrous global effects of the Syrian civil war would have been mitigated — even prevented.", "“The 5 million refugees, the rise of ISIS, chemical weapons attacks, the Russian intervention — I think we had a chance to prevent those things, and they had an impact well beyond Syria,” Malinowski said. “I don’t think Brexit would have happened if not for Syrian refugees flooding Europe and creating this fear of an immigrant invasion. It affected our politics in ways that can’t be quantified, but it certainly affected our politics. The fear of ISIS and the fear of refugees have been a powerful driver in Western politics for the last few years. And both of those problems came to us courtesy of Syria.”", "***", "Searing foreign-policy dilemmas like Syria — when, and how, America should intervene abroad — have been dividing the Democratic Party for generations. During the Cold War, the left clashed with hawks like Washington Senator Henry “Scoop” Jackson over how seriously to take the Soviet threat; after the Cold War ended, it was conflicts like Bosnia and Iraq that fueled heated intraparty debates. But even though Trump has scrambled the usual trench lines on national security through his mix of isolationism and pugnacious nationalism, the Democratic Party is surprisingly unified on these issues — for now.", "House Democrats would be wise to take advantage of that unity, Malinowski argues, especially as liberal firebrands fuel intraparty divisions that often grab headlines and drive unfavorable media coverage of the House Democratic majority.", "His advice: Eyes on the prize.", "“We have the same basic vision for the general direction the country should go in,” Malinowski told me in closing. “We have interesting differences about how to do it, but those differences are not going to play out in a meaningful way in the House in the next two years because Donald Trump is the glue that holds us all together. We know the country’s in crisis. We know that this is not a time for transforming America. This is a time for saving America, preserving America. And there will be plenty of time, if we succeed in preserving our institutions, preserving our democracy, there will be plenty of time in the coming years to argue about differences in policy.”", "\n                    ", "\n                ", "\n                    Updated ", "\n                    ", "\n                ", "\n                    ", "\n                ", "\n                                ", " © 2019 POLITICO LLC"]},
{"title": "Trump tests post-Mueller vengeance campaign", "body": ["\n                President Donald Trump arrives for a campaign rally in Grand Rapids, Michigan on March 28, 2019. | Nicholas Kamm/AFP/Getty Images", "\n                        ", "\n                        At his first rally since being cleared of Russian conspiracy charges, Trump ticked through those he felt wronged him as the crowd chanted, “Lock them up.”", "\n                    By ", "President Donald Trump feels vindicated. And now he’s out for blood. ", "Wearing the same red tie he wore on Inauguration Day, Trump took the stage in Michigan on Thursday for the first time since being cleared of Russian conspiracy charges and proceeded to tear through a vengeance-laced speech that felt as much like a second inaugural as it did a campaign rally. ", "Story Continued Below", "One by one in front of a packed audience, Trump ticked through those who he felt wronged him over the 22-month Russia probe that dogged his presidency — from lawmakers to television pundits — egging the adoring crowd on as it chanted, “Lock them up.” And he expressed sympathy for those caught up in the probe, describing them as “innocent” individuals badly damaged by “an elaborate hoax,” amid speculation that he will pardon former aides facing Mueller-related prison time. ", "The broadside gave a preview of how Trump plans to use the investigation as a major cudgel to rally his base and trash his enemies heading into the 2020 election. ", "“This group of major losers did not just ruthlessly attack me, my family and everyone who questioned their lies, they tried to divide our country, to poison the national debate and to tear up the fabric of our great democracy,” Trump roared.", "The race for 2020 starts now. Stay in the know. Follow our presidential election coverage.", "By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.", "At times, it almost seemed like a presidential reset, six days after special counsel Robert Mueller concluded his investigation into Russian election meddling without establishing any criminal conspiracy between Trump’s team and Moscow. And although Mueller did not exonerate Trump in an obstruction of justice probe, Attorney General Bill Barr has said he will not bring charges. ", "The president once again claimed complete exoneration Thursday night. And in the battleground state of Michigan — a state Trump narrowly won in 2016 and that will be critical to his re-election changes — Trump’s supporters soaked it up, cheering and chanting nearly every time the president took a jab at Democrats.", "Trump didn’t even touch his recent top policy issues — Obamacare, trade and immigration — until nearly half an hour into the speech. Instead he tore into his political opponents for pushing “this phony, corrupt, disgusting cloud” that has hung over his entire presidency.", "“This was nothing more than a sinister effort to undermine our historic election victory and to sabotage the will of the American people,” he claimed, adding that he expects that Democrats will now face a moment of reckoning.", "“They’re on artificial respirators right now. They’re getting mouth-to-mouth resuscitation,” Trump quipped. “The Democrats will need to decide whether they will continue defrauding the public with ridiculous bullshit, partisan investigations.”", "Trump similarly accused Democratic members of the House Oversight Committee of engaging in “political bullshit” during a speech to conservative activists earlier this month.", "\n                    ", "\n                    By ", "Democrats have argued they should receive a full copy of Mueller’s final report, something that Trump told reporters at the White House he wouldn’t mind his attorney general doing.", "“It wouldn’t bother me at all,” the president said Monday, responding to a question of whether the report should be made public.", "To the extent that Trump has been conciliatory toward Democrats since the conclusion of the Russia probe, his suggestion that Mueller’s report should be released is it. His remarks on Thursday instead underscored that he is seeking revenge — eager to go to war with those who he accused of trying “to illegally gain power by framing innocent Americans with an elaborate hoax.”", "“Robert Mueller was a god to the Democrats ... until he said no collusion,” Trump said, later claiming that Democrats are being driven “crazy” by the lack of charges against the president or his campaign aides.", "Trump’s victory lap in the Wolverine State, which he last visited in April 2018, comes as his campaign advisers are closely watching whether Mueller’s report brings a boost to the president’s approval polls. A Harvard-Harris survey released earlier Thursday found Trump’s approval rating unchanged from a similar poll conducted last month.", "According to one outside adviser to the president’s re-election effort, rallies like the one held Thursday are an “ideal opportunity for the president to test new messages, including new attacks against 2020 Democrats, and to remind voters of his accomplishments.” With the exception of an off-script complaint about the late Republican Sen. John McCain, which Trump has repeatedly revived in recent public remarks, the president seemingly stuck to what his advisers wanted him to do.", "\n                    ", "\n                    By ", "“This has been an incredible week for America. The economy is roaring, the ISIS caliphate is defeated 100 percent and after three years of lies and smears and slander, the Russia hoax is finally dead,” Trump said Thursday.", "“The collusion delusion is over,” he declared, testing a new phrase.", "Thursday’s event marked Trump’s second rally of the 2020 cycle, coming on the heels of his appearance in El Paso, Texas, last month. But in Michigan, especially, it was also a signal to the crowded field of Democratic presidential candidates that his popularity in the Rust Belt is hardly fading.", "Supporters of the president began arriving at Van Andel Arena, where the rally was held, as early as 3:30 a.m. Thursday morning to ensure they would catch a glimpse of the president when he arrived in Michigan nearly 16 hours later.", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "The White House's Mueller reaction plan has a wild card: Trump", "body": ["\n                The Republican National Committee and President Donald Trump's campaign team are aiming to shape perceptions of special counsel Robert Mueller’s findings in his favor. | Alex Wong/Getty Images", "\n                        ", "\n                        The president's aides have prepared an extensive spin operation ahead of Thursday's release.", "\n                    By ", "\n                    Updated ", "When the Mueller report crashes into a Washington feverish with anticipation on Thursday, the White House hopes to show President Donald Trump busy doing his job — and far away from a phone-sized keyboard.", "Trump typically spends the first half of his workday in the White House residence in “executive time” — making phone calls, reading news reports, keeping an eye on the TV and talking to top officials.", "Story Continued Below", "That’s exactly when the Department of Justice is expected to release special counsel Robert Mueller’s long-awaited report, and when the freewheeling tweeter-in-chief is likely to have the least amount of supervision.", "So on Thursday, the president’s hands will not be idle: Trump and the first lady will host an event for wounded warriors before he meets with the secretary of state and then departs for ", " at Mar-a-Lago, according to his public schedule and a Federal Aviation Administration notice.", "Sign up today to receive the #1-rated newsletter in politics", "By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.", "The goal for Thursday is to use the bully pulpit of the White House to give the appearance of a president consumed by the demands of his office. Former President Bill Clinton often leaned on the same playbook at key moments during the Starr investigation — a historical example Trump’s lawyers have ", " closely.", "Meanwhile, a well-greased spin machine will start whirring to life at the two main arms of the president’s reelection effort — the Republican National Committee and the Trump campaign, aiming to shape perceptions of Mueller’s findings in his favor. The attorney general is also planning to host a televised 9:30 a.m. news conference about the report, the Justice Department announced — and the president is contemplating holding one of his own.", "“You’ll see a lot of strong things come out tomorrow. Attorney General Barr is going to be doing a press conference. Maybe I’ll do one after that, we’ll see,” Trump said in a radio interview Wednesday.", "The report is expected to be delivered to Congress between 11 a.m. and 12 p.m., a senior DOJ official said. It is unclear when reporters will receive it or when it will be posted online for the general public.", "“The White House’s intent is to brush this off and move on as quickly as possible,” said one Republican close to the White House. “That is the approach the White House counsel will want the president to take — though it is up the president to do it,” the same Republican added. A White House spokesman declined to comment.", "\n                                ", "Aside from the uncertainty of what will be disclosed in the report itself, there’s a second major wild card: Trump.", "What could trigger the president is any hint in the Mueller report that one of his current and former aides, many of whom cooperated with the investigation at the direction of then-White House lawyer Ty Cobb, gave evidence or recounted conversations that somehow embarrasses Trump or his family members.", "“They went in and told the truth and are now wondering how much will be in the report. How much will it be redacted, and how will that play?” said one former administration official, noting that Attorney General William Barr’s letter summarizing Mueller’s findings could prove more favorable to the White House than the report itself.", "“What you got in the four-page memo was top-line conclusions that sounded definitive on collusion, but White House officials think the actual report will be less conclusive,” the former official added.", "Mueller’s team talked to a raft of Trump aides including former chief of staff Reince Priebus, former senior strategist Steve Bannon, former top attorney Don McGahn, former attorney general Jeff Sessions and press secretary Sarah Huckabee Sanders, among others. McGahn alone sat reportedly sat with the special investigators’ team for 30 hours of interviews.", "“It is an important thing to the president that these people are not seen\" in the report as attacking him personally, said the close White House adviser.", "McGahn’s tenure in the White House ended in a deeply broken relationship between the White House counsel and the president. McGahn was frustrated by the frequency of president’s outbursts, causing him to nickname the commander-in-chief, “King Kong,” and Trump felt equally frustrated that the White House’s top attorney did not do more to shield him personally, or stop the special investigation.", "\n                    ", "\n                    By ", ", JOSH GERSTEIN, ", " and ", "Since McGahn left in October 2018, Trump has continued to complain about him with some frequency, fuming about the various ways he feels McGahn failed him, according to the close White House adviser.", "McGahn and his attorney did not respond to requests for comment.", "No one in the White House has seen the full document yet, nor do they know how it handles the question of whether Trump obstructed justice in firing former FBI Director James Comey — or the nuances surrounding that and many other moments.", "Barr’s letter noted only that Mueller had declined to recommend charges of obstruction, quoting the special counsel’s report as saying: “[W]hile this report does not conclude that the president committed a crime, it also does not exonerate him.”", "But reports soon dribbled out relaying the views of frustrated members of Mueller’s team, rare leaks revealing that some in the special counsel’s office saw Barr’s synopsis of their “principal conclusions” as misleading.", "Inside the White House, aides are trying to project calm. Most of this week has felt like a waiting game, especially with Congress on recess and with many administration officials planning a short workweek given this weekend’s Easter and Passover holidays.", "There is also a feeling that Barr’s spare summary set the public narrative early on that Trump did not collude with Russia during the 2016 election — and White House officials and the president’s allies hope that perception sticks despite whatever damaging details may be lurking in the full report.", "On Thursday, White House officials including lead attorney Emmet Flood are expected to have a limited window of time to read and digest the key parts of report. One of the president’s outside attorneys, Jay Sekulow, told POLITICO that his plan is to have a team of five to six staffers to review the document as the president’s personal counsel, breaking up the report into sections and monitoring the public response to it. Flood and the White House’s top attorney Pat Cipollone are expected to then brief the president on the report’s findings.", "\n                    ", "\n                    By ", " and JOSH GERSTEIN", "Sekulow and the president’s other attorney, Rudy Giuliani, are expected to go on television extensively this weekend to defend the president, Sekulow told POLITICO. Sekulow said the goal was to follow a similar model to how they handled the Sunday Barr letter, where they were able to get out a statement and tee up media interviews within an hour.", "Trump's attorneys will also be wielding a \"counter-report\" pushing back on Mueller's findings, which Giuliani said earlier this week had been whittled down to \"34 or 35 pages.\"", "The Republican National Committee will play a leading role in pushing back on any potentially damaging tidbits, or Democrats’ statements. The RNC will rely on a war room to monitor the media coverage and political statements including a rapid response team, social media pushback and op-eds and TV appearances from top RNC communications officials.", "The Trump campaign is also ready to defend the president and then redirect the public’s attention.", "“We know that President Trump will — once again — be vindicated: no collusion and no obstruction. The tables should turn now, as it is time to investigate the liars who instigated the sham investigation in the first place,” said Tim Murtaugh, communications director for the campaign.", "But as always, Trump will act as his own communications director and public relations crisis manager. Already he’s distilled the message down to a simple Twitter statement, before he’s seen the report: “No Collusion - No Obstruction!”", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "Meet the Democrats’ New Voice on Foreign Policy", "body": ["\n                        ", "\n                        Tom Malinowski is an unlikely member of Congress. But he's fast becoming a force on Capitol Hill.", "\n                    By ", "\n                    Updated ", "\n                M. Scott Mahaskey/POLITICO", "SOMERVILLE, N.J. — It was a Friday in March at 5:00 p.m. on the dot. Rep. ", " and I had just sat down in his largely empty temporary congressional office when special counsel Robert Mueller informed Attorney General William Barr that his 22-month investigation was complete, prompting a dizzying whirlwind of speculation about what comes next.", "Malinowski, a Democrat, took his iPhone out of his pocket to glance at the update but appeared largely uninterested — and disappointed. He put his phone on his desk and changed the subject to something that had happened a mere three hours ago and was at the top of his mind.", "Story Continued Below", "President Donald Trump had just reversed — via tweet, no less — his own Treasury Department’s decision to impose new sanctions on North Korea, with the White House press secretary saying Trump “likes” Kim Jong Un and therefore believes the harsh financial punishments would have been unnecessary.", "But suddenly, the world’s attention shifted to the news that Mueller had wrapped up his investigation and the attorney general’s sparse, four-page summary of Mueller’s findings. Trump’s stunning reversal of North Korea sanctions would soon be forgotten, a fact that irked Malinowski, who was enraged by the president’s decision.", "“We’re inured to this. The president ‘likes’ the leader of an adversary state and therefore will not take action against him?” Malinowski said in his characteristic deep, monotone voice that he almost never raises. “You don’t wait for your Treasury Department to sanction people and then the next day theatrically overturn them. You don’t do that.”", "Malinowski, 53, is just one of nearly 100 members of the freshman class in the House — but he’s quickly becoming one of Democrats’ most influential voices on foreign policy, educating his fellow members about key issues and aggressively pushing the Trump administration to prioritize global human rights issues and reorient its often chaotic foreign policy.", "“He's brought to the committee a wealth of experience and a list of good ideas a mile long,” said Rep. Eliot Engel (D-N.Y.), chairman of the Foreign Affairs Committee, on which Malinowski sits. “He's going to play a big role in our work in the years ahead.\"", "It’s all the more surprising because Malinowski wasn’t supposed to be here. Born in Poland and having immigrated to the U.S. at 6, he spent 12 years as a top official at Human Rights Watch before joining Barack Obama’s State Department as head of the Bureau of Democracy, Human Rights and Labor — hardly the usual launching pads for a congressional career. In the 2018 midterms, he narrowly defeated a GOP incumbent in a Republican-leaning central-north New Jersey district, winning in part by flipping longtime Republicans in a year that saw a “blue wave” reaction to the president’s first 21 months in office.", "Building a public profile around foreign-policy and national security issues is a daunting task in any era. And in a freshman class that includes firebrands like Alexandria Ocasio-Cortez and Ilhan Omar, it often seems impossible to jerk the media spotlight over to sobering topics like the famine in Yemen. Yet that’s exactly what Malinowski is aiming to do — while assiduously tending to the needs of his constituents: Officially, his top issue is pushing for the construction of the proposed Gateway Tunnel linking New Jersey with Manhattan.", "“You know my job in Congress: Dig a tunnel and save the world — in that order,” he often says, ranking his spot on the Transportation Committee above membership on the Foreign Affairs panel. But it’s clear that human rights — not bridges and tunnels — remains his true passion.", "Calling out and punishing human-rights abusers is one of the few actions that brings Republicans and Democrats together on Capitol Hill — and Malinowski has a history of finding allies on the other side of the aisle. Over his years in Washington, he has cultivated relationships with Republicans like the late Senator John McCain of Arizona, with whom he found common ground despite McCain’s stinging criticisms of Obama’s policies. They worked together during the George W. Bush administration to oppose the CIA’s use of \"enhanced interrogation techniques\", and McCain ", " Malinowski at his Senate confirmation hearing in September 2013. Malinowski ", " McCain’s praise in a campaign advertisement shortly after the senator’s death.", "The two men often butted heads over Obama’s foreign policy, even as they often agreed in private. Malinowski revealed to POLITICO that he worked behind the scenes to fight some of Obama’s most criticized foreign-policy decisions — most notably, the initial intervention into Yemen’s civil war by providing aid to Saudi Arabia despite the kingdom’s poor record on human rights and Obama’s refusal to set up a no-fly zone over Syria despite his “red line” on chemical-weapons attacks.", "McCain was, for decades, the go-to authority for congressional Republicans on foreign policy and national security matters — and a vocal critic of autocratic regimes. Democrats had their own hawkish ", "until his death in 2008: Rep. Tom Lantos of California, who, like Malinowski, grew up in the Eastern bloc and learned to despise Soviet-style governance. But few figures in either party command that kind of authority today — which presents an opportunity for someone with the gravitas and media savvy to step into the vacuum.", "In 2019, Republicans maintain a national security edge over Democrats, though ", " show that the gap is narrowing. Many on Capitol Hill believe the gap can be reversed if Democrats can ", " of Trump’s disjointed and often haphazard approach to world affairs.", "It seems unlikely a freshman House member who’s never held elected office before could become a real irritant to the White House on foreign policy — especially in an age when America is turning inward, consumed by debates over health care, inequality, race and immigration. And in this “Romney Republican” congressional district, there’s no guarantee that Malinowski will be able to stick around longer than just one term. In fact, he already has a ", " for 2020: the son of former New Jersey Governor Tom Kean.", "But Malinowski is betting that Americans still deeply care about the world beyond their borders, and he projects more worry about the substance of Trump’s foreign policy — his praise for dictators like Russia’s Vladimir Putin and North Korea’s Kim, his erratic Twitter statements on the use of nuclear weapons, his disdain for NATO — than politics.", "“I think Americans still care. I think the State Department still cares. I think our armed forces still care,” he said.", "“Every institution cares apart from the White House,” Malinowski added. “And unfortunately, the president speaks for the United States, so the world gets a warped impression of what the United States is all about right now because of one man. And that is consequential. But it can be reversed.”", "***", "For a freshman lawmaker who doesn’t dance on social media or tangle with the president over Israel, Malinowski’s ability to get attention is impressive. During a recent House Foreign Affairs Committee hearing, he cornered Secretary of State Mike Pompeo on the disconnect between the president calling out Venezuela’s socialist government and his praising communist North Korea for its economic potential. The clip went viral on Twitter, causing many to ask: Who’s Tom Malinowski?", "“If we’re going to be so forceful in denouncing socialism, why is the administration so high on communism?” Malinowski asked.", "“Yeah, I mean, the very statement there is outrageous,” Pompeo responded, going on to defend the Trump administration's strict sanctions on Pyongyang.", "“Why is ‘liking’ Kim Jong Un a sufficient reason to cancel or not to pursue sanctions against companies helping his nuclear program?” Malinowski retorted, referring to Trump’s reversal of Treasury-approved sanctions — the same decision that vexed Malinowski so much that he shrugged off the completion of the Mueller investigation.", "He later brought up Trump’s glowing comments about Kim and asked Pompeo if Kim is responsible for the country’s labor camps and the assassinations of his uncle and brother, among other human rights abuses.", "“He’s the leader of the country,” Pompeo said each time.", "“What’s to ‘like’ about Kim Jong Un?” Malinowski pressed.", "“Sir, don’t make this a political football. It’s inappropriate,” Pompeo responded.", "It hasn’t always been this easy for Malinowski to grab the spotlight, though. Only a few weeks into his tenure, he did something almost unheard of on Capitol Hill in the era of social media virality: He walked up to a reporter after a news conference and asked if the confused scribe had any more questions for him.", "“Nothing bores me more than people complaining about press coverage and not getting attention,” he later said. “It’s our job to do things that are worthy of attention. And I think we’re doing a pretty good job. And I’m satisfied that I’m getting my message out.”", "***", "Before I arrived at his office, Malinowski was preparing his remarks for a vigil later that night for the victims of the mosque attacks in Christchurch, New Zealand, where a white supremacist killed 50 Muslim worshippers and wounded dozens more. As I walked into his office, he asked a staffer to find the names of the victims who were living in New Zealand as refugees.", "Speaking in a gymnasium at Mount Olive High School later that night, Malinowski said those refugees came from Syria, Somalia and Afghanistan because they thought they would be safe in New Zealand. Without mentioning Trump by name, Malinowski harangued politicians who employ language about an “invasion” of migrants — as Trump had the day after the shootings and during the run-up to the 2018 midterm elections. At the vigil, he implored attendees to “call out anyone in this country who uses language that is in any way similar to the language that those terrorists use.” The crowd did something that rarely happens at vigils: It stood up and applauded for nearly a minute before Malinowski could continue speaking.", "“The shooter in New Zealand said exactly the same thing: Immigrants are invading Western countries,” Malinowski told me in his office. “And when the president responds the next day after the massacre in New Zealand by repeating that immigrants are invading America, that does not make people in my district feel more safe any more than they would have felt safe if Barack Obama had echoed the propaganda of ISIS after an ISIS attack. So this isn’t politics. This is serious business. This is about protecting our country and protecting our people. It’s about defending our law enforcement institutions, defending our intelligence community.”", "He recently introduced a resolution condemning white supremacist rhetoric and those who amplify or repeat it. The legislation doesn’t mention Trump specifically, but it’s an implicit dig at the president with a twist: The resolution almost entirely consists of quotes from conservative darling Ronald Reagan's final speech as president. It was an address Malinowski described as a “love letter” to immigration. It’s something close to his heart as an immigrant himself.", "“The idea would be to ask Republicans to choose between Reagan and Trump,” Malinowski said. “This is becoming a national security issue and I want us to stop playing defense on immigration and start playing offense and point out that this demonization of immigrants and this spreading of outright paranoid lies about invasions of rapists and killers is radicalizing a portion of the American population in ways that are dangerous to all of us.”", "“It’s scary,” he said at another point in our interview. “It’s like nothing I’ve ever seen before in our country. And it’s a problem we’re going to be dealing with, I fear, after Trump is gone.”", "***", "As alarmed as Malinowski can sound about Trump, he finds himself in a curious political position: In his historically Republican district, he could not have won by bashing the president all the time. On domestic issues, he positions himself as a moderate Democrat, rejecting progressive goals like \"Medicare for All\" and the \"Green New Deal\" as irresponsible and unrealistic.", "At the same time, he viewed 2018 as a turning point for the two political parties. In Malinowski’s view, Republicans had all but abandoned the core principles that Americans had associated with the party of Lincoln.", "“I felt like I was running as the candidate of the party of patriotism in America, the party of law enforcement in America, the party that wants to defend our country against foreign adversaries, the party of family values — since our presidents don’t pay off porn stars while they’re in the White House,” he said. “These are all principles that used to be associated with the Republican Party. And I proudly embrace them and believe that my party stands for them today.”", "The Democratic Congressional Campaign Committee advised Malinowski that to win his race against Republican incumbent Leonard Lance, the safest thing to do was to run on the party’s health care message. Don’t take the bait, the Democratic strategists in Washington warned, on Trump’s late-stage rhetoric about a migrant caravan coming to “invade” the country.", "The New Jersey Democrat ignored that counsel.", "One of his final ", " of the campaign cycle, titled “Rejecting Fear,” featured Malinowski explicitly pushing back on Trump’s closing message: “They want you scared — scared of your neighbors, scared of me.” Malinowski thinks the message resonated in part because of the ethnic diversity in New Jersey’s 7th Congressional District and the fact that 20 percent of its residents were born outside the U.S.", "“Democrats can talk about these issues so long as we frame them in the right way,” Malinowski insisted to me. “I’m not an alarmist. I speak calmly and precisely about what’s happening in our country and to our community.”", "***", "Malinowski’s presence on Capitol Hill — particularly his perch on the Foreign Affairs Committee — irks some of his Republican colleagues.", "“Anything to do with the horrid foreign policy of President Obama, it’s not healthy for our country so we can’t support that,” said Rep. Ted Yoho (R-Fla.), a longtime member of the Foreign Affairs Committee, naming the Iran nuclear deal and other cornerstones of Obama’s foreign policy. “The bad policies that [Obama] did have really damaged this country.”", "But Malinowski has also used his State Department experience to his advantage on the panel.", "During a committee debate about a War Powers Resolution to withdraw U.S. support for the Saudi-led coalition in ", ", Republicans were arguing that the effort was ill-conceived because the U.S. is not engaged in “hostilities” in Yemen. Malinowski fired back, explaining that he was involved in the discussions when the Obama administration decided to get involved in Yemen in the first place. The Obama administration considered the U.S. to be formally engaged in hostilities in Yemen, Malinowski countered.", "\n                            Rep. Tom Malinowski listens to California Rep. Jimmy Panetta discuss legislation supporting NATO  on  Jan. 22, 2019.   | Andrew Harnik/AP Photo", "“If a foreign power was bombing Washington, D.C., and a second foreign power was refueling the first power’s aircraft over Chesapeake Bay on their way to drop ordnance on the Capitol building, we’d consider both countries to be at war with us, obviously,” Malinowski told me. “And if we’re refueling Saudi aircraft, if we’re servicing them on the tarmac, helping them get back into the air, we’re part of this conflict. And therefore need to make responsible decisions.”", "Most — if not all — first-time members of Congress have never been in a classified briefing. Malinowski’s fellow freshman lawmakers often lean on his executive branch experience when drawing their own conclusions. Every Democrat ended up voting in favor of the ", ", a remarkable and rare show of Democratic unity on a fraught foreign-policy issue.", "“Witnesses can’t get things by him,” said Rep. Ted Lieu (D-Calif.), a fellow Foreign Affairs Committee member. “He’s able to provide a lot of knowledge for the members of the committee, but he also uses it on the floor.”", "***", "Despite the GOP criticisms, Malinowski is far from an Obama sycophant. During his tenure as assistant secretary of State for democracy, human rights and labor, he was often a dissenting voice among the Obama foreign-policy brass. Republicans like McCain took notice.", "“We fought together in the trenches to do something that we both passionately believed in,” Malinowski said of his work with McCain on banning the use of torture. “He won my lifelong loyalty and admiration in that fight.”", "But McCain, an ardent critic of Obama’s foreign policy, often used Malinowski as a punching bag to vent about what he viewed as a disjointed and dangerous series of foreign-policy decisions — including the last time they saw each other, in McCain’s Senate office in 2017.", "“He reamed me out about my support for banning arms sales to Saudi Arabia. He said, ‘Are you one of those people who think we should stop selling [precision-guided munitions] to Saudi Arabia?’ And he gave me a look that could kill,” Malinowski said with a laugh. “I tried to shift the subject as quickly as I could.”", "“I loved him. And he liked a good fight and always — he jumped into the toughest fights and was never afraid of taking a strong position on a difficult issue. And I try to be the same way. And sometimes that meant we were on opposing sides. And it did not and could not have affected our friendship.”", "Malinowski agreed with one of McCain’s central critiques of Obama’s foreign policy: that the U.S. should have done more to stanch the bloodshed in Syria after Obama’s “red line.” But Malinowski, who at the time was a senior official on the president’s national security team, couldn’t project his views publicly; instead, he tried to change Obama’s course from the inside.", "“When I was working with the president, for the president, I made my opinions known in a way that one responsibly does as a member of the administration,” he said.", "On Syria, though, Malinowski struck out. Obama was reluctant to do anything that would drag the U.S. into a prolonged conflict in the region, even as Syrian President Bashar Assad was deploying chemical weapons on his own people. Malinowski wanted to set up a no-fly zone well before Russia staged a military intervention in 2015; the idea would have been to prevent Syrian fighter jets from flying over cities like Aleppo and threaten to shoot down aircraft that crossed into opposition-held areas. But once the Russians got involved, all bets were off.", "Malinowski argues that had his view prevailed, the cascading and disastrous global effects of the Syrian civil war would have been mitigated — even prevented.", "“The 5 million refugees, the rise of ISIS, chemical weapons attacks, the Russian intervention — I think we had a chance to prevent those things, and they had an impact well beyond Syria,” Malinowski said. “I don’t think Brexit would have happened if not for Syrian refugees flooding Europe and creating this fear of an immigrant invasion. It affected our politics in ways that can’t be quantified, but it certainly affected our politics. The fear of ISIS and the fear of refugees have been a powerful driver in Western politics for the last few years. And both of those problems came to us courtesy of Syria.”", "***", "Searing foreign-policy dilemmas like Syria — when, and how, America should intervene abroad — have been dividing the Democratic Party for generations. During the Cold War, the left clashed with hawks like Washington Senator Henry “Scoop” Jackson over how seriously to take the Soviet threat; after the Cold War ended, it was conflicts like Bosnia and Iraq that fueled heated intraparty debates. But even though Trump has scrambled the usual trench lines on national security through his mix of isolationism and pugnacious nationalism, the Democratic Party is surprisingly unified on these issues — for now.", "House Democrats would be wise to take advantage of that unity, Malinowski argues, especially as liberal firebrands fuel intraparty divisions that often grab headlines and drive unfavorable media coverage of the House Democratic majority.", "His advice: Eyes on the prize.", "“We have the same basic vision for the general direction the country should go in,” Malinowski told me in closing. “We have interesting differences about how to do it, but those differences are not going to play out in a meaningful way in the House in the next two years because Donald Trump is the glue that holds us all together. We know the country’s in crisis. We know that this is not a time for transforming America. This is a time for saving America, preserving America. And there will be plenty of time, if we succeed in preserving our institutions, preserving our democracy, there will be plenty of time in the coming years to argue about differences in policy.”", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "Trump asked Christie about firing Mueller, being Comey intermediary", "body": ["\n                Christie told the FBI he had a phone call with the president in which Trump asked what the governor thought about the idea of firing the special counsel.  | Getty", "\n                    By ", "President Donald Trump asked former New Jersey Gov. Chris Christie about the prospect of firing Special Counsel Robert Mueller and also asked him to be an intermediary to FBI Director James Comey, according to the Mueller report released Thursday.", "The ", "reveals for the first time that Christie — who was fired as the head of Trump’s transition committee but remains a mostly-loyal ally to the president — was interviewed by FBI agents working on the investigation. ", "Story Continued Below", "Christie appears to have spoken to the agents sometime on or before Feb. 13, the date the agents filed a report summarizing the discussions. ", "It’s unclear how much ground the former Republican presidential candidate covered, but he relayed to the FBI the content of several exchanges with the president, providing enough relevant information that he is referenced several times in the 400-page report. ", "Most notably, Christie told the FBI he had a phone call with the president in which Trump asked what the governor — a lawyer and, at one time, the U.S. attorney in New Jersey — thought about the idea of firing the special counsel. ", "“Christie advised against doing so because there was no substantive basis for the President to fire the Special Counsel, and because the president would lose support from Republicans in Congress if he did so,” the report states.", "It’s unclear when the exchange took place, though Christie believed it was before June 7, 2017, when Christopher Wray — Christie’s former personal attorney — was nominated to be the new FBI director. Phone records indicate the two also had two calls in the weeks after that announcement, the report states.", "The discussion feeds into the Mueller team‘s analysis of whether the president obstructed justice — an issue about which the report draws no conclusion. ", "“This evidence shows that the President was not just seeking an examination of whether conflicts existed but instead was looking to use asserted conflicts as a way to terminate the Special Counsel,” the report states.", "Christie also discussed a meeting with Trump that occurred Feb. 14, 2017 — the day Michael Flynn, the national security adviser, was fired. Trump repeatedly asked Christie during the conversation to be an intermediary to Comey, who at the time still working at the FBI.", "Meeting at the White House over a Valentine’s Day lunch of meatloaf, the president told Christie he thought, now that Flynn was out, that “the Russia thing is over.” ", "Christie, ", " about some of the meeting details, said he told the president “this Russian thing is far from over” and they’ll “be here on Valentine’s Day 2018 talking about this.” ", "Trump, the report says, asked what Christie meant. “Flynn met with the Russians. That was the problem. I fired Flynn. It's over.”", "“Christie recalled responding that based on his experience both as a prosecutor and someone who had been investigated, firing Flynn would not end the investigation,” the report states. “Christie said there was no way to make an investigation shorter, but a lot of ways to make it longer.”", "Christie advised Trump not to talk about the inquiry — “even if he was frustrated at times” — and warned that Flynn would be “like gum on the bottom of your shoe.”", "Toward the end of their lunch, Christie told the investigators, Trump brought up Comey, with whom Christie had previously worked. Trump asked if Christie was still friendly with Comey — he was — and then asked him to reach out.", "“The President told Christie to call Comey and tell him the President ‘really like[s] him. Tell him he’s part of the team,’” the report states.", "Christie said he ignored the request because he viewed it as “nonsensical” and didn’t want to put Comey in such a position. ", "“Christie thought it would have been uncomfortable to pass on that message,” the report states.", "Three months later, in May 2017, Trump fired Comey. ", "After enduring negative coverage in the press, Trump phoned Christie, again seeking his advice. He said he was getting “killed” by the media and asked what he could do.", "“Christie asked, ‘Did you fire [Comey] because of what Rod wrote in the memo?” the report states, referring to a memo written by Deputy Attorney General Rod Rosenstein. Trump responded, “Yes.”", "The governor told the president he should “get Rod out there” to defend the decision, and Trump said it was a “good idea” and that he would call Rosenstein immediately. Rosenstein ended up refusing to “participate in putting out a ‘false story,’” the report states. ", "Matt Friedman's must-read briefing on the Garden State's important news of the day", "Our morning email about New Jersey health care policy and politics", "A morning email with must-read analysis and breaking news on New Jersey politics and policy.", "POLITICO New Jersey Pro's high-level outlook on the policy issues driving the month in New Jersey.", "Matt Friedman's must-read briefing on the Garden State's important news of the day", "\n                        POLITICO Pro", "A morning email with must-read analysis and breaking news on New Jersey politics and policy.", "\n                        POLITICO Pro", "Our morning email about New Jersey health care policy and politics", "\n                        POLITICO PRO", "POLITICO New Jersey Pro’s high-level outlook on the policy issues driving the month in New Jersey.", "\n                        POLITICO Pro", "Original federal and state policy documents", " © 2019 POLITICO LLC"]},
{"title": "Priebus predicts 2014 GOP 'tsunami'", "body": ["\n                Priebus says the GOP has 'demographic challenges.' | Michael Bonfigli/Christian Science Monitor", "\n                    By KATIE GLUECK", "\n                    Updated ", "Republican National Committee Chairman Reince Priebus on Tuesday predicted the 2014 midterms would be a “tsunami” victory for the GOP, and pointed to young people and women as two groups with whom his party hopes to gain ground. ", " His comments came at a breakfast sponsored by the Christian Science Monitor as Republicans mark the one-year anniversary of their Growth and Opportunity Project report, an “autopsy” conducted to determine how the party stumbled in 2012. ", "Story Continued Below", " “I think we’re in for a tsunami-type election in 2014,” Priebus said.”My belief is, it’s going to be a very big win, especially at the U.S. Senate level, and we may add some seats in congressional races. But I need to and we need to, at the RNC, make sure that we can capture the positives and the benefits we’ve been able to provide in 2014 and build on that to have success in 2016, which is a very different type of election.” ", " ( ", ") ", " He was bullish on the Senate, where Republicans need to net six seats to regain control. He pointed to red states where Democrats are seeking reelection, noting that in many of those places, President Barack Obama is deeply unpopular, and argued that the health care act is “total poison across the country.” ", " Since last year’s report, the RNC also has tried to improve the party’s showings with groups including minorities, young people and women —all demographics with which the GOP stumbled significantly in 2012. ", " “I’m just guessing here, but I think among youth and women, we’re gonna see the greatest increase in 2014 because of, No. 1, Obamacare,” Priebus said. “It’s very, very, very personal among women losing your doctor, getting your insurance canceled.” ", " ( ", ") ", " As he has argued before, he continued: “Then young people, Obamacare is intentionally designed to screw young people over. Actuaries sat down, decided, let’s just screw over everyone 35 and younger. That’s what they did.” ", " He acknowledged that the party has “some demographic challenges” and pledged that Republicans will “work like dogs to try to figure it out,” especially focusing on outreach to Asian, African American and Hispanic voters. ", " Democrats have argued that simply showing up to those communities isn’t sufficient; that the problem is with GOP policies. Shortly after the Monitor breakfast, the Democratic National Committee hosted a press conference of its own and released a report titled, “One year later, same old party.” ", " ( ", ") ", " “The biggest problem for the Republican Party … is who they are, what they believe, what they say, and how they govern,” the DNC ", " charged. ", " Democrats, Priebus insisted at the breakfast, “have demographic challenges too. But for whatever reason, we seem to be obsessed with our own.” ", " Priebus was asked repeatedly, however, about comprehensive immigration reform — something the autopsy report strongly endorsed, but which has met stiff opposition from some in the GOP. He argued that an ideologically wide range of Republicans support some measure of change to the immigration system, even if not everyone agrees on details. ", " “I would … caution you not to impose your definition of what comprehensive immigration reform is,” he told one reporter at the breakfast. “There’s a general agreement that we need to have serious immigration reform, but I don’t believe there’s general agreement as to what that reform is.” ", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "Dems join GOP in Shinseki pile-on", "body": ["\n                Calls for Shinseki's ouster grew after a report found VA facilities concealing wait times. | AP Photos", "\n                    By ", " and JEREMY HERB", "\n                    Updated ", "Veterans Affairs Secretary Eric Shinseki’s support on Capitol Hill crumbled on Wednesday as members of his own party deserted him in the aftermath of a highly critical inspector general report that found “systemic” problems at VA medical facilities. ", " Within just hours of the report’s release, the number of Democrats calling for Shinseki’s resignation more than doubled. By Wednesday evening, more than a dozen congressional Democrats publicly called for his ouster, joining a growing number of influential Republicans. ", "Story Continued Below", " For now, President Barack Obama isn’t calling on Shinseki to step down. ", " ( ", ") ", " Among those pushing for his dismissal are the Senate’s most vulnerable Democrats, whose reelection bids are critical to the party maintaining control of the chamber next year. Democratic Sens. Mark Udall of Colorado, John Walsh of Montana and Kay Hagan of North Carolina released separate statements saying the secretary must go, reflecting pressure to break ranks with the Obama administration during an election year. Late Wednesday night, Sen. Al Franken (D-Minn.) and Jeanne Shaheen (D-N.H.) added their voices to the chorus of Democrats asking for a shake-up in leadership at the VA. ", " “The systemic problems at the U.S. Department of Veterans Affairs are so entrenched that they require new leadership to be fixed,” Udall said in a statement. “Secretary Shinseki must step down.” ", " “The Inspector General’s report confirms the worst of the allegations against the VA and its failure to deliver timely care to veterans. It is time for President Obama to remove Secretary Shinseki from office,” Walsh said. ", " ( ", ") ", " Hagan said “we can no longer put our faith in the current VA leadership’s ability to fix these problems.” ", " Senate Democrats plan to address accountability at the VA next week when they return to Washington. ", " The review released Wednesday found at least 1,700 veterans waiting for health care at the Phoenix Veterans Affairs medical facility were not included on the facility’s wait list, and patients there waited an average of 115 days for their first appointments. The probe also documented several schemes used at VA facilities intended to conceal wait times and concluded that the problems are national in scope. ", " The revelations increased the pressure on Obama as Republicans seek to portray his administration as dysfunctional. White House Chief of Staff Denis McDonough briefed Obama on the report. White House press secretary Jay Carney said Obama “found the findings extremely troubling.” ", " ( ", ") ", " Shinseki said he is directing his organization to immediately assist the hundreds of veterans in Phoenix that are waiting for care and is rapidly accelerating outreach to veterans. ", " “I have reviewed the interim report, and the findings are reprehensible to me, to this Department, and to Veterans,” Shinseki said in a statement that offered no indication that he would step down. ", " The Democratic criticism wasn’t limited to the Senate. Democratic Reps. Scott Peters of California, Bruce Braley of Iowa and Ron Barber of Arizona also called for his dismissal. ", " Peters and Barber are facing tough challenges from Republicans and Braley is running for an open Senate seat in Iowa. ", " Another Democrat with a tough road to reelection, Sen. Mark Begich of Alaska, will hold a press conference on the VA on Thursday. And Mary Landrieu’s campaign issued a statement highlighting the Louisianan’s support for a House-passed bill that would allow the VA to fire those involved in the scandal. ", " The Democratic response only added to growing criticisms from the GOP. ", " Three Republicans who are influential on military issues — House Committee on Veterans’ Affairs Chairman Jeff Miller (R-Fla.), House Armed Services Chairman Buck McKeon (R-Calif.) and Sen. John McCain (R-Ariz.) — said Shinseki must step aside. The trio had avoided calling for Shinseki’s ouster but were swayed by the damning IG report that found scheduling problems — first reported in Arizona — appeared to be of national scope. ", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]},
{"title": "Mueller is everywhere, except the midterms", "body": ["\n                Party operatives and candidates say special counsel Robert Mueller's probe is best handled as mood music rather than as a primary argument to be used to drive turnout. | Alex Wong/Getty Images", "\n                        ", "\n                        Campaign ads and debates are mostly avoiding the Russia investigation in favor of other issues important to voters.", "\n                    By ", "Special counsel Robert Mueller can’t escape the headlines, or President Donald Trump’s obsessive Twitter feed. But there’s one place the lead Russia investigator has been noticeably absent: the 2018 campaign trail.", "Mueller and his inquiry are missing from the campaign advertising airwaves in the final sprint to November. Debates have all but ignored the story, focusing instead on kitchen-table topics like the economy, health care and taxes. Vulnerable Democrats in red states are actually emphasizing the times they’ve reached across the aisle.", "Story Continued Below", "That’s on purpose, candidates and operatives from both parties told POLITICO. Most Americans are barely following the Mueller investigation’s intricate legal movements, which have already", " a few top former Trump aides, alleged Kremlin-backed hackers and a", " scattered across both sides of the Atlantic.", "Most important, voters don’t want to talk about it either.", "“In our state, we’re losing 70 to 80 dairy farms a month,” said Sen. Tammy Baldwin of Wisconsin, a Democrat whose reelection bid has largely avoided mentioning Mueller. “I can tell you in rural Wisconsin that’s what people are asking me about rather than something that is, well, just, it’s immediate to them.”", "Your guide to the permanent campaign — weekday mornings, in your inbox.", "By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.", "Sen. Ted Cruz (R-Texas), another in-cycle 2018 candidate, explained: “Washington reporters live in a different world from the American people. That’s been true for two years where the media is obsessed with the latest and constant slams on the president. People of Texas are interested in jobs.”", "It’s a rare phenomenon in modern American politics to have a midterm election coincide with a major investigation that delves into anything related to the president. Even rarer is the phenomenon of voters going to the polls at the same time that an investigation remains active into questions of criminality tied to the winning campaign from the most recent presidential election.", "That makes predicting the Mueller inquiry’s influence on voters that much more challenging, and why Democratic and Republican party operatives and candidates say the topic is best handled as mood music rather than as a primary argument to be used to drive turnout.", "“It’s not the best thing for Democrats to be talking about right now,” said Robby Mook, the former Hillary Clinton 2016 campaign manager. “We just need to let Mueller do his job. Politicizing it even more isn’t going to help that.”", "Sen. Cory Gardner (R-Colo.), who is leading his party’s 2018 campaign efforts, said in an interview that the most vulnerable Democratic incumbents didn’t want to address the Mueller investigation because it would clash with their campaign strategy of showing deference to Trump’s White House.", "“In states like Missouri, Indiana, North Dakota, Montana, the red-state Democrats are running ads about how closely they work with President Trump,” Gardner said. “So, it’s difficult to talk about an investigation at the same time they’re trying to be his best friend.”", "Mueller isn’t totally missing from the midterm discussions. Candidates say they’ve prepared responses to talk about the investigation if it comes up in debates. And while television advertisements have mostly avoided the Russia inquiry, a few campaigns and outside groups like the pro-Democrat House Majority PAC have spent a couple of thousand dollars on Facebook ads designed to increase their own small-dollar donations from blue-state bastions like California, New York and Oregon. Baldwin’s campaign, for example, last month bought a few Mueller-themed Facebook ads seeking campaign contributions.", "Some candidates have even clashed over Mueller. In Oklahoma, Republican House candidate Kevin Hern went after one of his primary rivals earlier this summer with one of the rare television ads this cycle to mention the special counsel. In Virginia, Democratic Sen. Tim Kaine took issue during one of his recent debates with GOP opponent Corey Stewart, who has mimicked Trump in calling the investigation a “witch hunt.”", "“I wouldn’t say it’s the major note in the chord, but it’s definitely an issue,” Kaine said in an interview.", "Trump is doing his part to elevate Mueller into the national dialogue in a bid to excite his own base amid fears that Republicans will lose their majority in the House and perhaps the Senate. The president’s team has", " one of its central campaign arguments the prospect that a Democratic takeover in Congress would use the special counsel’s findings as a launching pad for impeachment proceedings. On Twitter, Trump has slammed the Mueller “witch hunt” nearly 50 times since the July Fourth holiday, and his “no collusion” riff is a recurring element of campaign rally speeches where Republican candidates are supposed to be the featured attraction.", "\n                    ", "\n                    By ", "Still, part of the reluctance of down-ballot candidates to embrace the Mueller investigation stems from the mixed bag of recent history.", "The 1974 midterms came just three months after President Richard Nixon’s resignation over the Watergate scandal and amid soaring inflation, an energy crisis and the fallout from President Gerald Ford’s controversial pardon of his predecessor. That November, Democrats picked up four Senate seats (getting them to 60 overall) and won 49 House seats from Republicans, which left them just one seat shy of holding a veto-proof supermajority. The new lawmakers who campaigned on the ethical cloud in Washington were branded “Watergate babies.”", "But Kaine, the Democratic vice presidential nominee in 2016, said the comparison between 1974 and 2018 doesn't work, because Mueller’s probe is not finished.", "“You didn’t get a Watergate election during the middle of the Watergate investigation,” he said. “You got a Watergate election after all was said and done and there was accountability.”", "“That’s a once-in-a-century event,” added a veteran Republican campaign operative working with both House and Senate candidates in the 2018 cycle.", "The 1998 midterms offer lessons of a different kind. That September, the Republican-led House voted to release independent counsel Kenneth Starr’s salacious report about President Bill Clinton’s extramarital affair with a White House intern.", "Democrats fretted that they’d get killed at the polls as even more materials tied to the Starr investigation were made public in the ensuing weeks. “Death by a thousand cuts,” said then-Rep. Robert Wexler (D-Fla.), according to a Chicago Tribune report at the time. Republicans put both Clinton’s scandal and his potential impeachment out as a central plank of their midterm message.", "It backfired.", "Instead of the GOP meeting its projections for blockbuster gains cementing their House and Senate majorities, the president’s party for the first time since World War II ended up winning seats in the midterms. Then-Speaker Newt Gingrich, who had elevated the Clinton scandal into a midterm campaign issue, lost his leadership post and resigned from Congress altogether the next January.", "“This was a Seinfeld election,” the analyst Curtis Gans, who was tracking voter turnout, told The New York Times after the election results had rolled in. “He said his show wasn’t about anything, and neither was this election.” The Associated Press cited exit polls showing just 5 percent of voters called the Clinton scandal the most important issue on the ballot.", "\n                    ", "\n                    By ", "Considering the history from 1998, Democrats are getting credit for their message discipline and not taking the bait to make this year's midterm race into a referendum on Trump’s legal woes from the Mueller investigation.", "“I think one of the problems Republicans face is that the Democrats quit harming themselves with Russia and actually started talking to voters about things that matter,” said Mike Shields, the former chief of staff at the Republican National Committee. “I would rather they went back to Russia.”", "Political operatives say neither Democrats nor Republicans want to talk about the Mueller probe in no small part because it isn’t breaking through with everyday Americans already deluged by an onslaught of Trump stories.", "“People are anesthetized to it,” said Rory McShane, a GOP strategist working on 2018 races in Arizona, Maryland, Massachusetts, Nevada and Tennessee.", "The special counsel’s lack of public commentary also hardly makes for good campaign material, said Larry Sabato, director of the University of Virginia Center for Politics.", "“Mueller is the great sphinx so far,” Sabato said. “No one really knows what he’s thinking or how far his investigation has come. It’s hard to grab onto fog.”", "Sabato noted that even he had lost track of the Mueller probe — a good example of why the topic isn’t front and center with candidates or midterm voters.", "“I follow politics all day long,” he said. “Imagine how people who actually work for a living feel. Most don’t have a clue about what is really there. It’s a very, very complicated story that Mueller, one hopes, will eventually explain in a way everyone can understand.”", "But, Sabato added, “he’s not going to do it in the next month.”", "Missing out on the latest scoops? Sign up for ", " and get the latest news, every morning — in your inbox.", "\n                                            By ", "\n                                            By ", "\n                                            By ", "\n                                            By ", " © 2019 POLITICO LLC"]}
]